[
    {
        "name": "",
        "ingredients": [
            ""
        ],
        "instructions": [
            ""
        ],
        "cook_time": "",
        "cuisine": "indian"
    },
    {
        "name": "Bengali Dal Bori",
        "ingredients": [
            "2 cups masoor dal",
            "½ tsp salt",
            "½ tsp kalonji",
            "2 Tbsp oil"
        ],
        "instructions": [
            "Begin by washing the dal properly, and then soak it for at least six hours, and more if necessary. Once that's done, grind the dal really well. While it was done by hand in earlier days, a good food processor helps. Make sure there's not too much water in it though. The idea is to get a thick paste-like dough. ",
            "Now take the salt and the kalonji and add it to the paste. You need to whip the mixture hard, use a hand mixer, so that the batter becomes light. In the olden days, these boris were made by hand - taking a little mixture and making tear drop shapes on a newspaper and putting them out in the sun to dry. You can of course use an icing bag with a round nozzle. If a newspaper is too passé for you, use a metal tray and brush it with some oil so it doesn't stick. It takes a whole day in the sun for the dumplings to dry; keep it out for longer if it takes it time. ",
            "When it's ready it should be completely dry; crush one in your hand if it crumbles easily, it's done. You can store these in an airtight container for a few days. ",
            "To cook with it, you need to gently sauté it in oil before adding it in anything. "
        ],
        "cook_time": "40 minutes + 1 day for drying",
        "cuisine": "indian"
    },
    {
        "name": "Cheese & Jalapeno Stuffed Kachori",
        "ingredients": [
            "500 gm of flour ",
            "15 gm of ajwain ",
            "1/4 cup of oil ",
            "Oil for frying",
            "20 gm of salt ",
            "100 gm of cottage cheese ",
            "50 gm of Cheddar cheese ",
            "50 gm of jalapeno "
        ],
        "instructions": [
            "1.Sieve flour, put oil and rub with your palm.",
            "Then add salt, Ajwain, black onion seed and mix well.",
            "Make a well in the center, add enough water and knead into stiff dough. Make small size of balls and keep a side.",
            "Heat oil, add ajwain and cottage cheese. Cooke for some time with salt and red chili powder.",
            "Keep this mixture for cooling. Now add grated cheddar cheese and chopped jalapeno.",
            "Stuffed this mixture in inside the balls and flatten with your palm.",
            "Deep fry and serve hot with tamarind chutney."
        ],
        "cook_time": "30 Minutes ",
        "cuisine": "indian"
    }
 ]
