[
    {
        "name": "Quick Salted Caramel Pie",
        "ingredients": [
            "1 1/2 cups Marie biscuits, crushed",
            "5 Tbsp unsalted butter",
            "2 tsp powdered sugar",
            "3 cups cream cheese",
            "2 1/4 cups heavy cream",
            "1/2 cup brown sugar",
            "For salted caramel",
            "1 1/2 cups brown sugar",
            "110g unsalted butter",
            "1/2 cup double cream",
            "Salt, a pinch"
        ],
        "instructions": [
            "Mix the first three ingredients together and flatten into your serving dish. There, that's your super-fast crust done. Cover and keep in the fridge while you work on your filling.",
            "Now, for the salted caramel. Pour in 1/3 cup of water into a saucepan, bring to the boil and add in the sugar, stirring gently until it melts and starts bubbling. Carefully pour in the butter, and whisk until everything is fully mixed. ",
            "Add the cream in and mix thoroughly. Add the salt, and you're done! Now let the mixture cool. If you just want a caramel filling, simply leave out the salt.",
            "Mix in the cream cheese, brown sugar and cream thoroughly, until they make a thick creamy paste. ",
            "Add in your cooled caramel mixture, mixing well, pour into your crust and refrigerate overnight, at least 12-14 hours. It'll be set and ready to eat the next day."
        ],
        "cook_time": "1 hour + refrigeration",
        "cuisine": "american"
    },
    {
        "name": "Sweet Potato Pie",
        "ingredients": [
            "Yams (red skinned) 450g",
            "Condensed milk 150g",
            "Sugar 1 tbsp",
            "Small egg 1",
            "Cinnamon a pinch",
            "Marshmallows to decorate",
            "For the Pie Dough",
            "350g + extra all-purpose flour",
            "1 tsp salt",
            "275g butter",
            "5 Tbsp ice cold water",
            "1 egg, beaten"
        ],
        "instructions": [
            "Bake the yams until they have softened completely - they should \nbe extremely tender. Cool, discard the skin and then blend the flesh \ninto a paste. ",
            "Mix the paste with the remaining ingredients and whisk \nwell until everything is smooth and perfectly blended - you don't want \nany lumpy bits in your filling. ",
            "Add the filling into your crust and bake\n (about 50 minutes to 1 hour). Make sure to let it cool, then place in \nthe fridge overnight.",
            "For the Pie Dough:",
            "First, thoroughly blend your salt and flour together in the food processor.",
            "2.\n Cut the butter into evenly-sized cubes, place them evenly on top of the\n dry ingredients in your food processor, and then mix in short bursts. \nDo this until the dough becomes clumpy and wet, and no flour remains. \nThis may take a while.",
            "Now bring out the dough and place onto a\n heavily-floured surface. Add the cold water in, spoon by spoon, gently \nfolding to make sure it is all absorbed. Then divide the dough into two \nportions (one for the bottom of the pie and one for the top) and roll \nboth the pieces into discs. Wrap these discs separately in cling film \nand let them rest in the fridge for at least two hours.",
            "When \nyou are ready to bake, bring out the dough and roll it out, in one \ndirection, on a surface that has been heavily floured. Do this gently \nand do not flip it around too much like a chapati. Lay the dough on to \nyour baking pan, making sure that it goes all round the sides, letting \nit hang over the rim. Prick it all the way round with a fork. Pour your \nfilling into the dough and then unfurl the second disk in the same way \nto make a crust for the top. For a sweet pie, you can even make a \nwonderful criss-cross lattice design if you prefer.",
            "Lightly \nbrush the egg on top the pastry (this egg wash will give your pastry \nthat gorgeous golden glow), and cut four slits into the dough on the \ntop. Bake in a preheated oven until golden (approximately an hour at 400\n degrees)."
        ],
        "cook_time": "1 hour + 2 hours chilling",
        "cuisine": "american"
    },
    {
        "name": "Prawn Pie",
        "ingredients": [
            "2 Tbsp oil",
            "450g prawns",
            "1 onion, chopped",
            "2 Tbsp flour",
            "1 1/2 cups heavy cream",
            "Salt and pepper to taste",
            "For the Pie Dough",
            "350g + extra all-purpose flour",
            "1 tsp salt",
            "275g butter",
            "5 Tbsp ice cold water",
            "1 egg, beaten"
        ],
        "instructions": [
            "Heat the oil in a saucepan at medium heat. Add in the onion and cook \nuntil it turns golden. Add the cream and raise to high heat, until the \nsauce thickens a little. Keep stirring gently. Add in the prawns and \nseasoning. Then pour the prawn mixture into the pie dough and bake.For the Pie Dough:",
            "First, thoroughly blend your salt and flour together in the food processor.",
            "Cut the butter into evenly-sized cubes, place them evenly on top of the dry ingredients in your food processor, and then mix in short bursts. Do this until the dough becomes clumpy and wet, and no flour remains. This may take a while.",
            "Now bring out the dough and place onto a heavily-floured surface. Add the cold water in, spoon by spoon, gently folding to make sure it is all absorbed. Then divide the dough into two portions (one for the bottom of the pie and one for the top) and roll both the pieces into discs. Wrap these discs separately in cling film and let them rest in the fridge for at least two hours.",
            "When you are ready to bake, bring out the dough and roll it out, in one direction, on a surface that has been heavily floured. Do this gently and do not flip it around too much like a chapati. Lay the dough on to your baking pan, making sure that it goes all round the sides, letting it hang over the rim. Prick it all the way round with a fork. Pour your filling into the dough and then unfurl the second disk in the same way to make a crust for the top. For a sweet pie, you can even make a wonderful criss-cross lattice design if you prefer.",
            "Lightly brush the egg on top the pastry (this egg wash will give your pastry that gorgeous golden glow), and cut four slits into the dough on the top. Bake in a preheated oven until golden (approximately an hour at 400 degrees)."
        ],
        "cook_time": "1 hour + 2 hours chilling",
        "cuisine": "american"
    },
    {
        "name": "Egg and Cheddar Cheese Sandwich",
        "ingredients": [
            "1 egg",
            "Salt to taste",
            "Pinch of pepper",
            "20 gm of cheddar cheese",
            "2 slices of ham",
            "1 Tbsp of mustard sauce",
            "3 basil leaves"
        ],
        "instructions": [
            "Grab a cupcake tray and grease it.",
            "Break the egg into the mould and dust it with salt and pepper.",
            "Pre-heat the oven for 15 minutes and then put the tray in.",
            "Let it bake for about 5-6 minutes. You'll be able to see when the egg is done.",
            "Pull it out and chop it into medium-sized pieces.",
            "Add some ham and cheese to the mix and heat it in the microwave for a few minutes so that the cheese melts.",
            "Put it on toast and dress it up with basil and mustard."
        ],
        "cook_time": "20 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Beer Chicken Tartar",
        "ingredients": [
            "2 pieces of chicken supreme",
            "4 Tbsp buttermilk           ",
            "1 tsp salt               ",
            "Tartar Sauce:",
            "4 Tbsp mayonnaise             ",
            "1 tsp gherkins               ",
            "1 tsp green olives       ",
            "1 tsp shallots ",
            "1/2 tsp parsley, to garnish",
            "Batter:",
            "3 Tbsp corn flour                ",
            "1 Tbsp refined flour              1/2 tsp salt                    ",
            "1/2 tsp Baking Powder            ",
            "5 Tbsp Beer    "
        ],
        "instructions": [
            "Clean the chicken thoroughly and then dip into home-made buttermilk and salt for at least an hour.",
            "3. Keep it in the refrigerator at least for one hour at 4 degree Celsius. ",
            "In the mean time, prepare the tartar sauce. Mix all the ingredients: mayonnaise, gherkin, green olives, shallot, salt and pepper. ",
            "5. Now, mix all the ingredients for the batter. Be sure it isn't too runny or it won't stick to the chicken properly. ",
            "5. Pull out marinated chicken supreme from refrigerator, dip it into the batter dunk it into a hot fryer.",
            "Fry it till it turns golden in color & then take it out from fryer. ",
            "7. Put it on paper towel to remove extra fat.",
            "Serve it hot with tartar sauce.",
            "Tips: You can use water in place of beer.",
            ""
        ],
        "cook_time": "Prep time: 1 Hour, Cook time: 5-7 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Old Monk Sticky Chicken Wings",
        "ingredients": [
            "8 chicken wings without skin",
            "150 Hung curd",
            "1/2 tsp chilli powder ",
            "1/2 tsp sweet paprika powder",
            "1 tsp English mustard paste",
            "1 tsp garlic paste",
            "Salt - to taste",
            "Olive oil- for marination",
            "Chopped garlic - 1 tsp",
            "Old monk rum - 10ml",
            "Bbq sauce - 4 Tbsp."
        ],
        "instructions": [
            "Mix together all the ingredients and marinate chicken wings in it for 2 hours or more.",
            "Now roast chicken wings in an oven.  ",
            "Take a pan, pour some oil and add some chopped garlic.",
            "When garlic gets brown, add 4 Tbsp. of barbeque sauce and cook for sometime.",
            "Now, add roasted chicken wings.",
            "Flambe with rum.",
            "Serve."
        ],
        "cook_time": "35 Minutes + Marination Time",
        "cuisine": "american"
    },
    {
        "name": "Classic American Pancakes",
        "ingredients": [
            "1 cup all-purpose flour",
            "2 1/2 tsp baking powder ",
            "1/2 tsp salt ",
            "3/4 Tbsp white sugar ",
            "3/4 cups milk ",
            "1 small egg ",
            "2 Tbsp butter, melted ",
            "Toppings",
            "Melted butter",
            "Maple syrup or honey",
            "Mixed berries (or any other mixed fruit of your choice)",
            "Powdered sugar"
        ],
        "instructions": [
            "In a large bowl, bring  together all the dry ingredients. Make a well in the center and pour in the milk, egg and melted butter. Mix until smooth batter is formed.",
            "Heat a lightly oiled frying pan over medium high heat. Pour the batter onto the pan, using approximately 1/4 cup for each pancake.",
            "Brown on both sides and stack 2-3 pieces on a plate. ",
            "Sprinkle with some dusted sugar and top with some whole mixed berries. Serve melted butter and maple syrup on the side."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "american"
    },
    {
        "name": "All American Carrot Cake",
        "ingredients": [
            "140 gm brown sugar    140 ml oil refined",
            "500 gm quark cheese",
            "250 gm icing sugar",
            "60 gm white butter    250 gm carrot",
            "150 gm walnut",
            "170 gm pineapple",
            "3 eggs",
            "11 gm cinnamon powder",
            "12 gm nutmeg",
            "10 gm baking powder",
            "10 gm baking soda",
            "Salt to taste",
            "230 gm mascarpone cheese"
        ],
        "instructions": [
            "Mix together the finely grated carrot, refined oil, castor sugar and brown sugar.",
            "In another mixing bowl, mix flour, baking powder, nutmeg powder, cinnamon powder, vanilla essence and eggs.",
            "In a different bowl, mix chopped walnuts and chopped pineapple. Keep aside.",
            "Mix all of the above and dunk it in a baking dish. Let it bake for 45 min at 180C.",
            "After baking, leave it in the oven for 15-20 minutes to rest.",
            "Take out the cake and put it in the freezer to chill.",
            "In another bowl, mix the quark cheese, mascarpone cheese, white butter and icing sugar and keep aside.",
            "Cut the carrot cake in the centre horizontally and fill it with quark cheese and icing sugar."
        ],
        "cook_time": "1 hour, 30  minutes",
        "cuisine": "american"
    },
    {
        "name": "Grilled Herb Chicken Breast with Honey and Asparagus",
        "ingredients": [
            "Chicken",
            "1/2 pound chicken breast, skinless    5 ml honey  5 ml lemon",
            "A pinch of thyme",
            "Salt to taste",
            "A pinch of black pepperSauce",
            "10 ml red wine",
            "30 ml brown sauce",
            "A pinch of rosemary",
            "4 potatoes, boiled and thinly sliced"
        ],
        "instructions": [
            "In a large bowl, whisk together honey, lemon juice, thyme, black pepper and salt.",
            "Preheat the grill to medium heat.",
            "Place the chicken breast in a bowl with the sauce and let it marinate for 15 minutes. Turn it occasionally.",
            "Take a pan and fill it with water up to 1 inch. Bring the water to a boil and blanch the asparagus and potatoes for 1-2 minutes. Shock the asparagus in iced water and drain it well.",
            "Grill the chicken over medium heat for 6 -7 minutes per side or until cooked through.",
            "Grill the asparagus for 4 minutes or until tender-crisp, turning occasionally.",
            "Brush chicken and asparagus with the leftover marinade.",
            "Serve chicken with asparagus and potatoes."
        ],
        "cook_time": "1 Hour",
        "cuisine": "american"
    },
    {
        "name": "Mint Julep",
        "ingredients": [
            "60 ml Jim Beam ",
            "6-8 mint leaves ",
            "3 lemon wedges ",
            "100 gm crushed ice ",
            "Sugar to taste "
        ],
        "instructions": [
            "Put all ingredients in a glass.",
            "Mix well with ice.",
            "Garnish with mint leaves before serving."
        ],
        "cook_time": "10 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Pancake",
        "ingredients": [
            "1/2 cup maida ",
            "1 egg ",
            "1/4 cup milk ",
            "Water as required ",
            "1/4 tsp salt ",
            "1 tsp oil ",
            "2 Tbsp oil for cooking the pancakes "
        ],
        "instructions": [
            "Mix flour, salt, egg, oil and enough milk to form a smooth paste. ",
            "Add the rest of the milk and some water to make a batter that falls smoothly off the spoon in a thick stream. ",
            "Let it rest for 15 minutes. ",
            "Put a heavy based frying pan over high heat and add one Tbsp of oil. ",
            "Once the oil is hot lower the heat, turn the oil around in the pan, and drain\n off the excess oil leaving the pan only brushed with oil. ",
            "Turn up the heat again, and pour enough batter for 1 pancake in the pan and spread it out. ",
            "Lower the heat, cook on one side till light brown, then turn over and brown the other side. ",
            "And serve."
        ],
        "cook_time": "20 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Apple Sausage Plait",
        "ingredients": [
            "200 gms flour ",
            "100 gms diced chilled butter ",
            "2 egg yolks ",
            "2-3 Tbsp chilled water ",
            "For the filling:1 Tbsp butter ",
            "2 diced onions ",
            "1 large apple - peeled, cored and diced, grated rind ",
            "1 lime ",
            "1 Tbsp quick cooking oats ",
            "1 tsp dried basil ",
            "1 Tbsp fresh herbs ",
            "2 Tbsp chopped gherkins ",
            "400 gm sausage meat ",
            "1 egg beaten ",
            "1 tsp of milk to glaze"
        ],
        "instructions": [
            "Rub butter with flour until mixture resembles breadcrumbs.",
            "Bind with yolks and water.",
            "Knead lightly until soft dough is formed. Allow it to chill.",
            "Melt butter in a saucepan and add onions.",
            "When they soften, add apples and rind and cook for 5 minutes.",
            "Cool and add remaining ingredients. ",
            "Roll pastry into a rectangle and brush with beaten egg.",
            "Slice the edges diagonally.",
            "Arrange the mixture in center. Seal the pastry. ",
            "Cool, glaze and bake at 190 degrees C for about 30 minutes."
        ],
        "cook_time": "1 Hour",
        "cuisine": "american"
    },
    {
        "name": "Chicken and Fish 65 Burgers",
        "ingredients": [
            "2 Tbsp ginger-garlic paste",
            "3 tsp red chili powder",
            "1 1/2 tsp turmeric powder",
            "2 tsp coriander powder",
            "Handful curry leaves",
            "5 Tbsp refined oil",
            "Salt to taste",
            "100 gm chicken breast",
            "200 gm fish fillet",
            "200 gm rice flour to coat",
            "2 Tbsp mayonnaise",
            "3 tsp tomato ketchup",
            "1/2 tsp Tabasco ",
            "3 burger buns",
            "1 onion",
            "3 tomatoes"
        ],
        "instructions": [
            "In a bowl add the ginger-garlic paste, chili powder, turmeric powder, a tsp of coriander powder & some chopped curry leaves. ",
            "Season it with some salt and drizzle a Tbsp of refined oil to bring it all together.",
            "Trim the chicken breast and cut the fish fillet.",
            "Add marinate on each piece, making sure that the pieces are nicely coated with the masala. ",
            "In a non-stick pan, add refined oil and let it heat up. ",
            "Roll the chicken and fish pieces in rice flour till they are fully coated & shallow fry the coated chicken and fish  in the non-stick pan.",
            "Take the burger buns and slit open from the center.",
            "Spread the burger sauce over half of the burger bun halves.",
            "Add the chicken breast on one half and fish pieces on the other.",
            "Then add tomatoes and onion slices and lettuce on each of them.",
            "Sprinkle some pepper to taste and cover both chicken and fish  with the other half bun halves.",
            "For the burger sauce:",
            "In a bowl, add mayonnaise, tomato ketchup and some Tabasco sauce for a tangy taste.",
            "Then add coriander powder and chili powder.   3. Whisk it all together.",
            "Serve the burgers with a light apple salad. "
        ],
        "cook_time": "30 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Chilli Burgers with Pepper Relish",
        "ingredients": [
            "50 gm butter ",
            "2 large diced onions ",
            "3 chopped red chillies ",
            "2 tsp cumin roasted, ground ",
            "400 gm lamb, minced ",
            "1 Tbsp mustard ",
            "1 Tbsp Worcestershire sauce ",
            "300 gm kidney beans, pureed, cooked ",
            "75 gm fresh bread crumbs ",
            "4 Tbsp  parsley, chopped",
            "1 large egg, beaten ",
            "Oil for shallow frying ",
            "6 buns",
            "1 onion, sliced ",
            "2 large tomatoes, sliced",
            "1  lettuce, shredded",
            "Flour to coat ",
            "For roasted pepper relish:",
            "1/2 kg red bell peppers, quartered and seeded ",
            "1 tsp roasted cumin ",
            "2 Tbsp chilli sauce, mild and sweet ",
            "50 ml salad/olive oil"
        ],
        "instructions": [
            "For the relish: ",
            "Grill peppers until skin blackens. Remove skin. ",
            "Blend the peppers with cumin and sauce until smooth. ",
            "Gradually add oil. ",
            "Cover and chill before using.",
            "For the chilli burger:",
            "Heat butter, add onion, chillies and cumin. ",
            "Cook until onion softens. ",
            "Combine with meat, mustard, sauce, bean paste, breadcrumbs, parsley and egg. Mix well. Shape into 6 large patties. ",
            "Chill well and coat with flour. Shallow fry in hot oil until colored and cooked. ",
            "Halve and toast bread rolls. Spread with relish, top with burgers, lettuce, onion rings and tomato slices. "
        ],
        "cook_time": "30 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Old Fashioned Apple Pie",
        "ingredients": [
            "For the pastry:",
            "600 gm all purpose flour",
            "1 tsp salt",
            "2 Tbsp sugar",
            "250 gm frozen butter",
            "1 1/2 cups ice water",
            "For the filling:",
            "2 Tbsp all-purpose flour, plus more for dusting",
            "12 Granny Smith apples, peeled, cored, and sliced",
            "3/4 cup sugar, plus additional for pie top",
            "Zest and juice of 1 lemon",
            "1 1/2 tsp cinnamon",
            "1/2 tsp nutmeg",
            "Pinch ground cloves",
            "2 Tbsp unsalted butter",
            "1 large egg, beaten"
        ],
        "instructions": [
            "Heat oven to 375 degrees. On a lightly floured surface, roll out pate brisee into two 1/8-inch-thick circles to a diameter slightly larger than that of an 11-inch plate. Press one pastry circle into the pie plate. Place the other circle on waxed paper, and cover with plastic wrap. Chill all pastry until firm, about 30 minutes.",
            "In a large bowl, combine apples, sugar, lemon zest and juice, spices, and flour. Toss well. Spoon apples into pie pan. Dot with butter, and cover with remaining pastry circle. Cut several steam vents across top. Seal by crimping edges as desired. Brush with beaten egg, and sprinkle with additional sugar.",
            "Bake until crust is brown and juices are bubbling, about 1 hour. Let cool on wire rack before servingPrem Kumar Pogakula is a Sous Chef at The Imperial, New Delhi."
        ],
        "cook_time": "1 Hour 45 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Cola BBQ Sauce",
        "ingredients": [
            "1 onion, diced",
            "1 tomato, diced",
            "1 green chilli",
            "1 tsp chilli flakes",
            "2 Tbsp tomato ketchup",
            "1 jalapeno",
            "1/2 tsp tobasco",
            "1 tsp soy sauce",
            "1/2 cup white wine vinegar",
            "1/2 cup sugar",
            "1/2 cup cola (You can use any black soft drink)"
        ],
        "instructions": [
            "In a food processor / mixie add onion, tomato, green chilli, chilli flakes, tomato ketchup, jalapeno chilli, Tabasco, soy sauce. Give it a mix. Keep aside.",
            "In a saucepan add white wine vinegar and sugar. Let it reduce by half. Then add the tomato-onion mix. Let it simmer.",
            "Add cola and let it cook for 10 minutes.",
            "BBQ cola sauce is ready!",
            "Apply it on sausages or prawns, char grill them. Serve!"
        ],
        "cook_time": "30 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Lentil-Mushroom Burgers",
        "ingredients": [
            "5 whole-wheat hamburger buns",
            "2-3 Tbsp olive oil",
            "1 medium onion, diced small",
            "3 cloves of garlic, minced",
            "1 package cremini or button mushrooms, minced",
            "4 sun-dried tomatoes, chopped fine",
            "1 cup cooked brown lentils ",
            "1/2 an egg",
            "Salt",
            "Pinch of black pepper",
            "Pinch of white pepper",
            "1 blob of butter with 2-3 cloves minced garlic (for buns)",
            "Caramelized onions",
            "5 lettuce leaves",
            "5 slices of tomatoes"
        ],
        "instructions": [
            "Process 1 burger bun in a food processor to make crumbs. Set aside.",
            "In a saute pan, heat the olive oil over medium-high and saute onions with a pinch of salt until soft. ",
            "Add the garlic, stir, and cook another minute. ",
            "Scrape the onion mix into a bowl. Keep aside.",
            "Add another tablespoon of olive oil to the pan, over high heat, add the mushrooms followed by salt - let the mushrooms sweat. ",
            "Reduce the heat to medium and continue to cook until the liquid evaporates and the mushrooms turn deep golden brown. ",
            "Scrape the mushroom mixture into the bowl with the onions-set aside to cool for a couple of minutes.",
            "Meanwhile heat some butter with garlic and toast the buns lightly.",
            "Now in the food processor add the sun-dried tomatoes, the lentils and half of the mushroom-onion mix, process so that it is pasty yet have a bite. Pulse it slightly, do not puree.",
            "Put the mixture into a mixing bowl and mix in the egg, a pinch of salt, black and white pepper.",
            "Divide the lentil mixture into four portions, make each into a ball and flatten into a patty. ",
            "Coat the patty with the breadcrumbs.",
            "Heat oil in a pan. Add the lentil patties and shallow fry on each side until crisp and deep golden. ",
            "Now bake the patties for 5-6 minutes at 180 degree Celsius. ",
            "We put it in the oven because the patties were shallow fried i.e the outside gets cooked but the inside is still mushy.",
            "Place a lettuce leaf, tomato slice and some caramelized onions on each of the buns.",
            "Top with the patty and close with the other half."
        ],
        "cook_time": "1 Hour",
        "cuisine": "american"
    },
    {
        "name": "Sloppy Joes",
        "ingredients": [
            "1 loaf crusty bread or 2-3 slices white bread",
            "2 Tbsp cheddar cheese",
            "For the mince:",
            "1 onion",
            "1\" knob of ginger",
            "3 cloves garlic",
            "1 green chillies",
            "1 Tbsp oil",
            "200 gm lamb mince(keema)",
            "1 tsp zeera powder",
            "1 tsp rosemary",
            "Salt, to taste",
            "1/4 th cup red wine",
            "1 cup tomato juice",
            "1 potato, boiled, mashed",
            "Coriander leaves, chopped",
            "1 tomato, chopped",
            "For the eggplants:",
            "3 baby eggplants",
            "1 tsp zeera powder",
            "1 tsp oil",
            "Salt, a pinch"
        ],
        "instructions": [
            "For the eggplants:",
            "Slice the baby eggplants. Place them on a baking tray.",
            "Drizzle some oil, zeera powder and salt.",
            "Bake for 7-10minutes at 200 degrees C.",
            "For the mince:",
            "In a blender make a fine paste of the onion, ginger, garlic and green chilli.",
            "In a pan add oil, the onion mixture. Saute till onions start to turn pink.",
            "Add the lamb mince. Cook till meat starts turning brown. Add zeera powder, rosemary & salt.",
            "Add some red wine and tomato juice. Let it reduce.",
            "Add the boiled potato, the baked eggplants, coriander and tomato.",
            "Cook for 2-3 minutes.",
            "Plating up:",
            "On a baking tray place 1/2 a loaf of bread (slit lengthwise).",
            "Drizzle some olive oil on it.",
            "Add the mince on it.",
            "Sprinkle some cheddar cheese.",
            "Bake for 10-15 minutes or till the cheese melts at 180-200 degree C."
        ],
        "cook_time": "35 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Chocolate Cake in a Pressure Cooker",
        "ingredients": [
            "1 cup flour  ",
            "1/4 cup cocoa powder  ",
            "1 1/4 tsp baking powder",
            "1/4 cup butter",
            "3/4 cup caster sugar",
            "1/4 cup water  ",
            "2 eggs  ",
            "1/2 tsp vanilla essence",
            "1/8 tsp salt  ",
            "6 inch round greased baking tin"
        ],
        "instructions": [
            "In a mixing bowl, sift the flour, cocoa powder and baking powder. ",
            "Add in the butter, sugar, salt, water and vanilla, and beat the ingredients using a whisk.     ",
            "Add the eggs and beat the batter until smooth. ",
            "Transfer into the baking tin.    ",
            "Heat the pressure cooker, covered with the lid but without the pressure, for 3-4 minutes on high heat, then place the cake tin in the empty cooker (do not add water in the cooker).     ",
            "Close the lid (without the pressure), lower the flame and let it cook until done (about 30 minutes)."
        ],
        "cook_time": "1 Hour",
        "cuisine": "american"
    },
    {
        "name": "Honey Chilli Potatoes",
        "ingredients": [
            "For the potatoes:",
            "2 potatoes, peeled and sliced",
            "3-4 Tbsp cornflour or maida",
            "Salt to taste",
            "1 tsp red chilli powder",
            "Oil, for deep frying",
            "For the base:",
            "1 tsp oil",
            "2 spring onions (with stalk), sliced",
            "1 Tbsp garlic paste",
            "1 capsicum, sliced",
            "2 Tbsp honey",
            "Salt, to taste",
            "1/4 tsp soya sauce",
            "3 tsp white sesame seeds",
            "2 tsp chilli sauce"
        ],
        "instructions": [
            "For the potatoes:",
            "In a bowl, add cornflour or maida, salt and red chilli powder.",
            "Add the sliced potatoes and mix well until the potatoes are coated.",
            "Heat oil in a wok and deep fry the potatoes until golden. Keep aside.",
            "For the Base:",
            "In a wok, add oil, garlic paste and spring onions. Saute on high heat for 1 minute.",
            "Add capsicum, honey, salt, soya sauce, chilli sauce. Saute for 2-3 minutes.",
            "Add the deep-fried potatoes and sesame seeds. Mix well and serve hot."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Vegetable Momos",
        "ingredients": [
            "For Dough:",
            "2 cups maida",
            "1/2 tsp salt ",
            "1/2 tsp baking powder   ",
            "For Filling: ",
            "1 cup carrots - grated ",
            "1 cup cabbage - grated ",
            "1 Tbsp oil ",
            "1/2 cup onion - finely chopped ",
            "1 tsp garlic - chopped  ",
            "1 tsp Soya sauce ",
            "Salt ",
            "1/4 tsp vinegar ",
            "1/4 tsp black pepper"
        ],
        "instructions": [
            "Mix the maida, salt and baking powder and knead to a stiff dough with water. ",
            "Heat oil and add the onion and garlic. ",
            "Saute over high heat and add the carrot and cabbage. Turn around over high heat till glossy. ",
            "Take it off the heat and mix in the Soya sauce, salt, vinegar and black pepper. ",
            "Roll the dough thin (translucent) and cut into 4\"-5\" rounds. ",
            "Take a round, wet edges and place some filling in the center. ",
            "Bring edges together to cover the filling. Twist to seal and fill the rest in the same way. ",
            "Steam for about 10 minutes and serve with soya sauce and chilli sauce."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Chole Bhature",
        "ingredients": [
            "For chole:",
            "2 cup chickpeas (channas)",
            "2 tsp oil",
            "1 bay leaf (tej patta)",
            "1 stick cinnamon (dalchini)",
            "3-4 cloves (laung)",
            "1 tsp whole pepper corns (sabut kali mirch)",
            "3 green cardamom  (choti elaichi)",
            "2 black cardamom (badi elaichi)",
            "1 tsp turmeric powder (haldi)",
            "1 tsp chili powder (lal mirch powder)",
            "1 tsp coriander powder (dhaniya powder)",
            "1 tsp cumin powder (zeera powder)",
            "1 tsp cumin seeds (zeera)",
            "1/2 tsp asafoetida (heeng)",
            "Salt to taste",
            "1 cup onions (chopped)",
            "1 cup tomatoes (chopped)",
            "1 tsp ginger (chopped)",
            "1 tsp garlic (chopped)",
            "1 tsp ajwain",
            "1 tsp lime juice",
            "1 green chili (chopped)                      1 tea bag                                                1 Tbsp butter",
            "For the bhaturas:",
            "2 cups maida (refined flour)",
            "1/2 tsp yeast, dissolved for 10 minutes in luke warm water",
            "1/2 cup whole wheat flour",
            "A pinch of salt",
            "Water to knead",
            "Oil for frying"
        ],
        "instructions": [
            "For chole:",
            "In a pan add oil, bay leaf, cinnamon, cumin seeds, cloves, whole pepper corns, green and black cardamom.",
            "After it gets brown add chopped onions and saute it.",
            "After sauteing add chopped ginger and garlic.",
            "Then add turmeric, chili powder, coriander powder, cumin powder, asafoetida, salt and fry well.",
            "For de glazing the pan add little water.",
            "Now add the chole (soaked overnight and pressure cooked) to the masala.",
            "After stirring well add tomatoes, little sugar and salt to the chole (chickpeas)",
            "Now add ajwain, chopped green chilies and water for the base.",
            "To get the color in the chole, add a tea bag to the masala.",
            "Simmer the chole gently for an hour and cover it.",
            "Add lime juice and a dollop of butter to it.",
            "Garnish the chole with coriander and butter.",
            "Serve the chole hot with bhaturas.",
            "For the bhaturas:",
            "Knead the whole wheat flour, maida and salt together with adequate amount of water.",
            "Sprinkle the yeast on top. Leave it for 2-3 hours for the yeast to work.",
            "Divide it into equal portions. Roll out in an oval or round shape.",
            "Deep fry till golden brown, like a puri.",
            "Serve. "
        ],
        "cook_time": "1 Hour",
        "cuisine": "american"
    },
    {
        "name": "Quick Chicken Curry",
        "ingredients": [
            "1 kg chicken",
            "3 large onions, paste",
            "2 large tomatoes, pureed",
            "1 Tbsp garlic paste",
            "1 Tbsp ginger paste",
            "2 tsp coriander powder",
            "2 tsp cumin powder",
            "1/2 tsp turmeric powder",
            "1/2 tsp red chilli powder",
            "1 tsp garam masala powder",
            "2 Tbsp oil",
            "Salt to taste",
            "Chopped coriander for garnish"
        ],
        "instructions": [
            "Heat oil in a pan and sauté the onion paste, garlic & ginger paste till golden brown.",
            "Add tomato puree. When the tomato puree dries up, add coriander powder, cumin powder, garam masala, red chilli powder, turmeric powder and salt. Let the spices cook.",
            "Add chicken pieces into the masala. Stir well and cook till they are golden brown.",
            "Add 1/2 cup of water and stir. Cover with a lid and let it simmer till the chicken is cooked.",
            "Garnish with chopped coriander and serve."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Butter Chicken",
        "ingredients": [
            "700 gm raw chicken  ",
            "For theMarinade:",
            "1 tsp red chilli powder ",
            "1 tsp ginger and garlic paste ",
            "Salt to taste ",
            "1/2 kg curd  ",
            "For theGravy:",
            "175 gm white butter ",
            "1/2 tsp black cumin seeds ",
            "1/2 kg tomato, pureed ",
            "1/2 tsp sugar ",
            "1 tsp red chilli powder ",
            "Salt to taste ",
            "100 gm fresh cream ",
            "4 green chillies, sliced",
            "1/2 tsp fenugreek leaves, crushed"
        ],
        "instructions": [
            "For marinating the chicken",
            "In a mixing bowl, mix red chilli powder, ginger garlic paste, salt and curd.  ",
            "Add the raw chicken pieces to the marinade and mix well. Keep it in the refrigerator overnight or minimum 6 hours.  ",
            "Roast the marinated chicken in a tandoor or an oven for about 10-12 minutes until it is three-fourth done.  ",
            "For the chicken gravy",
            "Heat half the quantity of white butter in pan. ",
            "Pour in the tomato puree, and saute for 2-3 minutes. Add cumin seeds, sugar, red chilli powder and salt. Mix well.  ",
            "Add the prepared chicken, white butter, fresh cream, sliced green chillies and crushed fenugreek leaves.  Saute for 3-4 minutes and let the chicken cook.",
            "Cook till chicken is done. Serve hot with rice or naan."
        ],
        "cook_time": "30 Minutes + Marination time (overnight)",
        "cuisine": "american"
    },
    {
        "name": "Quick Salted Caramel Pie",
        "ingredients": [
            "1 1/2 cups Marie biscuits, crushed",
            "5 Tbsp unsalted butter",
            "2 tsp powdered sugar",
            "3 cups cream cheese",
            "2 1/4 cups heavy cream",
            "1/2 cup brown sugar",
            "For salted caramel",
            "1 1/2 cups brown sugar",
            "110g unsalted butter",
            "1/2 cup double cream",
            "Salt, a pinch"
        ],
        "instructions": [
            "Mix the first three ingredients together and flatten into your serving dish. There, that's your super-fast crust done. Cover and keep in the fridge while you work on your filling.",
            "Now, for the salted caramel. Pour in 1/3 cup of water into a saucepan, bring to the boil and add in the sugar, stirring gently until it melts and starts bubbling. Carefully pour in the butter, and whisk until everything is fully mixed. ",
            "Add the cream in and mix thoroughly. Add the salt, and you're done! Now let the mixture cool. If you just want a caramel filling, simply leave out the salt.",
            "Mix in the cream cheese, brown sugar and cream thoroughly, until they make a thick creamy paste. ",
            "Add in your cooled caramel mixture, mixing well, pour into your crust and refrigerate overnight, at least 12-14 hours. It'll be set and ready to eat the next day."
        ],
        "cook_time": "1 hour + refrigeration",
        "cuisine": "american"
    },
    {
        "name": "Sweet Potato Pie",
        "ingredients": [
            "Yams (red skinned) 450g",
            "Condensed milk 150g",
            "Sugar 1 tbsp",
            "Small egg 1",
            "Cinnamon a pinch",
            "Marshmallows to decorate",
            "For the Pie Dough",
            "350g + extra all-purpose flour",
            "1 tsp salt",
            "275g butter",
            "5 Tbsp ice cold water",
            "1 egg, beaten"
        ],
        "instructions": [
            "Bake the yams until they have softened completely - they should \nbe extremely tender. Cool, discard the skin and then blend the flesh \ninto a paste. ",
            "Mix the paste with the remaining ingredients and whisk \nwell until everything is smooth and perfectly blended - you don't want \nany lumpy bits in your filling. ",
            "Add the filling into your crust and bake\n (about 50 minutes to 1 hour). Make sure to let it cool, then place in \nthe fridge overnight.",
            "For the Pie Dough:",
            "First, thoroughly blend your salt and flour together in the food processor.",
            "2.\n Cut the butter into evenly-sized cubes, place them evenly on top of the\n dry ingredients in your food processor, and then mix in short bursts. \nDo this until the dough becomes clumpy and wet, and no flour remains. \nThis may take a while.",
            "Now bring out the dough and place onto a\n heavily-floured surface. Add the cold water in, spoon by spoon, gently \nfolding to make sure it is all absorbed. Then divide the dough into two \nportions (one for the bottom of the pie and one for the top) and roll \nboth the pieces into discs. Wrap these discs separately in cling film \nand let them rest in the fridge for at least two hours.",
            "When \nyou are ready to bake, bring out the dough and roll it out, in one \ndirection, on a surface that has been heavily floured. Do this gently \nand do not flip it around too much like a chapati. Lay the dough on to \nyour baking pan, making sure that it goes all round the sides, letting \nit hang over the rim. Prick it all the way round with a fork. Pour your \nfilling into the dough and then unfurl the second disk in the same way \nto make a crust for the top. For a sweet pie, you can even make a \nwonderful criss-cross lattice design if you prefer.",
            "Lightly \nbrush the egg on top the pastry (this egg wash will give your pastry \nthat gorgeous golden glow), and cut four slits into the dough on the \ntop. Bake in a preheated oven until golden (approximately an hour at 400\n degrees)."
        ],
        "cook_time": "1 hour + 2 hours chilling",
        "cuisine": "american"
    },
    {
        "name": "Prawn Pie",
        "ingredients": [
            "2 Tbsp oil",
            "450g prawns",
            "1 onion, chopped",
            "2 Tbsp flour",
            "1 1/2 cups heavy cream",
            "Salt and pepper to taste",
            "For the Pie Dough",
            "350g + extra all-purpose flour",
            "1 tsp salt",
            "275g butter",
            "5 Tbsp ice cold water",
            "1 egg, beaten"
        ],
        "instructions": [
            "Heat the oil in a saucepan at medium heat. Add in the onion and cook \nuntil it turns golden. Add the cream and raise to high heat, until the \nsauce thickens a little. Keep stirring gently. Add in the prawns and \nseasoning. Then pour the prawn mixture into the pie dough and bake.For the Pie Dough:",
            "First, thoroughly blend your salt and flour together in the food processor.",
            "Cut the butter into evenly-sized cubes, place them evenly on top of the dry ingredients in your food processor, and then mix in short bursts. Do this until the dough becomes clumpy and wet, and no flour remains. This may take a while.",
            "Now bring out the dough and place onto a heavily-floured surface. Add the cold water in, spoon by spoon, gently folding to make sure it is all absorbed. Then divide the dough into two portions (one for the bottom of the pie and one for the top) and roll both the pieces into discs. Wrap these discs separately in cling film and let them rest in the fridge for at least two hours.",
            "When you are ready to bake, bring out the dough and roll it out, in one direction, on a surface that has been heavily floured. Do this gently and do not flip it around too much like a chapati. Lay the dough on to your baking pan, making sure that it goes all round the sides, letting it hang over the rim. Prick it all the way round with a fork. Pour your filling into the dough and then unfurl the second disk in the same way to make a crust for the top. For a sweet pie, you can even make a wonderful criss-cross lattice design if you prefer.",
            "Lightly brush the egg on top the pastry (this egg wash will give your pastry that gorgeous golden glow), and cut four slits into the dough on the top. Bake in a preheated oven until golden (approximately an hour at 400 degrees)."
        ],
        "cook_time": "1 hour + 2 hours chilling",
        "cuisine": "american"
    },
    {
        "name": "Egg and Cheddar Cheese Sandwich",
        "ingredients": [
            "1 egg",
            "Salt to taste",
            "Pinch of pepper",
            "20 gm of cheddar cheese",
            "2 slices of ham",
            "1 Tbsp of mustard sauce",
            "3 basil leaves"
        ],
        "instructions": [
            "Grab a cupcake tray and grease it.",
            "Break the egg into the mould and dust it with salt and pepper.",
            "Pre-heat the oven for 15 minutes and then put the tray in.",
            "Let it bake for about 5-6 minutes. You'll be able to see when the egg is done.",
            "Pull it out and chop it into medium-sized pieces.",
            "Add some ham and cheese to the mix and heat it in the microwave for a few minutes so that the cheese melts.",
            "Put it on toast and dress it up with basil and mustard."
        ],
        "cook_time": "20 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Beer Chicken Tartar",
        "ingredients": [
            "2 pieces of chicken supreme",
            "4 Tbsp buttermilk           ",
            "1 tsp salt               ",
            "Tartar Sauce:",
            "4 Tbsp mayonnaise             ",
            "1 tsp gherkins               ",
            "1 tsp green olives       ",
            "1 tsp shallots ",
            "1/2 tsp parsley, to garnish",
            "Batter:",
            "3 Tbsp corn flour                ",
            "1 Tbsp refined flour              1/2 tsp salt                    ",
            "1/2 tsp Baking Powder            ",
            "5 Tbsp Beer    "
        ],
        "instructions": [
            "Clean the chicken thoroughly and then dip into home-made buttermilk and salt for at least an hour.",
            "3. Keep it in the refrigerator at least for one hour at 4 degree Celsius. ",
            "In the mean time, prepare the tartar sauce. Mix all the ingredients: mayonnaise, gherkin, green olives, shallot, salt and pepper. ",
            "5. Now, mix all the ingredients for the batter. Be sure it isn't too runny or it won't stick to the chicken properly. ",
            "5. Pull out marinated chicken supreme from refrigerator, dip it into the batter dunk it into a hot fryer.",
            "Fry it till it turns golden in color & then take it out from fryer. ",
            "7. Put it on paper towel to remove extra fat.",
            "Serve it hot with tartar sauce.",
            "Tips: You can use water in place of beer.",
            ""
        ],
        "cook_time": "Prep time: 1 Hour, Cook time: 5-7 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Old Monk Sticky Chicken Wings",
        "ingredients": [
            "8 chicken wings without skin",
            "150 Hung curd",
            "1/2 tsp chilli powder ",
            "1/2 tsp sweet paprika powder",
            "1 tsp English mustard paste",
            "1 tsp garlic paste",
            "Salt - to taste",
            "Olive oil- for marination",
            "Chopped garlic - 1 tsp",
            "Old monk rum - 10ml",
            "Bbq sauce - 4 Tbsp."
        ],
        "instructions": [
            "Mix together all the ingredients and marinate chicken wings in it for 2 hours or more.",
            "Now roast chicken wings in an oven.  ",
            "Take a pan, pour some oil and add some chopped garlic.",
            "When garlic gets brown, add 4 Tbsp. of barbeque sauce and cook for sometime.",
            "Now, add roasted chicken wings.",
            "Flambe with rum.",
            "Serve."
        ],
        "cook_time": "35 Minutes + Marination Time",
        "cuisine": "american"
    },
    {
        "name": "Classic American Pancakes",
        "ingredients": [
            "1 cup all-purpose flour",
            "2 1/2 tsp baking powder ",
            "1/2 tsp salt ",
            "3/4 Tbsp white sugar ",
            "3/4 cups milk ",
            "1 small egg ",
            "2 Tbsp butter, melted ",
            "Toppings",
            "Melted butter",
            "Maple syrup or honey",
            "Mixed berries (or any other mixed fruit of your choice)",
            "Powdered sugar"
        ],
        "instructions": [
            "In a large bowl, bring  together all the dry ingredients. Make a well in the center and pour in the milk, egg and melted butter. Mix until smooth batter is formed.",
            "Heat a lightly oiled frying pan over medium high heat. Pour the batter onto the pan, using approximately 1/4 cup for each pancake.",
            "Brown on both sides and stack 2-3 pieces on a plate. ",
            "Sprinkle with some dusted sugar and top with some whole mixed berries. Serve melted butter and maple syrup on the side."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "american"
    },
    {
        "name": "All American Carrot Cake",
        "ingredients": [
            "140 gm brown sugar    140 ml oil refined",
            "500 gm quark cheese",
            "250 gm icing sugar",
            "60 gm white butter    250 gm carrot",
            "150 gm walnut",
            "170 gm pineapple",
            "3 eggs",
            "11 gm cinnamon powder",
            "12 gm nutmeg",
            "10 gm baking powder",
            "10 gm baking soda",
            "Salt to taste",
            "230 gm mascarpone cheese"
        ],
        "instructions": [
            "Mix together the finely grated carrot, refined oil, castor sugar and brown sugar.",
            "In another mixing bowl, mix flour, baking powder, nutmeg powder, cinnamon powder, vanilla essence and eggs.",
            "In a different bowl, mix chopped walnuts and chopped pineapple. Keep aside.",
            "Mix all of the above and dunk it in a baking dish. Let it bake for 45 min at 180C.",
            "After baking, leave it in the oven for 15-20 minutes to rest.",
            "Take out the cake and put it in the freezer to chill.",
            "In another bowl, mix the quark cheese, mascarpone cheese, white butter and icing sugar and keep aside.",
            "Cut the carrot cake in the centre horizontally and fill it with quark cheese and icing sugar."
        ],
        "cook_time": "1 hour, 30  minutes",
        "cuisine": "american"
    },
    {
        "name": "Grilled Herb Chicken Breast with Honey and Asparagus",
        "ingredients": [
            "Chicken",
            "1/2 pound chicken breast, skinless    5 ml honey  5 ml lemon",
            "A pinch of thyme",
            "Salt to taste",
            "A pinch of black pepperSauce",
            "10 ml red wine",
            "30 ml brown sauce",
            "A pinch of rosemary",
            "4 potatoes, boiled and thinly sliced"
        ],
        "instructions": [
            "In a large bowl, whisk together honey, lemon juice, thyme, black pepper and salt.",
            "Preheat the grill to medium heat.",
            "Place the chicken breast in a bowl with the sauce and let it marinate for 15 minutes. Turn it occasionally.",
            "Take a pan and fill it with water up to 1 inch. Bring the water to a boil and blanch the asparagus and potatoes for 1-2 minutes. Shock the asparagus in iced water and drain it well.",
            "Grill the chicken over medium heat for 6 -7 minutes per side or until cooked through.",
            "Grill the asparagus for 4 minutes or until tender-crisp, turning occasionally.",
            "Brush chicken and asparagus with the leftover marinade.",
            "Serve chicken with asparagus and potatoes."
        ],
        "cook_time": "1 Hour",
        "cuisine": "american"
    },
    {
        "name": "Mint Julep",
        "ingredients": [
            "60 ml Jim Beam ",
            "6-8 mint leaves ",
            "3 lemon wedges ",
            "100 gm crushed ice ",
            "Sugar to taste "
        ],
        "instructions": [
            "Put all ingredients in a glass.",
            "Mix well with ice.",
            "Garnish with mint leaves before serving."
        ],
        "cook_time": "10 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Pancake",
        "ingredients": [
            "1/2 cup maida ",
            "1 egg ",
            "1/4 cup milk ",
            "Water as required ",
            "1/4 tsp salt ",
            "1 tsp oil ",
            "2 Tbsp oil for cooking the pancakes "
        ],
        "instructions": [
            "Mix flour, salt, egg, oil and enough milk to form a smooth paste. ",
            "Add the rest of the milk and some water to make a batter that falls smoothly off the spoon in a thick stream. ",
            "Let it rest for 15 minutes. ",
            "Put a heavy based frying pan over high heat and add one Tbsp of oil. ",
            "Once the oil is hot lower the heat, turn the oil around in the pan, and drain\n off the excess oil leaving the pan only brushed with oil. ",
            "Turn up the heat again, and pour enough batter for 1 pancake in the pan and spread it out. ",
            "Lower the heat, cook on one side till light brown, then turn over and brown the other side. ",
            "And serve."
        ],
        "cook_time": "20 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Apple Sausage Plait",
        "ingredients": [
            "200 gms flour ",
            "100 gms diced chilled butter ",
            "2 egg yolks ",
            "2-3 Tbsp chilled water ",
            "For the filling:1 Tbsp butter ",
            "2 diced onions ",
            "1 large apple - peeled, cored and diced, grated rind ",
            "1 lime ",
            "1 Tbsp quick cooking oats ",
            "1 tsp dried basil ",
            "1 Tbsp fresh herbs ",
            "2 Tbsp chopped gherkins ",
            "400 gm sausage meat ",
            "1 egg beaten ",
            "1 tsp of milk to glaze"
        ],
        "instructions": [
            "Rub butter with flour until mixture resembles breadcrumbs.",
            "Bind with yolks and water.",
            "Knead lightly until soft dough is formed. Allow it to chill.",
            "Melt butter in a saucepan and add onions.",
            "When they soften, add apples and rind and cook for 5 minutes.",
            "Cool and add remaining ingredients. ",
            "Roll pastry into a rectangle and brush with beaten egg.",
            "Slice the edges diagonally.",
            "Arrange the mixture in center. Seal the pastry. ",
            "Cool, glaze and bake at 190 degrees C for about 30 minutes."
        ],
        "cook_time": "1 Hour",
        "cuisine": "american"
    },
    {
        "name": "Chicken and Fish 65 Burgers",
        "ingredients": [
            "2 Tbsp ginger-garlic paste",
            "3 tsp red chili powder",
            "1 1/2 tsp turmeric powder",
            "2 tsp coriander powder",
            "Handful curry leaves",
            "5 Tbsp refined oil",
            "Salt to taste",
            "100 gm chicken breast",
            "200 gm fish fillet",
            "200 gm rice flour to coat",
            "2 Tbsp mayonnaise",
            "3 tsp tomato ketchup",
            "1/2 tsp Tabasco ",
            "3 burger buns",
            "1 onion",
            "3 tomatoes"
        ],
        "instructions": [
            "In a bowl add the ginger-garlic paste, chili powder, turmeric powder, a tsp of coriander powder & some chopped curry leaves. ",
            "Season it with some salt and drizzle a Tbsp of refined oil to bring it all together.",
            "Trim the chicken breast and cut the fish fillet.",
            "Add marinate on each piece, making sure that the pieces are nicely coated with the masala. ",
            "In a non-stick pan, add refined oil and let it heat up. ",
            "Roll the chicken and fish pieces in rice flour till they are fully coated & shallow fry the coated chicken and fish  in the non-stick pan.",
            "Take the burger buns and slit open from the center.",
            "Spread the burger sauce over half of the burger bun halves.",
            "Add the chicken breast on one half and fish pieces on the other.",
            "Then add tomatoes and onion slices and lettuce on each of them.",
            "Sprinkle some pepper to taste and cover both chicken and fish  with the other half bun halves.",
            "For the burger sauce:",
            "In a bowl, add mayonnaise, tomato ketchup and some Tabasco sauce for a tangy taste.",
            "Then add coriander powder and chili powder.   3. Whisk it all together.",
            "Serve the burgers with a light apple salad. "
        ],
        "cook_time": "30 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Chilli Burgers with Pepper Relish",
        "ingredients": [
            "50 gm butter ",
            "2 large diced onions ",
            "3 chopped red chillies ",
            "2 tsp cumin roasted, ground ",
            "400 gm lamb, minced ",
            "1 Tbsp mustard ",
            "1 Tbsp Worcestershire sauce ",
            "300 gm kidney beans, pureed, cooked ",
            "75 gm fresh bread crumbs ",
            "4 Tbsp  parsley, chopped",
            "1 large egg, beaten ",
            "Oil for shallow frying ",
            "6 buns",
            "1 onion, sliced ",
            "2 large tomatoes, sliced",
            "1  lettuce, shredded",
            "Flour to coat ",
            "For roasted pepper relish:",
            "1/2 kg red bell peppers, quartered and seeded ",
            "1 tsp roasted cumin ",
            "2 Tbsp chilli sauce, mild and sweet ",
            "50 ml salad/olive oil"
        ],
        "instructions": [
            "For the relish: ",
            "Grill peppers until skin blackens. Remove skin. ",
            "Blend the peppers with cumin and sauce until smooth. ",
            "Gradually add oil. ",
            "Cover and chill before using.",
            "For the chilli burger:",
            "Heat butter, add onion, chillies and cumin. ",
            "Cook until onion softens. ",
            "Combine with meat, mustard, sauce, bean paste, breadcrumbs, parsley and egg. Mix well. Shape into 6 large patties. ",
            "Chill well and coat with flour. Shallow fry in hot oil until colored and cooked. ",
            "Halve and toast bread rolls. Spread with relish, top with burgers, lettuce, onion rings and tomato slices. "
        ],
        "cook_time": "30 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Old Fashioned Apple Pie",
        "ingredients": [
            "For the pastry:",
            "600 gm all purpose flour",
            "1 tsp salt",
            "2 Tbsp sugar",
            "250 gm frozen butter",
            "1 1/2 cups ice water",
            "For the filling:",
            "2 Tbsp all-purpose flour, plus more for dusting",
            "12 Granny Smith apples, peeled, cored, and sliced",
            "3/4 cup sugar, plus additional for pie top",
            "Zest and juice of 1 lemon",
            "1 1/2 tsp cinnamon",
            "1/2 tsp nutmeg",
            "Pinch ground cloves",
            "2 Tbsp unsalted butter",
            "1 large egg, beaten"
        ],
        "instructions": [
            "Heat oven to 375 degrees. On a lightly floured surface, roll out pate brisee into two 1/8-inch-thick circles to a diameter slightly larger than that of an 11-inch plate. Press one pastry circle into the pie plate. Place the other circle on waxed paper, and cover with plastic wrap. Chill all pastry until firm, about 30 minutes.",
            "In a large bowl, combine apples, sugar, lemon zest and juice, spices, and flour. Toss well. Spoon apples into pie pan. Dot with butter, and cover with remaining pastry circle. Cut several steam vents across top. Seal by crimping edges as desired. Brush with beaten egg, and sprinkle with additional sugar.",
            "Bake until crust is brown and juices are bubbling, about 1 hour. Let cool on wire rack before servingPrem Kumar Pogakula is a Sous Chef at The Imperial, New Delhi."
        ],
        "cook_time": "1 Hour 45 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Cola BBQ Sauce",
        "ingredients": [
            "1 onion, diced",
            "1 tomato, diced",
            "1 green chilli",
            "1 tsp chilli flakes",
            "2 Tbsp tomato ketchup",
            "1 jalapeno",
            "1/2 tsp tobasco",
            "1 tsp soy sauce",
            "1/2 cup white wine vinegar",
            "1/2 cup sugar",
            "1/2 cup cola (You can use any black soft drink)"
        ],
        "instructions": [
            "In a food processor / mixie add onion, tomato, green chilli, chilli flakes, tomato ketchup, jalapeno chilli, Tabasco, soy sauce. Give it a mix. Keep aside.",
            "In a saucepan add white wine vinegar and sugar. Let it reduce by half. Then add the tomato-onion mix. Let it simmer.",
            "Add cola and let it cook for 10 minutes.",
            "BBQ cola sauce is ready!",
            "Apply it on sausages or prawns, char grill them. Serve!"
        ],
        "cook_time": "30 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Lentil-Mushroom Burgers",
        "ingredients": [
            "5 whole-wheat hamburger buns",
            "2-3 Tbsp olive oil",
            "1 medium onion, diced small",
            "3 cloves of garlic, minced",
            "1 package cremini or button mushrooms, minced",
            "4 sun-dried tomatoes, chopped fine",
            "1 cup cooked brown lentils ",
            "1/2 an egg",
            "Salt",
            "Pinch of black pepper",
            "Pinch of white pepper",
            "1 blob of butter with 2-3 cloves minced garlic (for buns)",
            "Caramelized onions",
            "5 lettuce leaves",
            "5 slices of tomatoes"
        ],
        "instructions": [
            "Process 1 burger bun in a food processor to make crumbs. Set aside.",
            "In a saute pan, heat the olive oil over medium-high and saute onions with a pinch of salt until soft. ",
            "Add the garlic, stir, and cook another minute. ",
            "Scrape the onion mix into a bowl. Keep aside.",
            "Add another tablespoon of olive oil to the pan, over high heat, add the mushrooms followed by salt - let the mushrooms sweat. ",
            "Reduce the heat to medium and continue to cook until the liquid evaporates and the mushrooms turn deep golden brown. ",
            "Scrape the mushroom mixture into the bowl with the onions-set aside to cool for a couple of minutes.",
            "Meanwhile heat some butter with garlic and toast the buns lightly.",
            "Now in the food processor add the sun-dried tomatoes, the lentils and half of the mushroom-onion mix, process so that it is pasty yet have a bite. Pulse it slightly, do not puree.",
            "Put the mixture into a mixing bowl and mix in the egg, a pinch of salt, black and white pepper.",
            "Divide the lentil mixture into four portions, make each into a ball and flatten into a patty. ",
            "Coat the patty with the breadcrumbs.",
            "Heat oil in a pan. Add the lentil patties and shallow fry on each side until crisp and deep golden. ",
            "Now bake the patties for 5-6 minutes at 180 degree Celsius. ",
            "We put it in the oven because the patties were shallow fried i.e the outside gets cooked but the inside is still mushy.",
            "Place a lettuce leaf, tomato slice and some caramelized onions on each of the buns.",
            "Top with the patty and close with the other half."
        ],
        "cook_time": "1 Hour",
        "cuisine": "american"
    },
    {
        "name": "Sloppy Joes",
        "ingredients": [
            "1 loaf crusty bread or 2-3 slices white bread",
            "2 Tbsp cheddar cheese",
            "For the mince:",
            "1 onion",
            "1\" knob of ginger",
            "3 cloves garlic",
            "1 green chillies",
            "1 Tbsp oil",
            "200 gm lamb mince(keema)",
            "1 tsp zeera powder",
            "1 tsp rosemary",
            "Salt, to taste",
            "1/4 th cup red wine",
            "1 cup tomato juice",
            "1 potato, boiled, mashed",
            "Coriander leaves, chopped",
            "1 tomato, chopped",
            "For the eggplants:",
            "3 baby eggplants",
            "1 tsp zeera powder",
            "1 tsp oil",
            "Salt, a pinch"
        ],
        "instructions": [
            "For the eggplants:",
            "Slice the baby eggplants. Place them on a baking tray.",
            "Drizzle some oil, zeera powder and salt.",
            "Bake for 7-10minutes at 200 degrees C.",
            "For the mince:",
            "In a blender make a fine paste of the onion, ginger, garlic and green chilli.",
            "In a pan add oil, the onion mixture. Saute till onions start to turn pink.",
            "Add the lamb mince. Cook till meat starts turning brown. Add zeera powder, rosemary & salt.",
            "Add some red wine and tomato juice. Let it reduce.",
            "Add the boiled potato, the baked eggplants, coriander and tomato.",
            "Cook for 2-3 minutes.",
            "Plating up:",
            "On a baking tray place 1/2 a loaf of bread (slit lengthwise).",
            "Drizzle some olive oil on it.",
            "Add the mince on it.",
            "Sprinkle some cheddar cheese.",
            "Bake for 10-15 minutes or till the cheese melts at 180-200 degree C."
        ],
        "cook_time": "35 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Chocolate Cake in a Pressure Cooker",
        "ingredients": [
            "1 cup flour  ",
            "1/4 cup cocoa powder  ",
            "1 1/4 tsp baking powder",
            "1/4 cup butter",
            "3/4 cup caster sugar",
            "1/4 cup water  ",
            "2 eggs  ",
            "1/2 tsp vanilla essence",
            "1/8 tsp salt  ",
            "6 inch round greased baking tin"
        ],
        "instructions": [
            "In a mixing bowl, sift the flour, cocoa powder and baking powder. ",
            "Add in the butter, sugar, salt, water and vanilla, and beat the ingredients using a whisk.     ",
            "Add the eggs and beat the batter until smooth. ",
            "Transfer into the baking tin.    ",
            "Heat the pressure cooker, covered with the lid but without the pressure, for 3-4 minutes on high heat, then place the cake tin in the empty cooker (do not add water in the cooker).     ",
            "Close the lid (without the pressure), lower the flame and let it cook until done (about 30 minutes)."
        ],
        "cook_time": "1 Hour",
        "cuisine": "american"
    },
    {
        "name": "Honey Chilli Potatoes",
        "ingredients": [
            "For the potatoes:",
            "2 potatoes, peeled and sliced",
            "3-4 Tbsp cornflour or maida",
            "Salt to taste",
            "1 tsp red chilli powder",
            "Oil, for deep frying",
            "For the base:",
            "1 tsp oil",
            "2 spring onions (with stalk), sliced",
            "1 Tbsp garlic paste",
            "1 capsicum, sliced",
            "2 Tbsp honey",
            "Salt, to taste",
            "1/4 tsp soya sauce",
            "3 tsp white sesame seeds",
            "2 tsp chilli sauce"
        ],
        "instructions": [
            "For the potatoes:",
            "In a bowl, add cornflour or maida, salt and red chilli powder.",
            "Add the sliced potatoes and mix well until the potatoes are coated.",
            "Heat oil in a wok and deep fry the potatoes until golden. Keep aside.",
            "For the Base:",
            "In a wok, add oil, garlic paste and spring onions. Saute on high heat for 1 minute.",
            "Add capsicum, honey, salt, soya sauce, chilli sauce. Saute for 2-3 minutes.",
            "Add the deep-fried potatoes and sesame seeds. Mix well and serve hot."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Vegetable Momos",
        "ingredients": [
            "For Dough:",
            "2 cups maida",
            "1/2 tsp salt ",
            "1/2 tsp baking powder   ",
            "For Filling: ",
            "1 cup carrots - grated ",
            "1 cup cabbage - grated ",
            "1 Tbsp oil ",
            "1/2 cup onion - finely chopped ",
            "1 tsp garlic - chopped  ",
            "1 tsp Soya sauce ",
            "Salt ",
            "1/4 tsp vinegar ",
            "1/4 tsp black pepper"
        ],
        "instructions": [
            "Mix the maida, salt and baking powder and knead to a stiff dough with water. ",
            "Heat oil and add the onion and garlic. ",
            "Saute over high heat and add the carrot and cabbage. Turn around over high heat till glossy. ",
            "Take it off the heat and mix in the Soya sauce, salt, vinegar and black pepper. ",
            "Roll the dough thin (translucent) and cut into 4\"-5\" rounds. ",
            "Take a round, wet edges and place some filling in the center. ",
            "Bring edges together to cover the filling. Twist to seal and fill the rest in the same way. ",
            "Steam for about 10 minutes and serve with soya sauce and chilli sauce."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Chole Bhature",
        "ingredients": [
            "For chole:",
            "2 cup chickpeas (channas)",
            "2 tsp oil",
            "1 bay leaf (tej patta)",
            "1 stick cinnamon (dalchini)",
            "3-4 cloves (laung)",
            "1 tsp whole pepper corns (sabut kali mirch)",
            "3 green cardamom  (choti elaichi)",
            "2 black cardamom (badi elaichi)",
            "1 tsp turmeric powder (haldi)",
            "1 tsp chili powder (lal mirch powder)",
            "1 tsp coriander powder (dhaniya powder)",
            "1 tsp cumin powder (zeera powder)",
            "1 tsp cumin seeds (zeera)",
            "1/2 tsp asafoetida (heeng)",
            "Salt to taste",
            "1 cup onions (chopped)",
            "1 cup tomatoes (chopped)",
            "1 tsp ginger (chopped)",
            "1 tsp garlic (chopped)",
            "1 tsp ajwain",
            "1 tsp lime juice",
            "1 green chili (chopped)                      1 tea bag                                                1 Tbsp butter",
            "For the bhaturas:",
            "2 cups maida (refined flour)",
            "1/2 tsp yeast, dissolved for 10 minutes in luke warm water",
            "1/2 cup whole wheat flour",
            "A pinch of salt",
            "Water to knead",
            "Oil for frying"
        ],
        "instructions": [
            "For chole:",
            "In a pan add oil, bay leaf, cinnamon, cumin seeds, cloves, whole pepper corns, green and black cardamom.",
            "After it gets brown add chopped onions and saute it.",
            "After sauteing add chopped ginger and garlic.",
            "Then add turmeric, chili powder, coriander powder, cumin powder, asafoetida, salt and fry well.",
            "For de glazing the pan add little water.",
            "Now add the chole (soaked overnight and pressure cooked) to the masala.",
            "After stirring well add tomatoes, little sugar and salt to the chole (chickpeas)",
            "Now add ajwain, chopped green chilies and water for the base.",
            "To get the color in the chole, add a tea bag to the masala.",
            "Simmer the chole gently for an hour and cover it.",
            "Add lime juice and a dollop of butter to it.",
            "Garnish the chole with coriander and butter.",
            "Serve the chole hot with bhaturas.",
            "For the bhaturas:",
            "Knead the whole wheat flour, maida and salt together with adequate amount of water.",
            "Sprinkle the yeast on top. Leave it for 2-3 hours for the yeast to work.",
            "Divide it into equal portions. Roll out in an oval or round shape.",
            "Deep fry till golden brown, like a puri.",
            "Serve. "
        ],
        "cook_time": "1 Hour",
        "cuisine": "american"
    },
    {
        "name": "Quick Chicken Curry",
        "ingredients": [
            "1 kg chicken",
            "3 large onions, paste",
            "2 large tomatoes, pureed",
            "1 Tbsp garlic paste",
            "1 Tbsp ginger paste",
            "2 tsp coriander powder",
            "2 tsp cumin powder",
            "1/2 tsp turmeric powder",
            "1/2 tsp red chilli powder",
            "1 tsp garam masala powder",
            "2 Tbsp oil",
            "Salt to taste",
            "Chopped coriander for garnish"
        ],
        "instructions": [
            "Heat oil in a pan and sauté the onion paste, garlic & ginger paste till golden brown.",
            "Add tomato puree. When the tomato puree dries up, add coriander powder, cumin powder, garam masala, red chilli powder, turmeric powder and salt. Let the spices cook.",
            "Add chicken pieces into the masala. Stir well and cook till they are golden brown.",
            "Add 1/2 cup of water and stir. Cover with a lid and let it simmer till the chicken is cooked.",
            "Garnish with chopped coriander and serve."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Butter Chicken",
        "ingredients": [
            "700 gm raw chicken  ",
            "For theMarinade:",
            "1 tsp red chilli powder ",
            "1 tsp ginger and garlic paste ",
            "Salt to taste ",
            "1/2 kg curd  ",
            "For theGravy:",
            "175 gm white butter ",
            "1/2 tsp black cumin seeds ",
            "1/2 kg tomato, pureed ",
            "1/2 tsp sugar ",
            "1 tsp red chilli powder ",
            "Salt to taste ",
            "100 gm fresh cream ",
            "4 green chillies, sliced",
            "1/2 tsp fenugreek leaves, crushed"
        ],
        "instructions": [
            "For marinating the chicken",
            "In a mixing bowl, mix red chilli powder, ginger garlic paste, salt and curd.  ",
            "Add the raw chicken pieces to the marinade and mix well. Keep it in the refrigerator overnight or minimum 6 hours.  ",
            "Roast the marinated chicken in a tandoor or an oven for about 10-12 minutes until it is three-fourth done.  ",
            "For the chicken gravy",
            "Heat half the quantity of white butter in pan. ",
            "Pour in the tomato puree, and saute for 2-3 minutes. Add cumin seeds, sugar, red chilli powder and salt. Mix well.  ",
            "Add the prepared chicken, white butter, fresh cream, sliced green chillies and crushed fenugreek leaves.  Saute for 3-4 minutes and let the chicken cook.",
            "Cook till chicken is done. Serve hot with rice or naan."
        ],
        "cook_time": "30 Minutes + Marination time (overnight)",
        "cuisine": "american"
    },
    {
        "name": "VGV Spice Burger",
        "ingredients": [
            "80-100 grams of kala channa",
            "3 new potatoes cooked",
            "1 1/2 Tbsp of spring onions, chopped",
            "1 1/2 tsp of celery, chopped",
            "1 green chili, chopped",
            "2 unpeeled, cooked new potatoes",
            "3-4 green olives",
            "1 Tbsp of sun dried tomatoes, chopped",
            "1 Tbsp of breadcrumbs",
            "1/2 tsp of cumin powder",
            "Salt and pepper to taste",
            "1 Tbsp of semolina or rava",
            "3-4 Tbsp of olive oil, to fry",
            "For the Potato Wedges:",
            "2 potatoes cut into wedges",
            "1/2 tsp of smoked paprika",
            "2-3 cloves of bashed garlic",
            "A few sprigs of thyme",
            "1 tbsp of olive oil",
            "Black pepper to taste",
            "To Plate:",
            "2-3 leaves of iceberg",
            "13-14 pomegranate beads",
            "Black pepper to taste",
            ""
        ],
        "instructions": [
            "Wash and soak beans overnight. Rinse and change the water.",
            "Pressure cook for 8-9 minutes. Alternatively, cook for 20 minutes in simmering salted water till the beans are soft but not mushy.",
            "For the Potato Wedges",
            "While the patty is frying, slice 2 potatoes in to wedges. ",
            "Put in salted water for a few minutes.",
            "Put in a baking tray and add salt and pepper to season. ",
            "Add 1/2 tsp of smoked paprika along with 2-3 cloves of bashed garlic, a few sprigs of thyme. ",
            "Drizzle with olive oil and give it a nice toss.",
            "Bake in the oven at 180 C for 12-15 minutes.For the Burger Patty:",
            "In a mixer add the black chana, chopped spring onions, celery, green chilies, smashed unpeeled, new potatoes, sun dried tomatoes, bread crumbs, jeera powder and salt and pepper.",
            "Make this in to a semi stiff burger patty mix/dough.",
            "Once this is done, top the mixture on a layer of semolina. Shape the burger in a desired shape and size and dust then with more semolina. Pan fry in olive oil till the patty has a golden brown crust.",
            "To Plate:",
            "Assemble the burger by putting the patty in a bun with a few leaves of iceberg lettuce, 1/2 a tomato without the flesh, pomegranate seeds, olive oil and salt and pepper.",
            "Serve with a side of potato wedges."
        ],
        "cook_time": "45 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Ham Rolls",
        "ingredients": [
            "8 slices ham, thinly sliced ",
            "4 Tbsp (60 gm) cream cheese ",
            "1/2 cup (100 gm) onion, finely chopped",
            "1 Tbsp (15 gm) pickled gherkins , finely chopped ",
            "4 lettuce leaves, crisped 4",
            "1 tsp salt or to taste",
            "1/8 tsp black pepper (kali mirch), freshly powdered ",
            "2 Tbsp (30 gm) mayonnaise sauce ",
            "Some greens for garnish (celery, spring onions, parsley, etc.)",
            "  "
        ],
        "instructions": [
            "Mix the cream cheese, onions, gherkins, mayonnaise, salt and pepper. ",
            "Divide the mixture into 8 and place a portion each in the center of each slice of ham. ",
            "Roll like a tube, as tightly as possible, without breaking the ham. ",
            "Line a serving dish with the lettuce leaves, and arrange the ham rolls over it, keeping the edges down. Garnish with the greens and serve. ",
            "If making ahead of time keep covered in the refrigerator, to avoid the ham drying up. ",
            "For vegetarians, substitute blanched and cooled cabbage leaves for ham. ",
            ""
        ],
        "cook_time": "25 Minutes ",
        "cuisine": "american"
    },
    {
        "name": "Macaroni Cheese",
        "ingredients": [
            "250 gm macaroni pasta",
            "40 gm butter",
            "40 gm plain flour or maida",
            "600 ml milk",
            "250 gm grated cheddar",
            "50 gm grated parmesan cheese"
        ],
        "instructions": [
            "Cook the macaroni in a large saucepan of boiling salted water for 8-10 minutes; drain well and set aside.",
            "Melt the butter over a medium heat in a saucepan slightly larger than that used for the macaroni. Add the flour and stir to form a roux, cooking for a few minutes.",
            "Gradually whisk in the milk, a little at a time. Cook for 10-15 minutes to a thickened and smooth sauce.",
            "Meanwhile, preheat the grill to hot.",
            "Remove the sauce from the hob, add 175 gm of the cheese and stir until the cheese is well combined and melted.",
            "Add the macaroni to the sauce and mix well. Transfer to a deep suitably-sized ovenproof dish.",
            "Sprinkle over the remaining cheddar and the Parmesan and place the dish under the hot grill. ",
            "Cook until the cheese is browned and bubbling. Serve straightaway."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Veggie Hot Dog",
        "ingredients": [
            "1 cup green gram dal",
            "1 cup chopped onions ",
            "1 tsp chopped garlic",
            "1/2 cup chopped carrots ",
            "1 tsp cumin powder ",
            "1 tsp coriander powder ",
            "1/2 tsp chilli powder -",
            "1/2 tsp garam masala ",
            "1/4 tsp turmeric powder - ",
            "1/4 tsp bread crumbs",
            "1/4 cup grated cheese ",
            "2 Tbsp tomato ketchup ",
            "2 Tbsp oil ",
            "Salt to taste"
        ],
        "instructions": [
            "Soak the dal for 8 to 10 hours and pressure cook for 3 whistles.",
            "Heat the pan with 1 tsp of oil and saute onion, garlic and carrot. \n",
            "Add all dry spices and required salt. Let onion and carrot cook well with the dry spices.",
            "Mash the cooked dal with a potato masher or ladle and add required salt (drain the water completely from the cooked dal before mashing).",
            "Add the sauteed onion, carrots in the dal and mix well.",
            "Make small portions of the dough into hot dog shaped patties and roll it in bread crumbs.",
            "Heat the tawa and shallow fry the patties by adding oil.",
            "Place the patties in the hot dog buns and sprinkle cheese generously."
        ],
        "cook_time": "1 Hour",
        "cuisine": "american"
    },
    {
        "name": "Prawn and Chicken Jambalaya",
        "ingredients": [
            "250 gm large raw prawns",
            "200 gm boneless chicken, chopped into 2cm pieces",
            "1 onion, sliced",
            "1 green pepper, chopped",
            "4 garlic cloves, chopped",
            "1 piece root ginger, peeled and chopped",
            "1 chicken stock cube",
            "2 tomatoes, finely chopped",
            "150 gm Basmati rice, washed",
            "2-3 Tbsp vegetable oil",
            "2 bay leaves"
        ],
        "instructions": [
            "Bring a small pan of water to the boil and tip in the raw prawns. ",
            "Simmer for 3 minutes. Remove them with a slotted spoon and set aside.",
            "Then prepare the chicken stock by adding the stock cube to 400ml of hot water along with the chicken and stirring until the cube has dissolved.",
            "Remove the chicken pieces from the stock.",
            "In a frying pan or wok, heat the oil and tip in the onion. Fry for 5-7 minutes until the onion softens.",
            "Then add the green pepper. Stir-fry the onion and pepper until they start to develop browned edges.",
            "Add the garlic and ginger followed by the celery pieces and fry for 3 minutes. Tip in the washed rice - making sure that the rice gets thoroughly coated with the remaining ingredients in the pan. ",
            "When the rice is well stirred - add the stock liquid and turn up the flame until the pot reaches the boil. ",
            "Throw in the chopped tomato and bay leaves. Then put the lid on the pot - and cook on a low heat for 10-15 minutes until the rice is done.",
            "After 20 minutes, add the cooked chicken and prawns. Carefully stir them around in the rice mixture.",
            "Then put the lid back on - and let the rice rest for 5 minutes.",
            "Sprinkle the parsley and spring onion on top of the mixture in the pot - and stir gently.  "
        ],
        "cook_time": "45 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Apple Pie",
        "ingredients": [
            "125 gms flour",
            "100 gms butter(cold)",
            "2 Tbsp water",
            "1 egg",
            "1 apple (peeled and thinly sliced) ",
            "2 Tbsp of brown sugar",
            "Pinch of cinnamon powder "
        ],
        "instructions": [
            "In  a bowl lightly knead flour with the cold butter.",
            "Add few spoons of water to make the dough compact.",
            "Pack the dough in a plastic film and rest for half an hour in the fridge.",
            "Place the apples in a bowl. Mix some brown sugar and cinnamon to the apples. ",
            "Once the dough is set place it between two plastic cling film sheets and roll it out to form a flat round disc.",
            "Place the apples in a baking dish.",
            "Remove the cling film sheets from the rolled out dough and place it on top of the apples.",
            "Make incisions using a fork to the dough for the air to escape.Brush the pastry with whisked egg.",
            "Bake the pie at 200°C for 15 minutes, then lower the temperature to 180°C and let it bake for another 20 minutes."
        ],
        "cook_time": "1 Hour 10 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Sea Bass Burger with Wasabi Mayo",
        "ingredients": [
            "1 sea bass fillet",
            "Salt",
            "Pepper",
            "Olive Oil",
            "1 cup of panko bread crumbs",
            "Handful of chopped dill",
            "Egg",
            "Cream cheese",
            "1 cup of rocket leaves",
            "Extra virgin olive oil",
            "1 tomato, pulp removed and cut into chunks",
            "Juice of 1/2 lemon",
            "Cheese slice",
            "For wasabi mayo:",
            "2 Tbsp of mayonnaise ",
            "1 Tbsp  of wasabi paste"
        ],
        "instructions": [
            "Season the fillets with salt, pepper and olive oil. Keep aside for 2-3 minutes.",
            "In a bowl, make a mixture of panko bread crumbs and dill.",
            "In another bowl, break the egg and whip it. Keep it aside.",
            "Coat the fillet with egg first and then with panko bread crumbs.",
            "Grill the fillet in olive oil for 2-2 1/2 minutes on each side.",
            "For the wasabi mayo:",
            "Add the mayo and the wasabi paste in a bowl and give it a good whisk. ",
            "Soak the tomatoes in wasabi mayo and put aside.",
            "Toast the buns and apply wasabi mayo on one half and cream cheese on the other.",
            "Season the rocket leaves with extra virgin olive oil, salt and pepper.",
            "To Serve: Put the cheese slice, the tomato chunks, rocket leaves and lemon juice on the bun. Sandwich the fillet between the buns and serve with fries.",
            "For Fries recipe: Click here"
        ],
        "cook_time": "45 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Lamb and Pork Burger with Chunky Salad",
        "ingredients": [
            "For lamb and pork burger:",
            "250 grams minced pork",
            "250 grams minced lamb",
            "8-10 cream crackers",
            "1 Tbsp worcestershire sauce",
            "2 onions",
            "Parsley, finely chopped",
            "Dijon mustard",
            "Salt",
            "Pepper",
            "Cheese slices",
            "Burger buns",
            "6 slices of bacon",
            "1 red chilli, sliced",
            "1 egg",
            "Butter",
            "Ketchup",
            "Olive Oil",
            "For chunky salad:",
            "1 cucumber, sliced",
            "2 tomatoes, chopped",
            "1 yellow capsicum, deseeded and chopped",
            "1 red capsicum, deseeded and chopped",
            "For lemon olive oil dressing:",
            "Extra virgin olive oil",
            "Juice of 1 lemon",
            "Sea salt ",
            "Pepper"
        ],
        "instructions": [
            "For lamb and pork burger:",
            "Put the crackers in a zip-lock bag and pound until crushed.",
            "In a large mixing bowl, add the crackers, parsley, one finely sliced onion, red chilli, one teaspoon of mustard, egg and Worcestershire sauce to minced pork and lamb and mix well. Season to taste.",
            "Roll the mixture into patties and cook them for 3-4 minutes on each side in a griddle pan.",
            "In another pan, heat bacon till crisp. Remove bacon from the pan and add thickly sliced onion to the excess bacon fat left in the pan. ",
            "Add a bit of butter, some ketchup, mustard and olive oil to it. Fry the onions till translucent.",
            "Finally, toast the buns and layer them with the onion mixture, fried bacon, the patty and finish off with a cheese slice.",
            "To Serve: Serve with chunky salad and fries on the side.",
            "For chunky salad with lemon olive oil dressing:",
            "In a bowl, whisk the extra virgin olive oil, lemon juice, salt and  pepper to make the dressing. ",
            "Chop the vegetables .",
            "Add some dressing to the chopped vegetables and toss . ",
            "To Serve: Serve with Burger and fries on the side.",
            "For Fries recipe: Click here"
        ],
        "cook_time": "1 Hour",
        "cuisine": "american"
    },
    {
        "name": "Fries",
        "ingredients": [
            "2 large potatoes",
            "Oil ",
            "Salt",
            "Pepper",
            "Rosemary"
        ],
        "instructions": [
            "Cut the potatoes into thin wafer strips.",
            "In a deep fryer, heat the oil and fry the potato strips till they turn crispy golden brown. Put them on a paper towel to drain excess oil.",
            "Pound the rosemary with salt and pepper.",
            "Sprinkle the pounded rosemary on the fries while still hot. ",
            "Serve the fries on the side with burgers.",
            "For Joey's Burger Recipes, Click on the following:",
            "Tofu Burger with TahiniSea Bass Burger with Wasabi MayoLamb and Pork Burger with Chunky Salad"
        ],
        "cook_time": "30 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Lamb Burger with Radish Slaw",
        "ingredients": [
            "For the burger: ",
            "\n500 gms lamb leg (minced) ",
            "2 tsp butter ",
            "1 onion (chopped)  ",
            "3 cloves garlic (chopped) ",
            "1/3 cup parsley (chopped) ",
            "1 tsp rosemary (chopped)\t",
            "1 egg yolk ",
            "Salt to taste ",
            "Black pepper to taste",
            "1 tsp thyme ",
            "1/3 cup parmesan cheese ",
            "For the radish slaw: ",
            "\n1 mediun white radish (julienne) 1 medium",
            "1 tsp parsley (chopped) 1 tsp",
            "1/2 cup green apple (julienne) 1/2 cup",
            "1 stalk spring onion 1 stalk",
            "1/2 lemon juice 1/2 lemon",
            "A pinch of sugar (a pinch)",
            "Olive oil and salt to taste ",
            "Pepper to taste",
            "For green chilli aioli: ",
            "\n1 green chilli ",
            "1 cup coriander\t",
            "1/2 cup mint leaves ",
            "1 cup mayonnaise ",
            "Salt to taste",
            "Sugar to taste",
            "1/3 cup coconut milk ",
            "1 tsp balsamic vinegar "
        ],
        "instructions": [
            "For lamb burger:",
            "\nIn a bowl take lamb mince, break in an egg, grate some parmesan cheese, rosemary and thyme.",
            "\nIn a processor blend some onions and garlic.",
            "\nSaute the onions and garlic in some butter on a pan. ",
            "\nAdd all the contents to lamb mince and mix well. Keep in the fridge.",
            "For the radish slaw:",
            "\nIn a stainless steel bowl, mix all and toss well. ",
            "Green chilli aioli:",
            "\nBlend all the ingredients."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Sesame Apple Salad",
        "ingredients": [
            "2 apples     2 medium carrots     1 bunch small radishes     1/2 cup golden raisins     1/2 cup chopped fresh parsley    ",
            "1/2 cup chopped fresh mint    ",
            "For dressing:",
            "1/4 cup cider vinegar     2 Tbsp honey     ",
            "1 tsp Dijon mustard    Salt and pepper to taste",
            "3/4 cup extra virgin olive oil    2 Tbsp sesame seeds, toasted "
        ],
        "instructions": [
            "Quarter apples. Remove core and thinly slice. Set aside in large bowl.",
            "Peel carrots and cut into matchstick pieces. Add to apples.",
            "Slice radishes and cut into thin strips. Add to apples. Gently toss with raisins, parsley and mint.",
            "In small bowl, whisk together, vinegar, honey, Dijon, salt and pepper. Slowly whisk in oil.",
            "Just before serving, toss salad with dressing and sprinkle with sesame seeds."
        ],
        "cook_time": "20 minutes",
        "cuisine": "american"
    },
    {
        "name": "Apple Cinnamon Muffins",
        "ingredients": [
            "3 cups all-purpose flour                1-3/4 cups sugar                    3-1/2 tsp baking powder                1/2 tsp salt                        1/2 tsp grated orange zest                1/4 tsp ground nutmeg                1 cup butter or margarine                1 cup peeled, cored and grated apples",
            "1 container (8 oz) low fat vanilla yogurt",
            "2 large eggs, beaten                1 tsp ground cinnamon                "
        ],
        "instructions": [
            "Serves: 24",
            "Pre-heat oven to 350 F (180 C). ",
            "Grease 24 3-inch (7.5-cm) muffin pan cups or line with paper liners.",
            "In large bowl, combine flour, 1 cup sugar, baking powder, salt, orange zest and nutmeg. ",
            "With pastry blender or fork, cut in 3/4 cup (175 mL) butter until mixture is crumbly.",
            "In medium bowl combine apple, yogurt and eggs. ",
            "Add to flour mixture, stirring until just combined. Spoon batter into prepared muffin cups and bake 20 to 25 minutes or until centres spring back when gently pressed.",
            "Cool muffins in pan 5 minutes. ",
            "Remove from pan and cool until able to handle. ",
            "Meanwhile, melt remaining butter. ",
            "In small bowl, combine remaining 3/4 cup sugar and cinnamon. ",
            "To serve, brush tops of muffins with butter and roll top in cinnamon-sugar mixture"
        ],
        "cook_time": "1 Hour",
        "cuisine": "american"
    },
    {
        "name": "Doughnuts",
        "ingredients": [
            "3 1/2 cups maida",
            "1 tsp salt",
            "5 tsp baking powder",
            "1 tsp cinnamon - powdered",
            "1 tsp nutmeg - powdered",
            "2 Tbsp butter",
            "3 cups sugar",
            "2 eggs - beaten well",
            "3 cups milk ",
            "Oil to deep fry"
        ],
        "instructions": [
            "Sift maida with salt, baking powder, cinnamon and nutmeg and keep aside.",
            "Cream butter and sugar. Add eggs and beat well.",
            "Add milk and maida and mix into a dough like consistency.",
            "Roll the dough on a lightly floured surface to 1 inch thickness.",
            "Cut with floured doughnut cutter and let stand for 15 minutes.",
            "Heat oil and add the doughnuts to it over high heat.",
            "Turn immediately and lower heat to medium and fry till brown.",
            "Drain on absorbent paper and serve."
        ],
        "cook_time": "35 minutes",
        "cuisine": "american"
    },
    {
        "name": "Mango and Litchi Compote",
        "ingredients": [
            "250 calories (per serving) ",
            "250 gm litchi flesh ",
            "250 gm diced mangoes ",
            "100 gm sugar ",
            "200 ml water ",
            "Pared rind of one lemon ",
            "2 Tbsp mint leaves"
        ],
        "instructions": [
            "Dissolve sugar in water along with lemon rind.    ",
            "Remove the syrup from the heat and add mint leaves.   ",
            "Cool and strain.   ",
            "Add the fruits to the syrup and chill."
        ],
        "cook_time": "20 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Apple and Date Pie",
        "ingredients": [
            "250 gm flour ",
            "125 gm diced chilled butter ",
            "2 egg yolks  ",
            "2-3 Tbsp water ",
            "For the Filling: ",
            "750 gm apples - peeled, cored and diced    ",
            "1 tsp butter  grated rind",
            " 2 limes ",
            "5 gm chopped, seeded dates",
            "3-4 Tbsp sugar      ",
            "For the Glaze:",
            "2 egg whites, beaten",
            "1 Tbsp castor sugar"
        ],
        "instructions": [
            "For the Pastry:",
            "Sieve flour into a bowl. ",
            "Rub in butter until mixture resembles breadcrumbs.   ",
            "Bind with yolks and water. ",
            "Knead lightly until smooth. ",
            "Cover and chill for 30 minutes.  ",
            "For the Filling:",
            "Soften apples in butter with rind and dates. ",
            "Stir in sugar. Cool. ",
            "Divide pastry in half. ",
            "Roll out half to line an 8\" pie plate. ",
            "Fill with apple mixture. ",
            "Moisten edge with a little water.   ",
            "Roll out remaining pastry and use to cover pie. Chill. ",
            "Glaze with beaten egg and sugar. ",
            "Bake at 190 degrees C for 20-25 minutes until golden in color.  ",
            "Serve with cream."
        ],
        "cook_time": "1 Hour",
        "cuisine": "american"
    },
    {
        "name": "Chocolate Brownie",
        "ingredients": [
            "100 gm butter",
            "200 gm sugar",
            "6 Tbsp cocoa",
            "100 ml milk",
            "150 gm flour",
            "2 eggs",
            "1/2 Tbsp baking powder",
            "50 gm chopped walnuts"
        ],
        "instructions": [
            "Melt the butter, sugar, cocoa and milk together.",
            "Add remaining ingredients. Stir to mix.",
            "Bake in a square baking tin at 180 degree C for 25 minutes.",
            "Cool and cut into squares."
        ],
        "cook_time": "35 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Ceviche",
        "ingredients": [
            "1 kg fish fillet - small pieces",
            "2 cups lemon juice ",
            "2 Tbsp olive oil ",
            "3 garlic cloves ",
            "1 kg tomato - diced ",
            "1 cup onions - chopped ",
            "3 Tbsp coriander - chopped ",
            "3 Tbsp ketchup ",
            "2 tsp tobasco sauce ",
            "Salt",
            "Black pepper ",
            "1/2 cup jalapeno peppers - chopped ",
            "1 cup olives - chopped"
        ],
        "instructions": [
            "Marinate the fish in lemon juice and leave for about 3 hours.",
            "Heat olive oil in a pan and saute garlic till golden brown. Keep aside.  ",
            "Take a bowl and mix all the other ingredients with the fish.",
            "Season with salt and pepper.  ",
            "Remove the garlic from olive oil and add it to the fish. Mix well.  ",
            "Garnish with olives and serve."
        ],
        "cook_time": "30 Minutes + Marination time(3hrs)",
        "cuisine": "american"
    },
    {
        "name": "Apple Pancakes",
        "ingredients": [
            "100 gm flour",
            "2 eggs",
            "250 ml milk",
            "1 Tbsp oil",
            "Filling:",
            "750 gm apples - peeled, cored and roughly chopped",
            "1 Tbsp butter",
            "Grated rind of 1 lemon",
            "25 gm chopped candied peel",
            "25 gm raisins",
            "2 - 3 Tbsp sugar",
            "Meringue:",
            "3 egg whites",
            "150 gm castor sugar"
        ],
        "instructions": [
            "To make the crepes add liquid ingredients to the flour and form a smooth batter.",
            "Leave the batter for 15 minutes before preparing pancakes in an oiled pan.",
            "Soften apples in butter over a gentle heat with lemon rind.   Add remaining ingredients.",
            "Use to fill pancakes, then roll and arrange in a buttered ovenproof dish.",
            "Whip egg whites until stiff, gradually whisking in castor sugar.",
            " Spoon or pipe over pancakes. Brown in a hot oven before serving."
        ],
        "cook_time": "30 minutes",
        "cuisine": "american"
    },
    {
        "name": "Chocolate Cake in a Pressure Cooker",
        "ingredients": [
            "1 cup flour  ",
            "1/4 cup cocoa powder  ",
            "1 1/4 tsp baking powder",
            "1/4 cup butter",
            "3/4 cup caster sugar",
            "1/4 cup water  ",
            "2 eggs  ",
            "1/2 tsp vanilla essence",
            "1/8 tsp salt  ",
            "6 inch round greased baking tin"
        ],
        "instructions": [
            "In a mixing bowl, sift the flour, cocoa powder and baking powder. ",
            "Add in the butter, sugar, salt, water and vanilla, and beat the ingredients using a whisk.     ",
            "Add the eggs and beat the batter until smooth. ",
            "Transfer into the baking tin.    ",
            "Heat the pressure cooker, covered with the lid but without the pressure, for 3-4 minutes on high heat, then place the cake tin in the empty cooker (do not add water in the cooker).     ",
            "Close the lid (without the pressure), lower the flame and let it cook until done (about 30 minutes)."
        ],
        "cook_time": "1 Hour",
        "cuisine": "american"
    },
    {
        "name": "Honey Chilli Potatoes",
        "ingredients": [
            "For the potatoes:",
            "2 potatoes, peeled and sliced",
            "3-4 Tbsp cornflour or maida",
            "Salt to taste",
            "1 tsp red chilli powder",
            "Oil, for deep frying",
            "For the base:",
            "1 tsp oil",
            "2 spring onions (with stalk), sliced",
            "1 Tbsp garlic paste",
            "1 capsicum, sliced",
            "2 Tbsp honey",
            "Salt, to taste",
            "1/4 tsp soya sauce",
            "3 tsp white sesame seeds",
            "2 tsp chilli sauce"
        ],
        "instructions": [
            "For the potatoes:",
            "In a bowl, add cornflour or maida, salt and red chilli powder.",
            "Add the sliced potatoes and mix well until the potatoes are coated.",
            "Heat oil in a wok and deep fry the potatoes until golden. Keep aside.",
            "For the Base:",
            "In a wok, add oil, garlic paste and spring onions. Saute on high heat for 1 minute.",
            "Add capsicum, honey, salt, soya sauce, chilli sauce. Saute for 2-3 minutes.",
            "Add the deep-fried potatoes and sesame seeds. Mix well and serve hot."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Vegetable Momos",
        "ingredients": [
            "For Dough:",
            "2 cups maida",
            "1/2 tsp salt ",
            "1/2 tsp baking powder   ",
            "For Filling: ",
            "1 cup carrots - grated ",
            "1 cup cabbage - grated ",
            "1 Tbsp oil ",
            "1/2 cup onion - finely chopped ",
            "1 tsp garlic - chopped  ",
            "1 tsp Soya sauce ",
            "Salt ",
            "1/4 tsp vinegar ",
            "1/4 tsp black pepper"
        ],
        "instructions": [
            "Mix the maida, salt and baking powder and knead to a stiff dough with water. ",
            "Heat oil and add the onion and garlic. ",
            "Saute over high heat and add the carrot and cabbage. Turn around over high heat till glossy. ",
            "Take it off the heat and mix in the Soya sauce, salt, vinegar and black pepper. ",
            "Roll the dough thin (translucent) and cut into 4\"-5\" rounds. ",
            "Take a round, wet edges and place some filling in the center. ",
            "Bring edges together to cover the filling. Twist to seal and fill the rest in the same way. ",
            "Steam for about 10 minutes and serve with soya sauce and chilli sauce."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Chole Bhature",
        "ingredients": [
            "For chole:",
            "2 cup chickpeas (channas)",
            "2 tsp oil",
            "1 bay leaf (tej patta)",
            "1 stick cinnamon (dalchini)",
            "3-4 cloves (laung)",
            "1 tsp whole pepper corns (sabut kali mirch)",
            "3 green cardamom  (choti elaichi)",
            "2 black cardamom (badi elaichi)",
            "1 tsp turmeric powder (haldi)",
            "1 tsp chili powder (lal mirch powder)",
            "1 tsp coriander powder (dhaniya powder)",
            "1 tsp cumin powder (zeera powder)",
            "1 tsp cumin seeds (zeera)",
            "1/2 tsp asafoetida (heeng)",
            "Salt to taste",
            "1 cup onions (chopped)",
            "1 cup tomatoes (chopped)",
            "1 tsp ginger (chopped)",
            "1 tsp garlic (chopped)",
            "1 tsp ajwain",
            "1 tsp lime juice",
            "1 green chili (chopped)                      1 tea bag                                                1 Tbsp butter",
            "For the bhaturas:",
            "2 cups maida (refined flour)",
            "1/2 tsp yeast, dissolved for 10 minutes in luke warm water",
            "1/2 cup whole wheat flour",
            "A pinch of salt",
            "Water to knead",
            "Oil for frying"
        ],
        "instructions": [
            "For chole:",
            "In a pan add oil, bay leaf, cinnamon, cumin seeds, cloves, whole pepper corns, green and black cardamom.",
            "After it gets brown add chopped onions and saute it.",
            "After sauteing add chopped ginger and garlic.",
            "Then add turmeric, chili powder, coriander powder, cumin powder, asafoetida, salt and fry well.",
            "For de glazing the pan add little water.",
            "Now add the chole (soaked overnight and pressure cooked) to the masala.",
            "After stirring well add tomatoes, little sugar and salt to the chole (chickpeas)",
            "Now add ajwain, chopped green chilies and water for the base.",
            "To get the color in the chole, add a tea bag to the masala.",
            "Simmer the chole gently for an hour and cover it.",
            "Add lime juice and a dollop of butter to it.",
            "Garnish the chole with coriander and butter.",
            "Serve the chole hot with bhaturas.",
            "For the bhaturas:",
            "Knead the whole wheat flour, maida and salt together with adequate amount of water.",
            "Sprinkle the yeast on top. Leave it for 2-3 hours for the yeast to work.",
            "Divide it into equal portions. Roll out in an oval or round shape.",
            "Deep fry till golden brown, like a puri.",
            "Serve. "
        ],
        "cook_time": "1 Hour",
        "cuisine": "american"
    },
    {
        "name": "Quick Chicken Curry",
        "ingredients": [
            "1 kg chicken",
            "3 large onions, paste",
            "2 large tomatoes, pureed",
            "1 Tbsp garlic paste",
            "1 Tbsp ginger paste",
            "2 tsp coriander powder",
            "2 tsp cumin powder",
            "1/2 tsp turmeric powder",
            "1/2 tsp red chilli powder",
            "1 tsp garam masala powder",
            "2 Tbsp oil",
            "Salt to taste",
            "Chopped coriander for garnish"
        ],
        "instructions": [
            "Heat oil in a pan and sauté the onion paste, garlic & ginger paste till golden brown.",
            "Add tomato puree. When the tomato puree dries up, add coriander powder, cumin powder, garam masala, red chilli powder, turmeric powder and salt. Let the spices cook.",
            "Add chicken pieces into the masala. Stir well and cook till they are golden brown.",
            "Add 1/2 cup of water and stir. Cover with a lid and let it simmer till the chicken is cooked.",
            "Garnish with chopped coriander and serve."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Butter Chicken",
        "ingredients": [
            "700 gm raw chicken  ",
            "For theMarinade:",
            "1 tsp red chilli powder ",
            "1 tsp ginger and garlic paste ",
            "Salt to taste ",
            "1/2 kg curd  ",
            "For theGravy:",
            "175 gm white butter ",
            "1/2 tsp black cumin seeds ",
            "1/2 kg tomato, pureed ",
            "1/2 tsp sugar ",
            "1 tsp red chilli powder ",
            "Salt to taste ",
            "100 gm fresh cream ",
            "4 green chillies, sliced",
            "1/2 tsp fenugreek leaves, crushed"
        ],
        "instructions": [
            "For marinating the chicken",
            "In a mixing bowl, mix red chilli powder, ginger garlic paste, salt and curd.  ",
            "Add the raw chicken pieces to the marinade and mix well. Keep it in the refrigerator overnight or minimum 6 hours.  ",
            "Roast the marinated chicken in a tandoor or an oven for about 10-12 minutes until it is three-fourth done.  ",
            "For the chicken gravy",
            "Heat half the quantity of white butter in pan. ",
            "Pour in the tomato puree, and saute for 2-3 minutes. Add cumin seeds, sugar, red chilli powder and salt. Mix well.  ",
            "Add the prepared chicken, white butter, fresh cream, sliced green chillies and crushed fenugreek leaves.  Saute for 3-4 minutes and let the chicken cook.",
            "Cook till chicken is done. Serve hot with rice or naan."
        ],
        "cook_time": "30 Minutes + Marination time (overnight)",
        "cuisine": "american"
    },
    {
        "name": "KFC Style Fried Chicken",
        "ingredients": [
            "8 chicken drumsticks/breast",
            "100 ml curd",
            "1 beaten egg",
            "50 gm all purpose flour",
            "50 gm bread crumbs",
            "1 tsp chilli powder",
            "1 tsp white pepper powder",
            "1 tsp onion, dried and powdered",
            "1 tsp basil/tulsi leaves, dried and powdered",
            "1 tsp oregano / omam leaves, dried and powdered",
            "1 green chilli, chopped",
            "1 tsp garlic, dried and powdered",
            "1 tsp ginger, dried and powdered",
            "Salt to taste",
            "Oil for frying"
        ],
        "instructions": [
            "Wash and clean chicken. Drain water well from chicken.",
            "Add beaten egg, curd, 1/2 tsp chilli powder, salt to chicken and mix well. Marinate it for at least 3 to 4 hours.",
            "Mix all purpose flour, green chillies, white pepper, oregano, garlic, ginger, basil or tulsi leaves, remaining chilli powder and salt.",
            "Cover marinated chicken with spicy all purpose flour mix and then with bread crumbs.",
            "Heat oil in a thick bottom kadai and deep fry the chicken in a slow fire till it is cooked.",
            "Serve hot with tomato ketchup."
        ],
        "cook_time": "30 minutes + Time to Marinate",
        "cuisine": "american"
    },
    {
        "name": "Chili Dogs",
        "ingredients": [
            "1/2 pound bacon, cut into small pieces",
            "1 large onion, chopped",
            "2 pounds ground beef",
            "4 chopped garlic cloves",
            "16 ounce can of tomato sauce",
            "1 cup beef broth",
            "2 Tbsp molasses or honey",
            "2 Tbsp sweet paprika",
            "1 Tbsp ground cumin",
            "1 Tbsp chili powder",
            "1 teaspoon cayenne (optional)",
            "Salt",
            "As many hot dogs as you have people to serve Buns for the hot dogs",
            "Chopped red onion, for garnish",
            "Shredded cheddar (or jack) cheese, for garnish"
        ],
        "instructions": [
            "Make the chili first. ",
            "Fry the bacon over medium heat until it begins to get crispy, then add the chopped onions and fry over high heat, stirring often, until they begin to brown. ",
            "Add in the ground beef and stir in well. Cook this, still over high heat and stirring occasionally, until the beef is browned. ",
            "This will take a few minutes. When the beef is about halfway browned, toss in the chopped garlic and mix well.",
            "Once the beef is well browned, add the tomato sauce, molasses and beef broth. ",
            "Add all the spices except the cayenne and stir well. Bring to a simmer and taste. ",
            "Add salt or the cayenne if it needs it. You can of course add much more cayenne or chili powder if you like things really spicy, but it's best to taste first and then add more.",
            "Let the chili cook on a gentle simmer for at least 30 minutes before you start grilling the hot dogs. ",
            "You can cook it several hours if you want to, adding a little more beef broth here and there if the chili gets to dry.",
            "Grill your hot dogs over medium heat until they get a light char. Grill the hot dog buns briefly if you want - no more than a minute, as they will burn fast. ",
            "You can also paint the buns with vegetable oil or butter before grilling if you'd like.",
            "Tip you can take the centers of the bun and stuff sausage in basically..",
            "Dog goes in bun, chili goes on top, sprinkle on chopped red onion and shredded cheese, and have a go at it!"
        ],
        "cook_time": "45 minutes",
        "cuisine": "american"
    },
    {
        "name": "Juicy Lamb Burger",
        "ingredients": [
            "1/2 kg lamb keema",
            "1 egg",
            "1 Tbsp rosemary leaves",
            "1/2 Tbsp red rice flakes",
            "1 Tbsp garlic",
            "1 Tbsp salt",
            "1/2 Tbsp black pepper",
            "Oil",
            "2 burger buns",
            "Lettuce",
            "4 sliced tomatoes"
        ],
        "instructions": [
            "First start with 1/2 kg of lamb keema. Then add of one egg, some rosemary leaves and rice flakes.",
            "Put 1 tsp garlic paste, salt and 1/2 tsp black pepper. Now mix it all well by hand.",
            "In a pan add some oil.",
            "Make 2 small rounds of keema paste, then fry it from the both side, then take 2 sliced burger and fry it in the pan. ",
            "Now keep the sliced bun on the plate and put lettuce, sliced tomatoes, onion, and fried keema patties on the burger.",
            "Cover it with a second bun and your lamb burgers are ready."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Radish Slaw",
        "ingredients": [
            "1/2 radish",
            "1 pear, sliced",
            "1/3 cabbage",
            "10 gm green bell pepper, sliced",
            "10 gm yellow bell pepper, sliced",
            "Juice of one lemon",
            "1 Tbsp sweet chilli sauce",
            "1 Tbsp rice vinegar",
            "1 tsp ginger",
            "2-3 mint leaves",
            "Pinch of salt and pepper",
            "1 Tbsp egg less mayonnaise",
            "One and a half tsp vegetable oil",
            "1 Tbsp chopped chives",
            "1 Tbsp chopped parsley",
            "Pepper to season"
        ],
        "instructions": [
            "Slice the radish and shred the cabbage into fine strips, put in a bowl of water with lemon juice, to avoid discoloration.",
            "Slice the pear and the bell peppers and put it in the same bowl.",
            "For the dressing:",
            "In another bowl make a dressing with sweet chili sauce, rice wine vinegar, ginger, mint leaves, egg less mayonnaise and vegetable oil and whisk together.",
            "Drain out the water from the vegetables and pat dry.",
            "Add these vegetables to the dressing and mix well.",
            "Once all the vegetables are coated in the dressing your slaw is ready."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Vegetable Burger",
        "ingredients": [
            "2 burger buns",
            "30 gm chopped celery",
            "2 cloves minced garlic ",
            "1 medium chopped onion",
            "1/2 diced sweet potato (baked)",
            "1 medium diced potato (baked)",
            "1 Tbsp cooked black beans",
            "1 1/2 Tbsp cooked kidney beans",
            " 1 1/2 Tbsp cooked red rice",
            "1 tsp paprika powder",
            "1 tsp coriander powder",
            "1 tsp roasted jeera powder",
            "1 big tsp grain mustard",
            "2-3 tsp chopped coriander",
            "Few leaves of rosemary",
            "Salt and pepper to taste",
            "For the Filling:",
            "1 leaf of iceberg lettuce",
            "1/2 slice onion",
            "1 sliced tomato",
            "For the Coating:",
            "1/2 cup bread crumbs"
        ],
        "instructions": [
            "Saute the onions, celery, garlic, sweet potato, potato, black beans, kidney beans, red rice, paprika powder, coriander powder, roasted jeera powder and grain mustard in olive oil until soft.",
            "Add the coriander leaves and rosemary sprigs and mix it all nicely.",
            "Mash by hand or in a mixer.",
            "On a floured surface shape the mixture into burger patties.",
            "Sprinkle breadcrumbs over the patties.",
            "Shallow fry in a little olive oil until nice and brown.",
            "Serve with a burger bun with a nice crunchy radish slaw."
        ],
        "cook_time": "45 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Gluten-Free Buckwheat Pancakes",
        "ingredients": [
            "2 eggs, separated",
            "3/4 cup skimmed milk",
            "2 Tbsp plain yoghurt",
            "1/2 cup buckwheat flour (kuttu ka atta)",
            "1/2 cup rice flour (chawal ka atta)",
            "1 Tbsp cornmeal (makki ka atta)",
            "1/2 tsp baking powder",
            "Pinch of salt",
            "Unsalted butter",
            "Marmalade or honey"
        ],
        "instructions": [
            "Beat egg yolks, milk and yoghurt till smooth.",
            "In another bowl sift buckwheat and rice flour and cornmeal, baking powder, sugar and salt.",
            "Add milk mixture to flours and stir lightly. Then add the oil, and the mixture lightens up. ",
            "Beat egg whites till stiff and fold into batter.",
            "Melt butter in frying pan, pour in a large ladle of the batter. Cook over low-medium heat until pancake is lightly golden on underside.",
            "Turn over and cook for another minute till the pancake is cooked through.",
            "Serve hot with marmalade."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Bran Whole Wheat Muffins",
        "ingredients": [
            "For the Muffins: ",
            "1 1/2 cups wheat bran cereal",
            "1 cup non fat milk ",
            "1/2 cup apple sauce",
            "1 egg",
            "2/3 cup brown sugar",
            "1/2 tsp vanilla extract",
            "1/2 cup all-purpose flour ( maida)",
            "1/2 cup whole wheat flour (atta)",
            "1 tsp baking soda",
            "1 tsp baking powder",
            "1/2 tsp salt",
            "A few sprinkles of dark chocolate chips or raisins per muffin.",
            "For one cup Apple Sauce: ",
            "\n4 apples - deskinned and cut",
            "Juice of 2 lemons",
            "1 tsp brown sugar",
            "Pinch of Cinnamon"
        ],
        "instructions": [
            "For the Muffins:",
            "Preheat oven to 375 degrees F (190 degrees C).",
            "Grease muffin cups or use paper muffin liners.",
            "Make the apple sauce by stewing the apples mixed with lime juice, brown sugar and cinnamon. you can store this in an airtight container for up to a week.",
            "Mix together wheat bran and milk, and let stand for 10 minutes.",
            "In a large bowl, mix together applesauce, egg, brown sugar, and vanilla. Beat in bran mixture. Sift together all-purpose flour, whole wheat flour, baking soda, baking powder, and salt. Stir into bran mixture until just blended. Add chocolate chips.",
            "Scoop into muffin cups.",
            "Bake in preheated oven for 15 to 20 minutes, or until the edges have browned and the top is set.",
            "For the Apple Sauce:",
            "Put the apples and water in a saucepan. Cover and bring to the boil.",
            "Boil over low heat, stirring occasionally, 20 minutes. Stir in sugar and cook until it dissolves. Add cinnamon.",
            "Store in a jar and refrigerate.",
            "Tip:",
            "You can substitute apple sauce for butter in many baking dishes. "
        ],
        "cook_time": "1 Hour",
        "cuisine": "american"
    },
    {
        "name": "Sugar Free Granola",
        "ingredients": [
            "2 cups of rolled oats (not ready-to-eat)",
            "1 1/2 Tbsp sunflower seeds",
            "1 Tbsp pumpkin seeds",
            "1 Tbsp sesame seeds (safed til)",
            "One packet flax seeds (14 gms)",
            "1/4 cup of orange juice",
            "2 Tbsp olive oil",
            "Half a handful of strawberries/apple",
            "2 Tbsp of hung yoghurt",
            "10 skinned almonds, cut into slivers."
        ],
        "instructions": [
            "Preheat the oven to 325 degrees F.",
            "Mix the juice into the oats. Then add all other ingredients and spread them evenly onto a baking tray.",
            "Bake for 45 minutes and keep turning the mixture frequently.",
            "Remove from the oven and leave until cool.",
            "Add the hung yoghurt, almonds and fresh fruits.",
            "If you feel indulgent, you can add a teaspoon of honey.",
            "Serve.",
            "TIPDon't mix the yoghurt and fruit way before you serve the Muesli. It will be too dry."
        ],
        "cook_time": "1 Hour",
        "cuisine": "american"
    },
    {
        "name": "Potato Corn Burgers",
        "ingredients": [
            "4 Tbsp olive oil",
            "1/2 a leek",
            "1/3 cup chopped celery",
            "1/2 chopped onion",
            "1 cup corn kernels frozen",
            "Few sprigs thyme",
            "Few coriander leaves",
            "2 large potatoes roasted and peeled",
            "5-6 pieces pickled jalapenos",
            "1 tsp garlic chives chopped",
            "75 gm feta cheese",
            "1 Tbsp corn flour",
            "2 Tbsp milk",
            "1 cup bread crumbs",
            "4-5 Tbsp oil for frying",
            "1 tomato",
            "1 lettuce leaf",
            "Few gherkins",
            "3-4 tomatoes"
        ],
        "instructions": [
            "Heat up 2 tbsp of olive oil in a hot pan; add the onions, leeks, celery and the corn and season with salt and thyme and sauté for 5 minutes",
            "Peel the cooked potatoes, grate or mash the potatoes in a bowl. ",
            "Mix the potatoes with the corn, onion, leeks, celery.",
            "Add the jalapenos, a large handful of coriander and crumble the feta cheese into the mixture.",
            "Mix all the ingredients really well and season to taste.",
            "Let the mixture rest in the fridge for a few minutes.",
            "Mix some corn flour and milk to make a light batter. ",
            "Put the bread crumbs in a plate. ",
            "Shape the burger patties into with a cutter or mould.",
            "Dip the patty in the batter and cover with breadcrumbs. ",
            "Heat up 2 tbsp oil in pan and shallow fry until nice and brown.",
            "Slice up some tomatoes and put it in a lettuce leaf for the garnish along with some gherkins.",
            "Heat the buns in the oven. ",
            "Put the lettuce, tomatoes and gherkins inside the bun along with the patty and serve with chips on the side."
        ],
        "cook_time": "35 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Soy Protein and Bean Ragout",
        "ingredients": [
            "1/2 a yellow bell pepper",
            "1/2 a green bell pepper ",
            "1 cup cooked rice",
            "1 medium onion",
            "1 stalk spring onions",
            "3 cloves garlic",
            "1 cup diced zucchini",
            "1 diced tomato",
            "1/2 cup kidney beans cooked",
            "1 chipotle chili ",
            "Juice of 1/2 an orange",
            "1 tsp bitter chocolate",
            "Few leaves oregano",
            "Few leaves parsley",
            "7 button mushrooms",
            "1 cup soy protein",
            "1 tsp cumin powder",
            "1 cup tomato juice",
            "1 tsp soya sauce",
            "1-2 Tbsp vegetable oil"
        ],
        "instructions": [
            "Put soy protein in hot water until soft and hydrated.",
            "Put the chipotle chilies in hot water to rehydrate.",
            "Slice mushroom and onions.",
            "Put the onions in a pan and sauté with vegetable oil.",
            "Drain the soy protein and squeeze the excess water. ",
            "Add to the onions and mushrooms in the pan and caramelise it. ",
            "Fry them till they are a dark brown colour.",
            "Add the mushroom to the onions and soy protein. ",
            "Add the diced zucchini and nicely sweat the vegetables. ",
            "For the Chipotle Chili Paste:",
            "Add the garlic, spring onion, cumin powder and tomato puree into a mixer.",
            "Along with the hydrated chipotle chilies with some of the leftover chipotle water.Blitz it into a nice paste.",
            "Then add this chipotle chili paste to the vegetables. ",
            "Deglaze with the orange juice. ",
            "Add cooked rajma/ kidney beans and mix well & add in grated bitter chocolate. ",
            "Mix it all together. ",
            "Add salt to taste, tomato juice and soy sauce.",
            "Garnish with freshly chopped coriander."
        ],
        "cook_time": "1 Hour",
        "cuisine": "american"
    },
    {
        "name": "Barbecued Corn with Chilli and Lime Butter",
        "ingredients": [
            "2 whole corns on the cob",
            "Butter for the corn:",
            "150 gm soft butter",
            "1 tsp garlic minced ",
            "1 tsp red chilli flakes",
            "Juice of 1/2 a lime",
            "1 tsp parsley",
            "Few dashes Tabasco sauce",
            "Salt and pepper to taste",
            "1 green chilli chopped",
            "Few sprigs coriander",
            "Juice of 1/2 a sweet lime"
        ],
        "instructions": [
            "Pull out the husk off the corn and trim away the stem.",
            "Whip up the butter with all the ingredients.",
            "Grill the whole corn cobs on a charcoal grill/barbecue, rotating them carefully until well roasted all over.",
            "Season to taste with salt and pepper and brush generously with the flavored butter. ",
            "Serve the barbecued corn hot!"
        ],
        "cook_time": "20 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Meat Loaf",
        "ingredients": [
            "740 gm minced meat    ",
            "100 gm fresh breadcrumbs    ",
            "4 Tbsp lemon juice    ",
            "2 tsp garlic paste    ",
            "3 ground onions    ",
            "2 tsp dried basil    ",
            "Salt and pepper    ",
            "1 beaten egg    ",
            "1 Tbsp beaten butter     ",
            "For the Topping: ",
            "5 Tbsp tomato ketchup    ",
            "2 Tbsp grated jaggery    ",
            "2 tsp prepared mustard    ",
            "2 Tbsp vinegar    ",
            "1/4 tsp mild chilli powder    ",
            "2 cloves    ",
            "1 tsp strained ginger juice    ",
            "1 sliced lime     ",
            "For the Rice Salad:",
            "8 Tbsp cooked rice    ",
            "1 green capsicum    ",
            "100 gm blanched beans    ",
            "100 gm cooked peas    ",
            "100 gm torn spinach leaves    ",
            "100 gm sliced spring onions    ",
            "2 Tbsp shredded garden herbs     ",
            "For the Dressing:",
            "4 Tbsp olive/salad oil    ",
            "2 Tbsp lemon juice    ",
            "1 tsp garlic paste    ",
            "1/2 tsp oregano    ",
            "Pinch of mustard powder    ",
            "Salt and pepper"
        ],
        "instructions": [
            "Mix all meat loaf ingredients together. ",
            "Press into an oiled 1 kg loaf tin.",
            "Bake at 180 degrees c for 15 minutes. ",
            "Mix topping ingredients together. Spoon over loaf. ",
            "Arrange lemon slices on top.   Continue cooking for a further half hour. ",
            "Serve with rice salad.     ",
            "For Rice Salad: ",
            "Combine salad ingredients together. ",
            "Whisk together items for dressing. ",
            "Pour over rice salad. Chill and serve with meat loaf."
        ],
        "cook_time": "1 Hour",
        "cuisine": "american"
    },
    {
        "name": "Crumb-Fried Chicken",
        "ingredients": [
            "1 chicken - cut into 6 pieces ",
            "2 eggs ",
            "1 Tbsp garlic paste  ",
            "1/4 cup refined flour ",
            "Dash of black pepper ",
            "1 Tbsp salt or to taste ",
            "Powdered bread crumbs to coat the chicken ",
            "Oil for deep-frying"
        ],
        "instructions": [
            "Place the chicken, eggs, garlic paste, refined flour, black pepper and salt in a bowl and mix well. Leave thus for at least an hour.  ",
            "Lift the pieces and coat with the breadcrumbs and keep aside.  ",
            "Heat the oil till a piece of bread thrown in comes up at once. ",
            "Place as many chicken pieces as come in without touching each other.   ",
            "Turn once and lower the heat and let fry to a golden and then turn once again till golden on both sides. ",
            "Drain on absorbent paper and serve.   ",
            "Note: In case you want to serve later, fry them for a short while on both sides, not letting them brown, and fry again to a golden color before serving."
        ],
        "cook_time": "25 Minutes + Marination Time(1hr)",
        "cuisine": "american"
    },
    {
        "name": "Jambalaya",
        "ingredients": [
            "750 gm chicken cubes ",
            "    500 gm any spicy sausage 1/4 oil, bacon drippings 2 cups chopped onions2 cups choppped celery 1 cup chopped bell peppers1/4 cup diced garlic 1.25 litres chicken stock 2 cups sliced button mushrooms1 cup sliced spring onions 1/2 cup chopped parsley Salt and cayenne pepper to taste750 gm long grained rice 2 Tbsp tabascoA small bunch of thyme & oregano 200 gm prawns 2 Tbsp tomato puree"
        ],
        "instructions": [
            "In a two gallon dutch oven, heat oil or bacon drippings over medium high heat.",
            "Saute cubed chicken until dark brown on all sides and some pieces are sticking to the bottom of the pot, approximately thirty minutes.",
            "This is very important as the brown color of jambalaya is derived from the color of the meat.",
            "Add sausage and stir fry an additional 6 minutes.",
            "Tilt the pot to one side and ladle out all oil, except for one large cooking spoon.",
            "Add onions, celery, bell pepper and garlic until all vegetables are well caramelised. Add stock, bring to a rolling boil and reduce heat to simmer.",
            "Cook all ingredients in stock approximately fifteen minutes for flavors to develop.",
            "Add mushrooms, green onions and parsley. Season to taste using salt, cayenne pepper. Add rice, reduce heat to very low and allow to cook thirty to forty-five minutes, stiring every 15 minutes."
        ],
        "cook_time": "2 Hours",
        "cuisine": "american"
    },
    {
        "name": "Apple Pie with Raisin Relish",
        "ingredients": [
            "For apple pie filling: ",
            " 100 gm butter ",
            " 4 medium apple ",
            " 1/3 tsp cinnamon",
            " 15 -20 gm sugar For pie cover:",
            " 100 gm flour",
            " 100 gm icing sugar",
            " 100 gm butter",
            " 50 ml waterFor raisin chutney:",
            " 1 Tbsp whole mix spices ",
            " 100 gm raisin ",
            " 30 gm sugar",
            " 20 ml lemon Juice",
            " 20 ml orange Juice"
        ],
        "instructions": [
            "For apple pie filling:",
            " Peel the apples, in a sauce pan, moist the apples with 100 gm of butter and add 1/3 tsp Cinnamon and 15-20 gms sugar, cook it till it becomes thick.  Fill the pie shell with the apple mixture.For pie cover: ",
            " Prepare the pie dough, mix 100 gm flour, 100 gm butter, 100 gm icing sugar till it becomes crumbly; add 50 ml water into it to form smooth dough.  Divide the dough in two equal pieces. Refrigerate for 1/2 a hr. Roll half of the dough 1/8 inch thick and line the pie pan. Reserve the other half wrapped tightly under refrigeration.  Roll out the remaining dough 1/8 inch thick and place it over the filling. Crimp the edges to seal, cutting several vents in the top of the pie. Bake at 180 C, about 45 minutes to 1 hour.",
            "Cool to room temperature before serving.For raisin chutney: ",
            " Cook 100 gm raisins, 30 gm sugar, 20 ml lemon juice, 20 ml orange juice and whole spice together on slow fire till it becomes soft.",
            "Serve with hot apple pie."
        ],
        "cook_time": "1 Hour 30 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Waldorf Salad",
        "ingredients": [
            "3 cups apples - cored and diced  ",
            "1 tbsp sugar  ",
            "salt ",
            "1 cup celery - chopped fine ",
            "1/2 cup walnuts - coarsely chopped  ",
            "1/4 cup mayonnaise sauce ",
            "1/2 cup cream - whipped ",
            "salad greens"
        ],
        "instructions": [
            "Sprinkle cubed apples with sugar, lemon juice and salt. ",
            "Add celery and nuts.   ",
            "Fold mayonnaise into whipped cream and mix gently into the apple mixture.   ",
            "Heap the salad on the prepared plate with the greens and serve."
        ],
        "cook_time": "10 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Submarines and Mayo",
        "ingredients": [
            "1 cup refined oil  ",
            "1 egg  ",
            "2 tbsp vinegar  ",
            "1/2 tsp sugar  ",
            "Salt - to taste  ",
            "1/4 tsp black pepper powder  ",
            "1/4 tsp mustard powder or mustard oil    ",
            "For Submarine Sandwich:",
            "1 French loaf (12 inches)  ",
            "3-4 tbsp mayonnaise or olive oil  ",
            "4 salami slices  ",
            "4 ham slices  ",
            "2 cheese slices  ",
            "4 thinly sliced onions  ",
            "Dried oregano - to taste  ",
            "Mustard sauce - to taste  ",
            "Lettuce leaves (optional)"
        ],
        "instructions": [
            "Break the egg and put it in the blender.    ",
            "Add the vinegar, salt, pepper, mustard and sugar.    ",
            "Switch on the blender at full speed and simultaneously start pouring the oil in a thin stream through the small opening on top of the blender till it thickens to the required consistency.    ",
            "For Subamarine Sandwiches:",
            "Slit the bread horizontally leaving it joined on one side.    ",
            "Spread the mayonnaise on the side or you could drizzle generous amounts of olive oil instead of mayonnaise.    ",
            "Arrange the ham, salami and cheese slices over this.    ",
            "Put the onions on top of this, spread a bit of mustard sauce and sprinkle the oregano.    ",
            "Fold the other half of the bread over and serve."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Hamburgers and Fries",
        "ingredients": [
            "250 gm minced mutton",
            "4 Tbsp onions - finely chopped   ",
            "1/2 tsp ginger-garlic paste ",
            "1/2 tsp black pepper powder  ",
            "Salt - to taste  oil   ",
            "3-4 Tbsp butter  ",
            "3-4 burger buns  ",
            "4 tomato slices  ",
            "4 onion slices  ",
            "Coleslaw (optional) ",
            "Mayonnaise (optional)    ",
            "For French Fries: 3-4 large potatoes  ",
            "Salt - to taste  ",
            "Pepper (optional)  ",
            "Oil - for deep frying"
        ],
        "instructions": [
            "Mix the minced mutton, onion, garlic-ginger paste, salt and pepper together.    ",
            "Shape the mixture in 3 or 4 round patties and refrigerate for an hour. ",
            "Pan fry these patties by browning both sides over a high heat, then lower the heat and let them cook through and remove.    ",
            "In the same pan, melt some butter, slit the buns in half and semi-toast them in the butter.    ",
            "Now make the hamburger with onion and tomato slices, coleslaw or mayonnaise.    ",
            "Serve with ketchup or mustard and fries.    ",
            "For French Fries:",
            "A double fry method for making crispier fries.",
            "Peel and slice the potatoes into 'fingers'.    ",
            "Boil some water with a pinch of salt.    ",
            "When it boils, add the potatoes, switch off the fire and leave for 5-6 minutes.    ",
            "Take the potatoes out and drain them well or wipe dry.    ",
            "Heat oil in a pan and add the potato fingers.    ",
            "Lower the heat to medium and fry till they become light golden. (half cooked)",
            "Then remove from the oil and drain.    ",
            "Just before serving fry the same potato fingers again over a high heat till golden brown.    ",
            "Sprinkle some salt and pepper and serve."
        ],
        "cook_time": "1 Hour 30 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Chocolate Cake in a Pressure Cooker",
        "ingredients": [
            "1 cup flour  ",
            "1/4 cup cocoa powder  ",
            "1 1/4 tsp baking powder",
            "1/4 cup butter",
            "3/4 cup caster sugar",
            "1/4 cup water  ",
            "2 eggs  ",
            "1/2 tsp vanilla essence",
            "1/8 tsp salt  ",
            "6 inch round greased baking tin"
        ],
        "instructions": [
            "In a mixing bowl, sift the flour, cocoa powder and baking powder. ",
            "Add in the butter, sugar, salt, water and vanilla, and beat the ingredients using a whisk.     ",
            "Add the eggs and beat the batter until smooth. ",
            "Transfer into the baking tin.    ",
            "Heat the pressure cooker, covered with the lid but without the pressure, for 3-4 minutes on high heat, then place the cake tin in the empty cooker (do not add water in the cooker).     ",
            "Close the lid (without the pressure), lower the flame and let it cook until done (about 30 minutes)."
        ],
        "cook_time": "1 Hour",
        "cuisine": "american"
    },
    {
        "name": "Honey Chilli Potatoes",
        "ingredients": [
            "For the potatoes:",
            "2 potatoes, peeled and sliced",
            "3-4 Tbsp cornflour or maida",
            "Salt to taste",
            "1 tsp red chilli powder",
            "Oil, for deep frying",
            "For the base:",
            "1 tsp oil",
            "2 spring onions (with stalk), sliced",
            "1 Tbsp garlic paste",
            "1 capsicum, sliced",
            "2 Tbsp honey",
            "Salt, to taste",
            "1/4 tsp soya sauce",
            "3 tsp white sesame seeds",
            "2 tsp chilli sauce"
        ],
        "instructions": [
            "For the potatoes:",
            "In a bowl, add cornflour or maida, salt and red chilli powder.",
            "Add the sliced potatoes and mix well until the potatoes are coated.",
            "Heat oil in a wok and deep fry the potatoes until golden. Keep aside.",
            "For the Base:",
            "In a wok, add oil, garlic paste and spring onions. Saute on high heat for 1 minute.",
            "Add capsicum, honey, salt, soya sauce, chilli sauce. Saute for 2-3 minutes.",
            "Add the deep-fried potatoes and sesame seeds. Mix well and serve hot."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Vegetable Momos",
        "ingredients": [
            "For Dough:",
            "2 cups maida",
            "1/2 tsp salt ",
            "1/2 tsp baking powder   ",
            "For Filling: ",
            "1 cup carrots - grated ",
            "1 cup cabbage - grated ",
            "1 Tbsp oil ",
            "1/2 cup onion - finely chopped ",
            "1 tsp garlic - chopped  ",
            "1 tsp Soya sauce ",
            "Salt ",
            "1/4 tsp vinegar ",
            "1/4 tsp black pepper"
        ],
        "instructions": [
            "Mix the maida, salt and baking powder and knead to a stiff dough with water. ",
            "Heat oil and add the onion and garlic. ",
            "Saute over high heat and add the carrot and cabbage. Turn around over high heat till glossy. ",
            "Take it off the heat and mix in the Soya sauce, salt, vinegar and black pepper. ",
            "Roll the dough thin (translucent) and cut into 4\"-5\" rounds. ",
            "Take a round, wet edges and place some filling in the center. ",
            "Bring edges together to cover the filling. Twist to seal and fill the rest in the same way. ",
            "Steam for about 10 minutes and serve with soya sauce and chilli sauce."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Chole Bhature",
        "ingredients": [
            "For chole:",
            "2 cup chickpeas (channas)",
            "2 tsp oil",
            "1 bay leaf (tej patta)",
            "1 stick cinnamon (dalchini)",
            "3-4 cloves (laung)",
            "1 tsp whole pepper corns (sabut kali mirch)",
            "3 green cardamom  (choti elaichi)",
            "2 black cardamom (badi elaichi)",
            "1 tsp turmeric powder (haldi)",
            "1 tsp chili powder (lal mirch powder)",
            "1 tsp coriander powder (dhaniya powder)",
            "1 tsp cumin powder (zeera powder)",
            "1 tsp cumin seeds (zeera)",
            "1/2 tsp asafoetida (heeng)",
            "Salt to taste",
            "1 cup onions (chopped)",
            "1 cup tomatoes (chopped)",
            "1 tsp ginger (chopped)",
            "1 tsp garlic (chopped)",
            "1 tsp ajwain",
            "1 tsp lime juice",
            "1 green chili (chopped)                      1 tea bag                                                1 Tbsp butter",
            "For the bhaturas:",
            "2 cups maida (refined flour)",
            "1/2 tsp yeast, dissolved for 10 minutes in luke warm water",
            "1/2 cup whole wheat flour",
            "A pinch of salt",
            "Water to knead",
            "Oil for frying"
        ],
        "instructions": [
            "For chole:",
            "In a pan add oil, bay leaf, cinnamon, cumin seeds, cloves, whole pepper corns, green and black cardamom.",
            "After it gets brown add chopped onions and saute it.",
            "After sauteing add chopped ginger and garlic.",
            "Then add turmeric, chili powder, coriander powder, cumin powder, asafoetida, salt and fry well.",
            "For de glazing the pan add little water.",
            "Now add the chole (soaked overnight and pressure cooked) to the masala.",
            "After stirring well add tomatoes, little sugar and salt to the chole (chickpeas)",
            "Now add ajwain, chopped green chilies and water for the base.",
            "To get the color in the chole, add a tea bag to the masala.",
            "Simmer the chole gently for an hour and cover it.",
            "Add lime juice and a dollop of butter to it.",
            "Garnish the chole with coriander and butter.",
            "Serve the chole hot with bhaturas.",
            "For the bhaturas:",
            "Knead the whole wheat flour, maida and salt together with adequate amount of water.",
            "Sprinkle the yeast on top. Leave it for 2-3 hours for the yeast to work.",
            "Divide it into equal portions. Roll out in an oval or round shape.",
            "Deep fry till golden brown, like a puri.",
            "Serve. "
        ],
        "cook_time": "1 Hour",
        "cuisine": "american"
    },
    {
        "name": "Quick Chicken Curry",
        "ingredients": [
            "1 kg chicken",
            "3 large onions, paste",
            "2 large tomatoes, pureed",
            "1 Tbsp garlic paste",
            "1 Tbsp ginger paste",
            "2 tsp coriander powder",
            "2 tsp cumin powder",
            "1/2 tsp turmeric powder",
            "1/2 tsp red chilli powder",
            "1 tsp garam masala powder",
            "2 Tbsp oil",
            "Salt to taste",
            "Chopped coriander for garnish"
        ],
        "instructions": [
            "Heat oil in a pan and sauté the onion paste, garlic & ginger paste till golden brown.",
            "Add tomato puree. When the tomato puree dries up, add coriander powder, cumin powder, garam masala, red chilli powder, turmeric powder and salt. Let the spices cook.",
            "Add chicken pieces into the masala. Stir well and cook till they are golden brown.",
            "Add 1/2 cup of water and stir. Cover with a lid and let it simmer till the chicken is cooked.",
            "Garnish with chopped coriander and serve."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Butter Chicken",
        "ingredients": [
            "700 gm raw chicken  ",
            "For theMarinade:",
            "1 tsp red chilli powder ",
            "1 tsp ginger and garlic paste ",
            "Salt to taste ",
            "1/2 kg curd  ",
            "For theGravy:",
            "175 gm white butter ",
            "1/2 tsp black cumin seeds ",
            "1/2 kg tomato, pureed ",
            "1/2 tsp sugar ",
            "1 tsp red chilli powder ",
            "Salt to taste ",
            "100 gm fresh cream ",
            "4 green chillies, sliced",
            "1/2 tsp fenugreek leaves, crushed"
        ],
        "instructions": [
            "For marinating the chicken",
            "In a mixing bowl, mix red chilli powder, ginger garlic paste, salt and curd.  ",
            "Add the raw chicken pieces to the marinade and mix well. Keep it in the refrigerator overnight or minimum 6 hours.  ",
            "Roast the marinated chicken in a tandoor or an oven for about 10-12 minutes until it is three-fourth done.  ",
            "For the chicken gravy",
            "Heat half the quantity of white butter in pan. ",
            "Pour in the tomato puree, and saute for 2-3 minutes. Add cumin seeds, sugar, red chilli powder and salt. Mix well.  ",
            "Add the prepared chicken, white butter, fresh cream, sliced green chillies and crushed fenugreek leaves.  Saute for 3-4 minutes and let the chicken cook.",
            "Cook till chicken is done. Serve hot with rice or naan."
        ],
        "cook_time": "30 Minutes + Marination time (overnight)",
        "cuisine": "american"
    },
    {
        "name": "Hash Browns",
        "ingredients": [
            "4 medium potatoes - cooked, peeled, and chilled   ",
            "6 Tbsp butter   ",
            "1 large onion - thinly sliced   ",
            "Salt - to taste  ",
            "Pepper - to taste"
        ],
        "instructions": [
            "Grate the potatoes thickly.     In a pan, melt the butter over medium heat. ",
            "Add onion and cook until transparent, about five minutes. ",
            "Add potatoes and stir to blend; press down firmly.     ",
            "Cook over low heat for 25 to 30 minutes, until potatoes are crisp and brown on the bottom.   ",
            "Cut through potatoes from the edge of the pan to center. ",
            "Carefully run a spatula under cut sections, flipping over one section at a time.     ",
            "Cook until browned. ",
            "Run spatula under potatoes, loosening them from the skillet.     ",
            "Transfer on to a serving dish, sprinkle with salt and pepper and serve."
        ],
        "cook_time": "45 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Potato Skins",
        "ingredients": [
            "6 potatoes - medium size   ",
            "1 Tbsp oil   ",
            "cheddar cheese - grated   ",
            "mustard sauce   ",
            "dry oregano"
        ],
        "instructions": [
            "Cut the potatoes into two halves. ",
            "Scoop out the insides with a spoon. ",
            "Oil the skins all over with your fingers.   ",
            "Put them in the oven at 200 degree C for 10-15 minutes or till brown.  ",
            "Remove from oven, spread a little mustard on the inside and fill them with cheese.    ",
            "Sprinkle a little oregano on top and put them back in the oven for five minutes till the cheese melts.  ",
            "Serve hot."
        ],
        "cook_time": "30 Mins",
        "cuisine": "american"
    },
    {
        "name": "Oreo Cookie Cheesecake",
        "ingredients": [
            "25 oreo cookies  ",
            "4 Tbsp melted butter  ",
            "4 packets cream cheese  ",
            "4 Tbsp corn flour  ",
            "1 cup sugar  ",
            "4 eggs  ",
            "2 tsp vanilla essence   ",
            "2 bars melted chocolate (240 gm)",
            "1/2 cup cream  ",
            "1/3 cup liquor of choice (optional)"
        ],
        "instructions": [
            "Crush about 20 cookies and and mix in the melted butter. Line the base of the baking pan evenly with this mixture.    ",
            "Now beat cream cheese, sugar and cornflour together. Once it becomes creamy, mix in the eggs but do it one at a time.     ",
            "Stir in the liquor and vanilla essence. Add melted chocolate and cream. Break the remaining cookies into smaller pieces and mix.     ",
            "Pour the batter over the crust and bake it in the oven at 180 degrees C for about 10 minutes. Turn the heat down to 100 degrees C and bake for 2 hours.    ",
            "When done leave the cake in the oven to cool for two hours and then refrigerate overnight.    ",
            "Garnish with some mint leaves. Slice and serve."
        ],
        "cook_time": "3 Hours + Chilling time",
        "cuisine": "american"
    },
    {
        "name": "Foot-Long/Submarine Sandwich",
        "ingredients": [
            "1 french loaf",
            "2 Tbsp tomato ketchup",
            "3 Tbsp mayonnaise sauce",
            "4 lettuce leaves",
            "100 gm salami slices",
            "100 gm ham slices",
            "4 cheese slices-cut into halves",
            "2 Tbsp onions-sliced thin",
            "1 tsp dried oregano leaves",
            "4-6 toothpicks"
        ],
        "instructions": [
            "Slit the bread horizontally, leaving it joined on one side.",
            "Spread the ketchup on the cut surfaces and then the mayonnaise.",
            "Arrange the lettuce in a layer. Arrange the salami, ham and cheese slices over this.",
            "Sprinkle the onions on top of this and then the oregano.",
            "Fold the other half of the bread over and secure with the toothpicks at intervals, and serve."
        ],
        "cook_time": "15 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Chicken Club Sandwich",
        "ingredients": [
            "6 white bread slices-edges cut off ",
            "butter to spread over the bread ",
            "Slices of cooked chicken ",
            "2 slices of large tomatoes ",
            "2 cheese slices ",
            "2 fried eggs ",
            "3-4 cabbage or lettuce leaves ",
            "2 tsp mustard ",
            "2 Tbsp mayonnaise sauce"
        ],
        "instructions": [
            "Toast the bread slices and butter on one side each. ",
            "Brush with mustard and a tablespoon of mayonnaise. ",
            "Place lettuce or cabbage leaves over a toast and cover with a slice of cheese and some cooked chicken. ",
            "Cover with another toast and cover with tomato slices. Place a fried egg over the tomato. Cover with another toast, buttered side down and secure together with tooth-picks. ",
            "Cut diagonally into half and serve with tomato sauce and mustard on the side. Make the other sandwich in the same way."
        ],
        "cook_time": "10 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Banana Split",
        "ingredients": [
            "1 oz square chocolate - semi-sweet ",
            "2 Tbsp light corn syrup ",
            "2 Tbsp condensed milk ",
            "1/8 tsp vanilla essence ",
            "1 Tbsp roasted peanuts - unsalted ",
            "1 banana - small and quartered"
        ],
        "instructions": [
            "Micro-cook the chocolate on Hi for 2 minutes, stirring once. ",
            "Also stir in corn syrup and sweetened condensed milk. ",
            "Micro-cook again uncovered on Hi for 30-45 seconds. ",
            "Stir in vanilla. ",
            "Serve warm atop ice cream and sprinkle some peanuts. Arrange the quartered banana around ice cream."
        ],
        "cook_time": "15 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Jerk Chicken",
        "ingredients": [
            "2 pieces chicken legs  ",
            "3-4 lime - halved  ",
            "1 tsp jerk seasoning powder (bottled)  ",
            "3 tsp jerk seasoning paste (bottled)  ",
            "Olive oil"
        ],
        "instructions": [
            "Wash the chicken with lime and water and drain and keep aside. ",
            "Sprinkle some seasoning powder over the chicken and rub the paste thoroughly. ",
            "Coat it with some olive oil. Do the same with the other piece. ",
            "Heat olive oil in a pan and lightly brown the chicken on both the sides. ",
            "Then grill it or bake it in an oven for about 15-20 minutes. ",
            "Serve hot with chilli sauce and jerk sauce."
        ],
        "cook_time": "30 mins",
        "cuisine": "american"
    },
    {
        "name": "Chocolate Cake in a Pressure Cooker",
        "ingredients": [
            "1 cup flour  ",
            "1/4 cup cocoa powder  ",
            "1 1/4 tsp baking powder",
            "1/4 cup butter",
            "3/4 cup caster sugar",
            "1/4 cup water  ",
            "2 eggs  ",
            "1/2 tsp vanilla essence",
            "1/8 tsp salt  ",
            "6 inch round greased baking tin"
        ],
        "instructions": [
            "In a mixing bowl, sift the flour, cocoa powder and baking powder. ",
            "Add in the butter, sugar, salt, water and vanilla, and beat the ingredients using a whisk.     ",
            "Add the eggs and beat the batter until smooth. ",
            "Transfer into the baking tin.    ",
            "Heat the pressure cooker, covered with the lid but without the pressure, for 3-4 minutes on high heat, then place the cake tin in the empty cooker (do not add water in the cooker).     ",
            "Close the lid (without the pressure), lower the flame and let it cook until done (about 30 minutes)."
        ],
        "cook_time": "1 Hour",
        "cuisine": "american"
    },
    {
        "name": "Honey Chilli Potatoes",
        "ingredients": [
            "For the potatoes:",
            "2 potatoes, peeled and sliced",
            "3-4 Tbsp cornflour or maida",
            "Salt to taste",
            "1 tsp red chilli powder",
            "Oil, for deep frying",
            "For the base:",
            "1 tsp oil",
            "2 spring onions (with stalk), sliced",
            "1 Tbsp garlic paste",
            "1 capsicum, sliced",
            "2 Tbsp honey",
            "Salt, to taste",
            "1/4 tsp soya sauce",
            "3 tsp white sesame seeds",
            "2 tsp chilli sauce"
        ],
        "instructions": [
            "For the potatoes:",
            "In a bowl, add cornflour or maida, salt and red chilli powder.",
            "Add the sliced potatoes and mix well until the potatoes are coated.",
            "Heat oil in a wok and deep fry the potatoes until golden. Keep aside.",
            "For the Base:",
            "In a wok, add oil, garlic paste and spring onions. Saute on high heat for 1 minute.",
            "Add capsicum, honey, salt, soya sauce, chilli sauce. Saute for 2-3 minutes.",
            "Add the deep-fried potatoes and sesame seeds. Mix well and serve hot."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Vegetable Momos",
        "ingredients": [
            "For Dough:",
            "2 cups maida",
            "1/2 tsp salt ",
            "1/2 tsp baking powder   ",
            "For Filling: ",
            "1 cup carrots - grated ",
            "1 cup cabbage - grated ",
            "1 Tbsp oil ",
            "1/2 cup onion - finely chopped ",
            "1 tsp garlic - chopped  ",
            "1 tsp Soya sauce ",
            "Salt ",
            "1/4 tsp vinegar ",
            "1/4 tsp black pepper"
        ],
        "instructions": [
            "Mix the maida, salt and baking powder and knead to a stiff dough with water. ",
            "Heat oil and add the onion and garlic. ",
            "Saute over high heat and add the carrot and cabbage. Turn around over high heat till glossy. ",
            "Take it off the heat and mix in the Soya sauce, salt, vinegar and black pepper. ",
            "Roll the dough thin (translucent) and cut into 4\"-5\" rounds. ",
            "Take a round, wet edges and place some filling in the center. ",
            "Bring edges together to cover the filling. Twist to seal and fill the rest in the same way. ",
            "Steam for about 10 minutes and serve with soya sauce and chilli sauce."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Chole Bhature",
        "ingredients": [
            "For chole:",
            "2 cup chickpeas (channas)",
            "2 tsp oil",
            "1 bay leaf (tej patta)",
            "1 stick cinnamon (dalchini)",
            "3-4 cloves (laung)",
            "1 tsp whole pepper corns (sabut kali mirch)",
            "3 green cardamom  (choti elaichi)",
            "2 black cardamom (badi elaichi)",
            "1 tsp turmeric powder (haldi)",
            "1 tsp chili powder (lal mirch powder)",
            "1 tsp coriander powder (dhaniya powder)",
            "1 tsp cumin powder (zeera powder)",
            "1 tsp cumin seeds (zeera)",
            "1/2 tsp asafoetida (heeng)",
            "Salt to taste",
            "1 cup onions (chopped)",
            "1 cup tomatoes (chopped)",
            "1 tsp ginger (chopped)",
            "1 tsp garlic (chopped)",
            "1 tsp ajwain",
            "1 tsp lime juice",
            "1 green chili (chopped)                      1 tea bag                                                1 Tbsp butter",
            "For the bhaturas:",
            "2 cups maida (refined flour)",
            "1/2 tsp yeast, dissolved for 10 minutes in luke warm water",
            "1/2 cup whole wheat flour",
            "A pinch of salt",
            "Water to knead",
            "Oil for frying"
        ],
        "instructions": [
            "For chole:",
            "In a pan add oil, bay leaf, cinnamon, cumin seeds, cloves, whole pepper corns, green and black cardamom.",
            "After it gets brown add chopped onions and saute it.",
            "After sauteing add chopped ginger and garlic.",
            "Then add turmeric, chili powder, coriander powder, cumin powder, asafoetida, salt and fry well.",
            "For de glazing the pan add little water.",
            "Now add the chole (soaked overnight and pressure cooked) to the masala.",
            "After stirring well add tomatoes, little sugar and salt to the chole (chickpeas)",
            "Now add ajwain, chopped green chilies and water for the base.",
            "To get the color in the chole, add a tea bag to the masala.",
            "Simmer the chole gently for an hour and cover it.",
            "Add lime juice and a dollop of butter to it.",
            "Garnish the chole with coriander and butter.",
            "Serve the chole hot with bhaturas.",
            "For the bhaturas:",
            "Knead the whole wheat flour, maida and salt together with adequate amount of water.",
            "Sprinkle the yeast on top. Leave it for 2-3 hours for the yeast to work.",
            "Divide it into equal portions. Roll out in an oval or round shape.",
            "Deep fry till golden brown, like a puri.",
            "Serve. "
        ],
        "cook_time": "1 Hour",
        "cuisine": "american"
    },
    {
        "name": "Quick Chicken Curry",
        "ingredients": [
            "1 kg chicken",
            "3 large onions, paste",
            "2 large tomatoes, pureed",
            "1 Tbsp garlic paste",
            "1 Tbsp ginger paste",
            "2 tsp coriander powder",
            "2 tsp cumin powder",
            "1/2 tsp turmeric powder",
            "1/2 tsp red chilli powder",
            "1 tsp garam masala powder",
            "2 Tbsp oil",
            "Salt to taste",
            "Chopped coriander for garnish"
        ],
        "instructions": [
            "Heat oil in a pan and sauté the onion paste, garlic & ginger paste till golden brown.",
            "Add tomato puree. When the tomato puree dries up, add coriander powder, cumin powder, garam masala, red chilli powder, turmeric powder and salt. Let the spices cook.",
            "Add chicken pieces into the masala. Stir well and cook till they are golden brown.",
            "Add 1/2 cup of water and stir. Cover with a lid and let it simmer till the chicken is cooked.",
            "Garnish with chopped coriander and serve."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "american"
    },
    {
        "name": "Butter Chicken",
        "ingredients": [
            "700 gm raw chicken  ",
            "For theMarinade:",
            "1 tsp red chilli powder ",
            "1 tsp ginger and garlic paste ",
            "Salt to taste ",
            "1/2 kg curd  ",
            "For theGravy:",
            "175 gm white butter ",
            "1/2 tsp black cumin seeds ",
            "1/2 kg tomato, pureed ",
            "1/2 tsp sugar ",
            "1 tsp red chilli powder ",
            "Salt to taste ",
            "100 gm fresh cream ",
            "4 green chillies, sliced",
            "1/2 tsp fenugreek leaves, crushed"
        ],
        "instructions": [
            "For marinating the chicken",
            "In a mixing bowl, mix red chilli powder, ginger garlic paste, salt and curd.  ",
            "Add the raw chicken pieces to the marinade and mix well. Keep it in the refrigerator overnight or minimum 6 hours.  ",
            "Roast the marinated chicken in a tandoor or an oven for about 10-12 minutes until it is three-fourth done.  ",
            "For the chicken gravy",
            "Heat half the quantity of white butter in pan. ",
            "Pour in the tomato puree, and saute for 2-3 minutes. Add cumin seeds, sugar, red chilli powder and salt. Mix well.  ",
            "Add the prepared chicken, white butter, fresh cream, sliced green chillies and crushed fenugreek leaves.  Saute for 3-4 minutes and let the chicken cook.",
            "Cook till chicken is done. Serve hot with rice or naan."
        ],
        "cook_time": "30 Minutes + Marination time (overnight)",
        "cuisine": "american"
    }
]