[
    {
        "name": "Baileys Delight",
        "ingredients": [
            "1/2 cup Bailey's",
            "1/2 cup milk",
            "1 cinnamon stick",
            "4-5 cardamoms",
            "1 Tbsp grated dark chocolate"
        ],
        "instructions": [
            "Heat milk in a saucepan along with cinnamon and cardamons to develop flavour.",
            "Pour Bailey's in a tall glass and add the flavoured milk to it. Mix well using a fork.",
            "Finish with grated chocolate on top."
        ],
        "cook_time": "15 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Irish Coffee",
        "ingredients": [
            "50 ml unsweetened, cold whipping cream",
            "2 tbsp soft brown sugar",
            "50 ml Irish whisky",
            "1 cup freshly brewed coffee",
            "Nutmeg to sprinkle (optional)"
        ],
        "instructions": [
            "Fill a tall glass (traditionally with a stem) with hot boiling water, leave to stand and then pour away the water.",
            "Whip the cream until the bubbles disappear and it has just started to thicken and form ribbons underneath the whisk. Put back in the refrigerator.",
            "Dissolve the sugar in 2 tablespoons of hot water in a small pan and bring to a boil. Add some freshly brewed rich coffee and stir. Then remove from heat and stir in the whisky.",
            "Pour the mixture of whisky, sugar and coffee into the bottom of the pre-heated glass. Take the cold cream out of the fridge, whisk once again, then pour it on over the back of a spoon (to prevent it from sinking) until you hit the rim of the glass.",
            "Grate a little nutmeg over the top and serve immediately."
        ],
        "cook_time": "20 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Orange and Ginger Detox Drink",
        "ingredients": [
            "1 large carrot",
            "2 oranges",
            "1/2 inch raw turmeric, crushed",
            "1/2 inch ginger, crushed ",
            "1/2 lemon juice"
        ],
        "instructions": [
            "Juice the orange and carrot separately. ",
            "Pour the juice in a blender add turmeric and ginger. ",
            "Blend for 30 seconds and then squeeze half lemon. ",
            "Strain and serve. "
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Sol of Colaba",
        "ingredients": [
            "60 ml vodka ",
            "30 ml lime juice",
            "30 ml sugar syrup",
            "For Masala Mix:",
            "1 tsp jaljeera powder",
            "1 tsp amchoor",
            "1/2 tsp white pepper",
            "2-3 pieces kokum ",
            ""
        ],
        "instructions": [
            "Infuse kokum in little hot water and extract juice. ",
            "Cool and add along with lime juice, sugar syrup, masala mix (1 gram or a pinch), vodka and ice cubes in a cocktail shaker and shake well. ",
            "Serve chilled in martini glass.​"
        ],
        "cook_time": "10 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Hibiscus Sherbet",
        "ingredients": [
            "3-4 dried hibiscus",
            "2 cups of boiling water",
            "250 gms basil seeds",
            "2 tbsp sugar",
            "1 tsp rose water",
            "6-7 ice cubes"
        ],
        "instructions": [
            "Pour boiling water in a bowl of hibiscus.",
            "Add boiling water in a bowl full of basil seeds.",
            "Allow release of flavors.",
            "Add bloomed basil seeds, sugar & rose water to the hibiscus water & mix well.",
            "Pour the blend in a glass filled with ice cubes.",
            "Serve cold."
        ],
        "cook_time": "15 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Kiwi Margarita",
        "ingredients": [
            "60ml of tequila",
            "15 ml of orange liquor",
            "15 ml of lime juice ",
            "10 ml of sugar syrup ",
            "2 Tbsp of fresh kiwi pulp "
        ],
        "instructions": [
            "Blend the ingredients together and serve in a salt rimmed Margarita glass"
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Orange Slushie",
        "ingredients": [
            "500 ml orange juice",
            "1 medium size ginger",
            "1 tsp sugar",
            "8-10 mint leaves",
            "1 orange",
            "6-7 ice cubes"
        ],
        "instructions": [
            "Blend together orange juice, chopped ginger, sugar, mint leaves & ice cubes.",
            "Add orange slices and mint leaves to a glass.",
            "Pour the slushie into the glass, serve."
        ],
        "cook_time": "15 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Litchi Sorbet",
        "ingredients": [
            "Ingredients:",
            "500g of fresh litchi",
            "100g  of caster sugar",
            "1 1/2 cups of water",
            "1/2 lime for lime juice"
        ],
        "instructions": [
            "Put the litchi in a pan with the water and sugar, and bring to a boil. Mix well, making sure the sugar has dissolved fully. Then allow it to cool.",
            "When the compote has cooled, deseed the litchis and keep aside the syrup.",
            "Mix the litchi flesh with the sugar syrup and blend in the lime juice. Chuck them into the food processor and blitz until everything is chopped and of even consistency. Then if you like, press everything through a sieve for extra smoothness.",
            "Freeze the mixture until solid.",
            "Once solid, smash up the sorbet and churn again for 5-10 minutes. Freeze overnight and then serve.",
            "Note: You may if you like, add a dash of vodka, for an alcohol-laced sorbet."
        ],
        "cook_time": "30 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Lychee and Dill Juice",
        "ingredients": [
            "250 gm lychees",
            "1 lime, juiced",
            "A few sprigs of dill",
            "4-5 ice cubes"
        ],
        "instructions": [
            "Peel and deseed the lychees. Place them in a blender along with the remaining ingredients and blend for a few seconds.",
            "Strain into a glass, top up with ice cubes and garnish with a sprig of dill."
        ],
        "cook_time": "5 mintues",
        "cuisine": "beverages"
    },
    {
        "name": "Orange and Basil Juice",
        "ingredients": [
            "2 oranges",
            "6 basil leaves, fresh",
            "A drizzle of honey, optional",
            "4-5 ice cubes"
        ],
        "instructions": [
            "Peal the oranges and place them in the blender along with the other ingredients.",
            "Blend for a few seconds and then strain into a glass. Garnish with a few basil leaves and serve."
        ],
        "cook_time": "5 mintues",
        "cuisine": "beverages"
    },
    {
        "name": "Almond Milk Thandai",
        "ingredients": [
            "For the powder mix:",
            "1/2  tsp of cardamom powder or 2-3 green cardamom (elaichi)",
            "2 tsp of poppy seeds (khus khus)",
            "1 tsp of fennel seeds (saunf)",
            "5-6 black peppercorns (kali mirch)",
            "3/4 tsp saffron (kesar) - optional",
            "1 tsp roasted watermelon seeds or sunflower seeds ",
            "A pinch of nutmeg - optional",
            "For the drink:",
            "4 cups of almond milk ",
            "Seedless Dates/Raw Sugar/Palm Sugar to taste",
            "For garnishing:",
            "Chopped Pistachios",
            "Silver Leaves",
            "Pinch of Saffron",
            ""
        ],
        "instructions": [
            "Take all the ingredients in a grinder and grind really fine . ",
            "Note : For a larger batch of the spice mix, dry grind and keep in an airtight container, refrigerated for a few days. You can also alter the quantities to suit your personal taste and  preference. ",
            "Boil the milk with whichever sugar you are using and few strands of saffron (if using).",
            "Add the ground powder and mix it well.Add more water if needed to get the desired consistency.",
            "Strain the mixture to remove any particles to make a smooth Milk.",
            "Cool and let it refrigerate for a minimum of one hour or even overnight to let the spices infuse in the drink.",
            "Give it a mix before serving. Garnish and serve. If you have rose water or dried crushed rose petals, add some to taste."
        ],
        "cook_time": "1 Hour",
        "cuisine": "beverages"
    },
    {
        "name": "Fresh Raw Badam Milk",
        "ingredients": [
            "Ingredients :",
            "1 cup organic raw almonds soaked for 8-12 hours",
            "4 cups of purified water"
        ],
        "instructions": [
            "Place the raw almonds in a glass bowl or large jar, and cover with filtered water for 8 hours or more. Cover with lid.",
            "Rinse the nuts several times to remove any of the anti-nutrients and enzyme inhibitors. If soaking for more than 8 hours, make sure you rinse and soak a few times. ",
            "Pour boiling water over the almonds and let them sit for five minutes. Drain. Skins should peel off easily.",
            "Put almonds and water in a powerful blender and start blending at low speed. Blend them with less water for 1 - 2 minutes in the beginning, so they become a really smooth paste.",
            "Add the remaining water. Blend everything together for another 2-3 minutes, until it is completely smooth and frothy. ",
            "Use a fine mesh strainer or place 3 or 4 layers of fine mesh cloth over a metal strainer set over a bowl,jar or jug. Pour small amounts of the almond milk through the strainer into the bowl. Use a spoon or spatula to press down on the strainer and move the solids around.",
            "Once most of the milk has passed through the strainer, gather up the mesh cloth and gently squeeze it to remove excess liquid. ",
            "You'll be left with really fine almond meal inside the mesh cloth. You can discard it, or you can dry it out in a very low oven and use it in place of almond flour in baking recipes!"
        ],
        "cook_time": "30 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Sol Kadi (Konkani Kokum Drink)",
        "ingredients": [
            "6- 8 kokum or aamsol",
            "1 cup of fresh grated coconut",
            "1 cup of hot water  ",
            "2 cloves garlic or 1 tsp of ginger",
            "1 - 2  green chillies",
            "A pinch of asafoetida (heeng)",
            "Rock Salt to taste",
            "Coriander leaves for garnish"
        ],
        "instructions": [
            "Soak the kokum in about 3/4th cup water adding the heeng and salt. Keep aside for 3 - 4 hours.",
            "Grind the grated coconut, garlic and chillies together with little water in a blender or mixer. When it grinds to a thick paste like texture, squeeze the 'milk' out of the paste and keep aside.",
            "Add another 3/4th cup of water to the dry remains and run the mixer again for a minute or so. Again extract the milk - adding to the original extract.",
            "Repeat this process two to three times till basically all the 'milk' gets extracted from the coconut .",
            "NOTE :This process can be repeated a couple of times, but bear in mind that the milk gets thinner with every consecutive extraction.",
            "Discard the kokum from the water, add the coconut milk mixture into the kokum water, mix well to get a creamy pink coloured solkadhi.",
            "Taste it and adjust seasoning as required.",
            "Keep aside for an hour or more .",
            "NOTE: It is important to let the Solkadhi rest  for at least an hour before you consume it.",
            "Garnish with fresh coriander leaves and serve chilled.",
            "Chef's Tip : And remember to stir the Kadhi every time you serve it - the coconut extract tends to rise to the top when the kadhi is left untouched for a bit!"
        ],
        "cook_time": "15 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Old Fashioned",
        "ingredients": [
            "Ingredients",
            "60 ml of bourbon Whiskey",
            "1 sugar cube",
            "3 drops of angostura bitters",
            "4-5 cubes of ice",
            "3 orange peels"
        ],
        "instructions": [
            "Muddle the orange peels, sugar and Angostura bitters together.",
            "Then add 3-4 cubes of ice, Bourbon whiskey and drink up."
        ],
        "cook_time": "15 minutes ",
        "cuisine": "beverages"
    },
    {
        "name": "Moscow Mule",
        "ingredients": [
            "Ingredients",
            "45 ml of vodka",
            "15 ml of lime juice",
            "30 ml of ginger lime cordial",
            "2 wedges of lime",
            "7Up/Sprite & soda to top"
        ],
        "instructions": [
            "Pour vodka, lime juice, ginger lime cordial in a copper mug full of ice.",
            "Top it off with half soda, half 7 up or sprite.",
            "Stir and garnish with a cucumber stick and fresh mint."
        ],
        "cook_time": "10 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Chilled Darjeeling First Flush with Mango & Mint",
        "ingredients": [
            "Ingredients:",
            "8 tsp of darjeeling first flush tea",
            "4 cups of water",
            "4 tsp of honey",
            "1 lime for lime juice and zest ",
            "Mango (preferably ripe Alphonso mango, peeled and sliced)",
            "8 fresh mint leaves"
        ],
        "instructions": [
            "Bring water to a boil, and then remove from fire to cool.",
            "Then add the tea leaves to a large pot and allow to steep for 4-5 minutes.",
            "Strain tea into a clean jug and keep in the deep freezer.",
            "Add honey, lime juice and zest from 1 lime to the tea.",
            "Add iced water (sans the ice) to the tea to make enough for 4 glasses and also to dilute the tea which would otherwise be very intensely flavoured.",
            "Add mangoes and mint to the chilled tea and serve in tall glasses."
        ],
        "cook_time": "15 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Mango and Peach White Iced Tea",
        "ingredients": [
            "10 glasses of purified water",
            "5-6 of white tea bags",
            "2 peaches (pitted and diced)",
            "1 cup of mango (chopped)",
            "1 tbsp honey (optional)"
        ],
        "instructions": [
            "Boil water in a large saucepan, and remove from heat.",
            "Steep the white tea bags for about 7 minutes, then transfer tea to a large mixing bowl. Allow the tea to cool down for 30 minutes approximately.",
            "Mix chopped peaches, mango, and 1 tbsp of honey (to taste) in a smaller mixing bowl.",
            "Then transfer the fruits to a large pitcher, and pour the cooled tea into the pitcher.",
            "Stir to combine, chill in the refrigerator and serve over ice."
        ],
        "cook_time": "30 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Medusa",
        "ingredients": [
            "Ingredients:",
            "60 ml of vodka",
            "20 ml of lime juice",
            "4 slices of fresh cucumber     90 ml of apple Juice",
            "3 sprig of fennel            4 sprig of coriander leaves   "
        ],
        "instructions": [
            "Shake vodka, lime juice and apple juice. ",
            "The add cucumber, fennel and garnish with fresh coriander leaves.",
            "Serve chilled in a ceramic stone glass, if available."
        ],
        "cook_time": "10 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Chocolate Cake in a Pressure Cooker",
        "ingredients": [
            "1 cup flour  ",
            "1/4 cup cocoa powder  ",
            "1 1/4 tsp baking powder",
            "1/4 cup butter",
            "3/4 cup caster sugar",
            "1/4 cup water  ",
            "2 eggs  ",
            "1/2 tsp vanilla essence",
            "1/8 tsp salt  ",
            "6 inch round greased baking tin"
        ],
        "instructions": [
            "In a mixing bowl, sift the flour, cocoa powder and baking powder. ",
            "Add in the butter, sugar, salt, water and vanilla, and beat the ingredients using a whisk.     ",
            "Add the eggs and beat the batter until smooth. ",
            "Transfer into the baking tin.    ",
            "Heat the pressure cooker, covered with the lid but without the pressure, for 3-4 minutes on high heat, then place the cake tin in the empty cooker (do not add water in the cooker).     ",
            "Close the lid (without the pressure), lower the flame and let it cook until done (about 30 minutes)."
        ],
        "cook_time": "1 Hour",
        "cuisine": "beverages"
    },
    {
        "name": "Honey Chilli Potatoes",
        "ingredients": [
            "For the potatoes:",
            "2 potatoes, peeled and sliced",
            "3-4 Tbsp cornflour or maida",
            "Salt to taste",
            "1 tsp red chilli powder",
            "Oil, for deep frying",
            "For the base:",
            "1 tsp oil",
            "2 spring onions (with stalk), sliced",
            "1 Tbsp garlic paste",
            "1 capsicum, sliced",
            "2 Tbsp honey",
            "Salt, to taste",
            "1/4 tsp soya sauce",
            "3 tsp white sesame seeds",
            "2 tsp chilli sauce"
        ],
        "instructions": [
            "For the potatoes:",
            "In a bowl, add cornflour or maida, salt and red chilli powder.",
            "Add the sliced potatoes and mix well until the potatoes are coated.",
            "Heat oil in a wok and deep fry the potatoes until golden. Keep aside.",
            "For the Base:",
            "In a wok, add oil, garlic paste and spring onions. Saute on high heat for 1 minute.",
            "Add capsicum, honey, salt, soya sauce, chilli sauce. Saute for 2-3 minutes.",
            "Add the deep-fried potatoes and sesame seeds. Mix well and serve hot."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Vegetable Momos",
        "ingredients": [
            "For Dough:",
            "2 cups maida",
            "1/2 tsp salt ",
            "1/2 tsp baking powder   ",
            "For Filling: ",
            "1 cup carrots - grated ",
            "1 cup cabbage - grated ",
            "1 Tbsp oil ",
            "1/2 cup onion - finely chopped ",
            "1 tsp garlic - chopped  ",
            "1 tsp Soya sauce ",
            "Salt ",
            "1/4 tsp vinegar ",
            "1/4 tsp black pepper"
        ],
        "instructions": [
            "Mix the maida, salt and baking powder and knead to a stiff dough with water. ",
            "Heat oil and add the onion and garlic. ",
            "Saute over high heat and add the carrot and cabbage. Turn around over high heat till glossy. ",
            "Take it off the heat and mix in the Soya sauce, salt, vinegar and black pepper. ",
            "Roll the dough thin (translucent) and cut into 4\"-5\" rounds. ",
            "Take a round, wet edges and place some filling in the center. ",
            "Bring edges together to cover the filling. Twist to seal and fill the rest in the same way. ",
            "Steam for about 10 minutes and serve with soya sauce and chilli sauce."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Chole Bhature",
        "ingredients": [
            "For chole:",
            "2 cup chickpeas (channas)",
            "2 tsp oil",
            "1 bay leaf (tej patta)",
            "1 stick cinnamon (dalchini)",
            "3-4 cloves (laung)",
            "1 tsp whole pepper corns (sabut kali mirch)",
            "3 green cardamom  (choti elaichi)",
            "2 black cardamom (badi elaichi)",
            "1 tsp turmeric powder (haldi)",
            "1 tsp chili powder (lal mirch powder)",
            "1 tsp coriander powder (dhaniya powder)",
            "1 tsp cumin powder (zeera powder)",
            "1 tsp cumin seeds (zeera)",
            "1/2 tsp asafoetida (heeng)",
            "Salt to taste",
            "1 cup onions (chopped)",
            "1 cup tomatoes (chopped)",
            "1 tsp ginger (chopped)",
            "1 tsp garlic (chopped)",
            "1 tsp ajwain",
            "1 tsp lime juice",
            "1 green chili (chopped)                      1 tea bag                                                1 Tbsp butter",
            "For the bhaturas:",
            "2 cups maida (refined flour)",
            "1/2 tsp yeast, dissolved for 10 minutes in luke warm water",
            "1/2 cup whole wheat flour",
            "A pinch of salt",
            "Water to knead",
            "Oil for frying"
        ],
        "instructions": [
            "For chole:",
            "In a pan add oil, bay leaf, cinnamon, cumin seeds, cloves, whole pepper corns, green and black cardamom.",
            "After it gets brown add chopped onions and saute it.",
            "After sauteing add chopped ginger and garlic.",
            "Then add turmeric, chili powder, coriander powder, cumin powder, asafoetida, salt and fry well.",
            "For de glazing the pan add little water.",
            "Now add the chole (soaked overnight and pressure cooked) to the masala.",
            "After stirring well add tomatoes, little sugar and salt to the chole (chickpeas)",
            "Now add ajwain, chopped green chilies and water for the base.",
            "To get the color in the chole, add a tea bag to the masala.",
            "Simmer the chole gently for an hour and cover it.",
            "Add lime juice and a dollop of butter to it.",
            "Garnish the chole with coriander and butter.",
            "Serve the chole hot with bhaturas.",
            "For the bhaturas:",
            "Knead the whole wheat flour, maida and salt together with adequate amount of water.",
            "Sprinkle the yeast on top. Leave it for 2-3 hours for the yeast to work.",
            "Divide it into equal portions. Roll out in an oval or round shape.",
            "Deep fry till golden brown, like a puri.",
            "Serve. "
        ],
        "cook_time": "1 Hour",
        "cuisine": "beverages"
    },
    {
        "name": "Quick Chicken Curry",
        "ingredients": [
            "1 kg chicken",
            "3 large onions, paste",
            "2 large tomatoes, pureed",
            "1 Tbsp garlic paste",
            "1 Tbsp ginger paste",
            "2 tsp coriander powder",
            "2 tsp cumin powder",
            "1/2 tsp turmeric powder",
            "1/2 tsp red chilli powder",
            "1 tsp garam masala powder",
            "2 Tbsp oil",
            "Salt to taste",
            "Chopped coriander for garnish"
        ],
        "instructions": [
            "Heat oil in a pan and sauté the onion paste, garlic & ginger paste till golden brown.",
            "Add tomato puree. When the tomato puree dries up, add coriander powder, cumin powder, garam masala, red chilli powder, turmeric powder and salt. Let the spices cook.",
            "Add chicken pieces into the masala. Stir well and cook till they are golden brown.",
            "Add 1/2 cup of water and stir. Cover with a lid and let it simmer till the chicken is cooked.",
            "Garnish with chopped coriander and serve."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Butter Chicken",
        "ingredients": [
            "700 gm raw chicken  ",
            "For theMarinade:",
            "1 tsp red chilli powder ",
            "1 tsp ginger and garlic paste ",
            "Salt to taste ",
            "1/2 kg curd  ",
            "For theGravy:",
            "175 gm white butter ",
            "1/2 tsp black cumin seeds ",
            "1/2 kg tomato, pureed ",
            "1/2 tsp sugar ",
            "1 tsp red chilli powder ",
            "Salt to taste ",
            "100 gm fresh cream ",
            "4 green chillies, sliced",
            "1/2 tsp fenugreek leaves, crushed"
        ],
        "instructions": [
            "For marinating the chicken",
            "In a mixing bowl, mix red chilli powder, ginger garlic paste, salt and curd.  ",
            "Add the raw chicken pieces to the marinade and mix well. Keep it in the refrigerator overnight or minimum 6 hours.  ",
            "Roast the marinated chicken in a tandoor or an oven for about 10-12 minutes until it is three-fourth done.  ",
            "For the chicken gravy",
            "Heat half the quantity of white butter in pan. ",
            "Pour in the tomato puree, and saute for 2-3 minutes. Add cumin seeds, sugar, red chilli powder and salt. Mix well.  ",
            "Add the prepared chicken, white butter, fresh cream, sliced green chillies and crushed fenugreek leaves.  Saute for 3-4 minutes and let the chicken cook.",
            "Cook till chicken is done. Serve hot with rice or naan."
        ],
        "cook_time": "30 Minutes + Marination time (overnight)",
        "cuisine": "beverages"
    },
    {
        "name": "Baileys Delight",
        "ingredients": [
            "1/2 cup Bailey's",
            "1/2 cup milk",
            "1 cinnamon stick",
            "4-5 cardamoms",
            "1 Tbsp grated dark chocolate"
        ],
        "instructions": [
            "Heat milk in a saucepan along with cinnamon and cardamons to develop flavour.",
            "Pour Bailey's in a tall glass and add the flavoured milk to it. Mix well using a fork.",
            "Finish with grated chocolate on top."
        ],
        "cook_time": "15 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Irish Coffee",
        "ingredients": [
            "50 ml unsweetened, cold whipping cream",
            "2 tbsp soft brown sugar",
            "50 ml Irish whisky",
            "1 cup freshly brewed coffee",
            "Nutmeg to sprinkle (optional)"
        ],
        "instructions": [
            "Fill a tall glass (traditionally with a stem) with hot boiling water, leave to stand and then pour away the water.",
            "Whip the cream until the bubbles disappear and it has just started to thicken and form ribbons underneath the whisk. Put back in the refrigerator.",
            "Dissolve the sugar in 2 tablespoons of hot water in a small pan and bring to a boil. Add some freshly brewed rich coffee and stir. Then remove from heat and stir in the whisky.",
            "Pour the mixture of whisky, sugar and coffee into the bottom of the pre-heated glass. Take the cold cream out of the fridge, whisk once again, then pour it on over the back of a spoon (to prevent it from sinking) until you hit the rim of the glass.",
            "Grate a little nutmeg over the top and serve immediately."
        ],
        "cook_time": "20 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Orange and Ginger Detox Drink",
        "ingredients": [
            "1 large carrot",
            "2 oranges",
            "1/2 inch raw turmeric, crushed",
            "1/2 inch ginger, crushed ",
            "1/2 lemon juice"
        ],
        "instructions": [
            "Juice the orange and carrot separately. ",
            "Pour the juice in a blender add turmeric and ginger. ",
            "Blend for 30 seconds and then squeeze half lemon. ",
            "Strain and serve. "
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Sol of Colaba",
        "ingredients": [
            "60 ml vodka ",
            "30 ml lime juice",
            "30 ml sugar syrup",
            "For Masala Mix:",
            "1 tsp jaljeera powder",
            "1 tsp amchoor",
            "1/2 tsp white pepper",
            "2-3 pieces kokum ",
            ""
        ],
        "instructions": [
            "Infuse kokum in little hot water and extract juice. ",
            "Cool and add along with lime juice, sugar syrup, masala mix (1 gram or a pinch), vodka and ice cubes in a cocktail shaker and shake well. ",
            "Serve chilled in martini glass.​"
        ],
        "cook_time": "10 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Hibiscus Sherbet",
        "ingredients": [
            "3-4 dried hibiscus",
            "2 cups of boiling water",
            "250 gms basil seeds",
            "2 tbsp sugar",
            "1 tsp rose water",
            "6-7 ice cubes"
        ],
        "instructions": [
            "Pour boiling water in a bowl of hibiscus.",
            "Add boiling water in a bowl full of basil seeds.",
            "Allow release of flavors.",
            "Add bloomed basil seeds, sugar & rose water to the hibiscus water & mix well.",
            "Pour the blend in a glass filled with ice cubes.",
            "Serve cold."
        ],
        "cook_time": "15 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Kiwi Margarita",
        "ingredients": [
            "60ml of tequila",
            "15 ml of orange liquor",
            "15 ml of lime juice ",
            "10 ml of sugar syrup ",
            "2 Tbsp of fresh kiwi pulp "
        ],
        "instructions": [
            "Blend the ingredients together and serve in a salt rimmed Margarita glass"
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Orange Slushie",
        "ingredients": [
            "500 ml orange juice",
            "1 medium size ginger",
            "1 tsp sugar",
            "8-10 mint leaves",
            "1 orange",
            "6-7 ice cubes"
        ],
        "instructions": [
            "Blend together orange juice, chopped ginger, sugar, mint leaves & ice cubes.",
            "Add orange slices and mint leaves to a glass.",
            "Pour the slushie into the glass, serve."
        ],
        "cook_time": "15 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Litchi Sorbet",
        "ingredients": [
            "Ingredients:",
            "500g of fresh litchi",
            "100g  of caster sugar",
            "1 1/2 cups of water",
            "1/2 lime for lime juice"
        ],
        "instructions": [
            "Put the litchi in a pan with the water and sugar, and bring to a boil. Mix well, making sure the sugar has dissolved fully. Then allow it to cool.",
            "When the compote has cooled, deseed the litchis and keep aside the syrup.",
            "Mix the litchi flesh with the sugar syrup and blend in the lime juice. Chuck them into the food processor and blitz until everything is chopped and of even consistency. Then if you like, press everything through a sieve for extra smoothness.",
            "Freeze the mixture until solid.",
            "Once solid, smash up the sorbet and churn again for 5-10 minutes. Freeze overnight and then serve.",
            "Note: You may if you like, add a dash of vodka, for an alcohol-laced sorbet."
        ],
        "cook_time": "30 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Lychee and Dill Juice",
        "ingredients": [
            "250 gm lychees",
            "1 lime, juiced",
            "A few sprigs of dill",
            "4-5 ice cubes"
        ],
        "instructions": [
            "Peel and deseed the lychees. Place them in a blender along with the remaining ingredients and blend for a few seconds.",
            "Strain into a glass, top up with ice cubes and garnish with a sprig of dill."
        ],
        "cook_time": "5 mintues",
        "cuisine": "beverages"
    },
    {
        "name": "Orange and Basil Juice",
        "ingredients": [
            "2 oranges",
            "6 basil leaves, fresh",
            "A drizzle of honey, optional",
            "4-5 ice cubes"
        ],
        "instructions": [
            "Peal the oranges and place them in the blender along with the other ingredients.",
            "Blend for a few seconds and then strain into a glass. Garnish with a few basil leaves and serve."
        ],
        "cook_time": "5 mintues",
        "cuisine": "beverages"
    },
    {
        "name": "Chocolate Cake in a Pressure Cooker",
        "ingredients": [
            "1 cup flour  ",
            "1/4 cup cocoa powder  ",
            "1 1/4 tsp baking powder",
            "1/4 cup butter",
            "3/4 cup caster sugar",
            "1/4 cup water  ",
            "2 eggs  ",
            "1/2 tsp vanilla essence",
            "1/8 tsp salt  ",
            "6 inch round greased baking tin"
        ],
        "instructions": [
            "In a mixing bowl, sift the flour, cocoa powder and baking powder. ",
            "Add in the butter, sugar, salt, water and vanilla, and beat the ingredients using a whisk.     ",
            "Add the eggs and beat the batter until smooth. ",
            "Transfer into the baking tin.    ",
            "Heat the pressure cooker, covered with the lid but without the pressure, for 3-4 minutes on high heat, then place the cake tin in the empty cooker (do not add water in the cooker).     ",
            "Close the lid (without the pressure), lower the flame and let it cook until done (about 30 minutes)."
        ],
        "cook_time": "1 Hour",
        "cuisine": "beverages"
    },
    {
        "name": "Honey Chilli Potatoes",
        "ingredients": [
            "For the potatoes:",
            "2 potatoes, peeled and sliced",
            "3-4 Tbsp cornflour or maida",
            "Salt to taste",
            "1 tsp red chilli powder",
            "Oil, for deep frying",
            "For the base:",
            "1 tsp oil",
            "2 spring onions (with stalk), sliced",
            "1 Tbsp garlic paste",
            "1 capsicum, sliced",
            "2 Tbsp honey",
            "Salt, to taste",
            "1/4 tsp soya sauce",
            "3 tsp white sesame seeds",
            "2 tsp chilli sauce"
        ],
        "instructions": [
            "For the potatoes:",
            "In a bowl, add cornflour or maida, salt and red chilli powder.",
            "Add the sliced potatoes and mix well until the potatoes are coated.",
            "Heat oil in a wok and deep fry the potatoes until golden. Keep aside.",
            "For the Base:",
            "In a wok, add oil, garlic paste and spring onions. Saute on high heat for 1 minute.",
            "Add capsicum, honey, salt, soya sauce, chilli sauce. Saute for 2-3 minutes.",
            "Add the deep-fried potatoes and sesame seeds. Mix well and serve hot."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Vegetable Momos",
        "ingredients": [
            "For Dough:",
            "2 cups maida",
            "1/2 tsp salt ",
            "1/2 tsp baking powder   ",
            "For Filling: ",
            "1 cup carrots - grated ",
            "1 cup cabbage - grated ",
            "1 Tbsp oil ",
            "1/2 cup onion - finely chopped ",
            "1 tsp garlic - chopped  ",
            "1 tsp Soya sauce ",
            "Salt ",
            "1/4 tsp vinegar ",
            "1/4 tsp black pepper"
        ],
        "instructions": [
            "Mix the maida, salt and baking powder and knead to a stiff dough with water. ",
            "Heat oil and add the onion and garlic. ",
            "Saute over high heat and add the carrot and cabbage. Turn around over high heat till glossy. ",
            "Take it off the heat and mix in the Soya sauce, salt, vinegar and black pepper. ",
            "Roll the dough thin (translucent) and cut into 4\"-5\" rounds. ",
            "Take a round, wet edges and place some filling in the center. ",
            "Bring edges together to cover the filling. Twist to seal and fill the rest in the same way. ",
            "Steam for about 10 minutes and serve with soya sauce and chilli sauce."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Chole Bhature",
        "ingredients": [
            "For chole:",
            "2 cup chickpeas (channas)",
            "2 tsp oil",
            "1 bay leaf (tej patta)",
            "1 stick cinnamon (dalchini)",
            "3-4 cloves (laung)",
            "1 tsp whole pepper corns (sabut kali mirch)",
            "3 green cardamom  (choti elaichi)",
            "2 black cardamom (badi elaichi)",
            "1 tsp turmeric powder (haldi)",
            "1 tsp chili powder (lal mirch powder)",
            "1 tsp coriander powder (dhaniya powder)",
            "1 tsp cumin powder (zeera powder)",
            "1 tsp cumin seeds (zeera)",
            "1/2 tsp asafoetida (heeng)",
            "Salt to taste",
            "1 cup onions (chopped)",
            "1 cup tomatoes (chopped)",
            "1 tsp ginger (chopped)",
            "1 tsp garlic (chopped)",
            "1 tsp ajwain",
            "1 tsp lime juice",
            "1 green chili (chopped)                      1 tea bag                                                1 Tbsp butter",
            "For the bhaturas:",
            "2 cups maida (refined flour)",
            "1/2 tsp yeast, dissolved for 10 minutes in luke warm water",
            "1/2 cup whole wheat flour",
            "A pinch of salt",
            "Water to knead",
            "Oil for frying"
        ],
        "instructions": [
            "For chole:",
            "In a pan add oil, bay leaf, cinnamon, cumin seeds, cloves, whole pepper corns, green and black cardamom.",
            "After it gets brown add chopped onions and saute it.",
            "After sauteing add chopped ginger and garlic.",
            "Then add turmeric, chili powder, coriander powder, cumin powder, asafoetida, salt and fry well.",
            "For de glazing the pan add little water.",
            "Now add the chole (soaked overnight and pressure cooked) to the masala.",
            "After stirring well add tomatoes, little sugar and salt to the chole (chickpeas)",
            "Now add ajwain, chopped green chilies and water for the base.",
            "To get the color in the chole, add a tea bag to the masala.",
            "Simmer the chole gently for an hour and cover it.",
            "Add lime juice and a dollop of butter to it.",
            "Garnish the chole with coriander and butter.",
            "Serve the chole hot with bhaturas.",
            "For the bhaturas:",
            "Knead the whole wheat flour, maida and salt together with adequate amount of water.",
            "Sprinkle the yeast on top. Leave it for 2-3 hours for the yeast to work.",
            "Divide it into equal portions. Roll out in an oval or round shape.",
            "Deep fry till golden brown, like a puri.",
            "Serve. "
        ],
        "cook_time": "1 Hour",
        "cuisine": "beverages"
    },
    {
        "name": "Quick Chicken Curry",
        "ingredients": [
            "1 kg chicken",
            "3 large onions, paste",
            "2 large tomatoes, pureed",
            "1 Tbsp garlic paste",
            "1 Tbsp ginger paste",
            "2 tsp coriander powder",
            "2 tsp cumin powder",
            "1/2 tsp turmeric powder",
            "1/2 tsp red chilli powder",
            "1 tsp garam masala powder",
            "2 Tbsp oil",
            "Salt to taste",
            "Chopped coriander for garnish"
        ],
        "instructions": [
            "Heat oil in a pan and sauté the onion paste, garlic & ginger paste till golden brown.",
            "Add tomato puree. When the tomato puree dries up, add coriander powder, cumin powder, garam masala, red chilli powder, turmeric powder and salt. Let the spices cook.",
            "Add chicken pieces into the masala. Stir well and cook till they are golden brown.",
            "Add 1/2 cup of water and stir. Cover with a lid and let it simmer till the chicken is cooked.",
            "Garnish with chopped coriander and serve."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Butter Chicken",
        "ingredients": [
            "700 gm raw chicken  ",
            "For theMarinade:",
            "1 tsp red chilli powder ",
            "1 tsp ginger and garlic paste ",
            "Salt to taste ",
            "1/2 kg curd  ",
            "For theGravy:",
            "175 gm white butter ",
            "1/2 tsp black cumin seeds ",
            "1/2 kg tomato, pureed ",
            "1/2 tsp sugar ",
            "1 tsp red chilli powder ",
            "Salt to taste ",
            "100 gm fresh cream ",
            "4 green chillies, sliced",
            "1/2 tsp fenugreek leaves, crushed"
        ],
        "instructions": [
            "For marinating the chicken",
            "In a mixing bowl, mix red chilli powder, ginger garlic paste, salt and curd.  ",
            "Add the raw chicken pieces to the marinade and mix well. Keep it in the refrigerator overnight or minimum 6 hours.  ",
            "Roast the marinated chicken in a tandoor or an oven for about 10-12 minutes until it is three-fourth done.  ",
            "For the chicken gravy",
            "Heat half the quantity of white butter in pan. ",
            "Pour in the tomato puree, and saute for 2-3 minutes. Add cumin seeds, sugar, red chilli powder and salt. Mix well.  ",
            "Add the prepared chicken, white butter, fresh cream, sliced green chillies and crushed fenugreek leaves.  Saute for 3-4 minutes and let the chicken cook.",
            "Cook till chicken is done. Serve hot with rice or naan."
        ],
        "cook_time": "30 Minutes + Marination time (overnight)",
        "cuisine": "beverages"
    },
    {
        "name": "Love, Live and Laugh",
        "ingredients": [
            "50 ml - vodka espresso     ",
            "1 shot of espresso coffee",
            "Cappuccino foam (milk froth)",
            "10 ml triple sec/sugar syrup",
            "Cinnamon powder                          ",
            "3 coffee beans"
        ],
        "instructions": [
            "Shake together vodka, espresso coffee and triple sec (sugar syrup).",
            "Float cappuccino foam over it and sprinkle cinnamon powder over the foam.",
            "Drop three coffee beans atop."
        ],
        "cook_time": "15 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Express Affinity",
        "ingredients": [
            "50 ml - vodka espresso ",
            "100 ml - regular coffee  ",
            "Cola to top up "
        ],
        "instructions": [
            "In tall glass pour coffee espresso followed by coffee and top it up with cola. ",
            "Garnish it with coffee beans"
        ],
        "cook_time": "15 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Almond Saffron Milkshake",
        "ingredients": [
            "2 Tbsp almonds",
            "1 Tbsp walnuts",
            "1 tsp flax seeds",
            "1 tsp honey",
            "2-4 saffron, strands",
            "250 ml milk"
        ],
        "instructions": [
            "Grind the almonds walnuts and flax seeds together.",
            "In a blender, mix the almonds, flaxs seeds, cold milk, honey and saffron.",
            "Serve chilled. "
        ],
        "cook_time": "15 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Apple Chia Seeds Smoothie",
        "ingredients": [
            "1 apple, chopped",
            "1 cup yogurt",
            "1 tsp peanut butter (optional)",
            "1 tsp chia seeds"
        ],
        "instructions": [
            "Put all the ingredients in a blender and blend well.",
            "Serve chilled."
        ],
        "cook_time": "5 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Flax Seed Smoothie",
        "ingredients": [
            "2 Tbsp flax seeds",
            "1 cup flavoured soya milk",
            "1 cup chilled and roughly chopped strawberries",
            "1/2 cup chilled and roughly chopped bananas",
            "2 tsp honey",
            "Garnish: 2 strawberries and 2 bananas slices"
        ],
        "instructions": [
            "Add strawberries, bananas, flax seeds and honey in soya milk, blend in a juicer till the mixture is smooth and frothy.",
            "Pour equal quantities of the smoothie into 2 individual glasses.",
            "Serve garnished with a strawberry and banana slice."
        ],
        "cook_time": "10 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Falsa Sherbet",
        "ingredients": [
            "250 gms falsa",
            "2 Tbsp sugar",
            "2 lemons",
            "8-10 mint leaves",
            "6-7 ice cubes"
        ],
        "instructions": [
            "Blend some washed falsa along with sugar, lemon juice & mint leaves in a blender.",
            "Strain it.",
            "Add  ice cubes, mint leaves & sliced lemon in a glass.",
            "Pour falsa into it.",
            "Serve cold."
        ],
        "cook_time": "15 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Aam Panna with Vodka",
        "ingredients": [
            "Vodka 60 ml",
            "1 green mango ",
            "Water 200 ml",
            "Roasted cumin seeds - 1 tsp",
            "Salt - 1 tsp",
            "Sugar 3 tsp"
        ],
        "instructions": [
            "Place mangoes in a pan along with water and bring to boil.",
            "Drain off the water and peel, stone and pulp the mangoes with a spoon.",
            "Place the pulp in a deep bowl.",
            "Add water, sugar, salt and cumin.",
            "Whisk thoroughly.",
            "Transfer in a glass and add vodka.",
            "Serve with ice cubes."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Avocado Lassi",
        "ingredients": [
            "1 avocado",
            "1 cup yogurt",
            "1 tsp honey"
        ],
        "instructions": [
            "Blend peeled & chopped avocado, yogurt & honey in a blender.",
            "Serve."
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Fruit Infused Tea",
        "ingredients": [
            "2 camomile tea bags",
            "1 orange",
            "50 gms berries",
            "50 gms blueberries",
            "10 gms ginger",
            "8-10 mint leaves",
            "2 cups boiling water"
        ],
        "instructions": [
            "Brew together camomile tea bags, orange rind, berries, blueberries, mint leaves & ginger for four minutes.",
            "Serve hot."
        ],
        "cook_time": "15 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Xmas In A Glass",
        "ingredients": [
            "60 ml vodka15 ml ginger bread10 ml berry puree10 ml strawberry shrub10 ml lime juiceCrushed iceGarnish: mint sprig and caster sugar"
        ],
        "instructions": [
            "Add all ingredients in a cocktails shaker. Shake it well with ice cubes, then strain it over crushed ice. ",
            "Garnish with mint sprigs and caster sugar."
        ],
        "cook_time": "5 mintues",
        "cuisine": "beverages"
    },
    {
        "name": "Ek Bar Mulled Wine",
        "ingredients": [
            "100g sugar4 star anise2 cinnamon stick8 cloves1 nutmeg150 ml water1 lemon2 orange slices150 ml Cointreau750ml / 1 bottle light red wineTwist of orange zest and a star anise, to serve"
        ],
        "instructions": [
            "Put sugar in a pan with star anise, cinnamon stick, cloves and 150ml water. Bring slowly to the boil, stirring to dissolve the sugar.",
            "Simmer for 2 minutess, then pour into a large jug and leave to cool. Add 1 lemon and 2 orange, both thinly sliced, to the jug along with 150ml Cointreau and a 750ml bottle light red wine. Stir well, then cover and chill for at least 2 hours or overnight if you can.",
            "Serve chilled or over ice, with a twist of orange zest and a star anise. If you'd like to serve a traditional warm mulled wine, there's no need to chill - simply warm through without boiling and serve in heatproof glasses. "
        ],
        "cook_time": "20 minutes + 2 hours",
        "cuisine": "beverages"
    },
    {
        "name": "Coconut Water With Lemon and Mint (My Yellow Table)",
        "ingredients": [
            "1 coconut",
            "Mint leaves",
            "1 Tbsp honey",
            "1 Lemon"
        ],
        "instructions": [
            "Break a coconut & empty water in a jug. ",
            "Scrape off coconut meat using a spoon, ",
            "Chop it finely and add it to coconut water.",
            "Add mint, honey and lemon juice as well as lemon.",
            "Mix and stir well, serve."
        ],
        "cook_time": "15 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Hot White Chocolate (My Yellow Table)",
        "ingredients": [
            "500 ml milk",
            "250 ml coconut milk",
            "75 gms white chocolate",
            "1 vanilla pod "
        ],
        "instructions": [
            "Boil together milk, coconut milk & white chocolate in a container. ",
            "Add 1 vanilla pod.",
            "Serve hot."
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Pannakam (My Yellow Table)",
        "ingredients": [
            "250 gms jaggery",
            "1 cup of water",
            "5-6 basil leaves",
            "1 ginger",
            "2-3 mandarins",
            "2 lemons",
            "1 Tbsp cardamom powder",
            "salt"
        ],
        "instructions": [
            "Take jaggery in a bowl",
            "Add water and allow it to melt. ",
            "Add chopped basil leaves, ginger, sliced mandarins, lemon juice and lemons to it.",
            "Add cardamom powder & salt to taste.  ",
            "Serve cold."
        ],
        "cook_time": "15 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Chamomile, Apple & Mint Iced Tea (My Yellow Table)",
        "ingredients": [
            "Chamomile tea bags",
            "15 -20 mint leaves",
            "1 lemon",
            "5-6 fresh jasmine",
            "Boiling water",
            "1/2 cup apple Juice",
            "Ice cubes"
        ],
        "instructions": [
            "Brew together tea bags, mint leaves, jasmine and lemon.",
            "In a glass add ice, lemon, apple juice and brewed tea.",
            "Serve cold."
        ],
        "cook_time": "15 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Watermelon, Mint, Lime & Ginger Slushie (My Yellow Table)",
        "ingredients": [
            "1 Large watermelon",
            "2 Lemons",
            "1 cup orange juice",
            "20 gms ginger",
            "Sugar ",
            "Handful of Mint leaves",
            "Crushed Ice"
        ],
        "instructions": [
            "Remove watermelon seeds",
            "Cut it into dices,",
            "Grind together mint leaves, chopped ginger, sugar, crushed ice & diced watermelon in a juicer.",
            "Serve."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Mud Slide",
        "ingredients": [
            "15 ml Kahlua",
            "15 ml Absolut vodka",
            "25 ml Irish Creme"
        ],
        "instructions": [
            " Add all the ingredients in a cocktail shaker along with some ice cubes.",
            "Shake well and fill up in an old fashioned glass.",
            "You can also top it with some whipped cream and chocolate sauce or shavings."
        ],
        "cook_time": "10 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Moorish",
        "ingredients": [
            "30 ml Kahlua",
            "30 ml Bailey's Irish cream",
            "30 ml Espresso shot",
            "Crushed ice",
            "Chocolate cigar",
            "24k gold specs"
        ],
        "instructions": [
            "Take a large/over-sized Margarita coupe and fill it up with crushed ice.",
            "Pour out the Bailey's Irish cream into a shot glass.",
            "Similarly pour out the Kahlua into a shot glass.",
            "Finally press out a shot of Espresso in a separate shot glass.",
            "Serve the three shot glasses along with the Margarita coupe with crushed ice in it. ",
            "Pour all three into the glass and finish with chocolate cigar and gold specs. "
        ],
        "cook_time": "15 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Chocolate Cake in a Pressure Cooker",
        "ingredients": [
            "1 cup flour  ",
            "1/4 cup cocoa powder  ",
            "1 1/4 tsp baking powder",
            "1/4 cup butter",
            "3/4 cup caster sugar",
            "1/4 cup water  ",
            "2 eggs  ",
            "1/2 tsp vanilla essence",
            "1/8 tsp salt  ",
            "6 inch round greased baking tin"
        ],
        "instructions": [
            "In a mixing bowl, sift the flour, cocoa powder and baking powder. ",
            "Add in the butter, sugar, salt, water and vanilla, and beat the ingredients using a whisk.     ",
            "Add the eggs and beat the batter until smooth. ",
            "Transfer into the baking tin.    ",
            "Heat the pressure cooker, covered with the lid but without the pressure, for 3-4 minutes on high heat, then place the cake tin in the empty cooker (do not add water in the cooker).     ",
            "Close the lid (without the pressure), lower the flame and let it cook until done (about 30 minutes)."
        ],
        "cook_time": "1 Hour",
        "cuisine": "beverages"
    },
    {
        "name": "Honey Chilli Potatoes",
        "ingredients": [
            "For the potatoes:",
            "2 potatoes, peeled and sliced",
            "3-4 Tbsp cornflour or maida",
            "Salt to taste",
            "1 tsp red chilli powder",
            "Oil, for deep frying",
            "For the base:",
            "1 tsp oil",
            "2 spring onions (with stalk), sliced",
            "1 Tbsp garlic paste",
            "1 capsicum, sliced",
            "2 Tbsp honey",
            "Salt, to taste",
            "1/4 tsp soya sauce",
            "3 tsp white sesame seeds",
            "2 tsp chilli sauce"
        ],
        "instructions": [
            "For the potatoes:",
            "In a bowl, add cornflour or maida, salt and red chilli powder.",
            "Add the sliced potatoes and mix well until the potatoes are coated.",
            "Heat oil in a wok and deep fry the potatoes until golden. Keep aside.",
            "For the Base:",
            "In a wok, add oil, garlic paste and spring onions. Saute on high heat for 1 minute.",
            "Add capsicum, honey, salt, soya sauce, chilli sauce. Saute for 2-3 minutes.",
            "Add the deep-fried potatoes and sesame seeds. Mix well and serve hot."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Vegetable Momos",
        "ingredients": [
            "For Dough:",
            "2 cups maida",
            "1/2 tsp salt ",
            "1/2 tsp baking powder   ",
            "For Filling: ",
            "1 cup carrots - grated ",
            "1 cup cabbage - grated ",
            "1 Tbsp oil ",
            "1/2 cup onion - finely chopped ",
            "1 tsp garlic - chopped  ",
            "1 tsp Soya sauce ",
            "Salt ",
            "1/4 tsp vinegar ",
            "1/4 tsp black pepper"
        ],
        "instructions": [
            "Mix the maida, salt and baking powder and knead to a stiff dough with water. ",
            "Heat oil and add the onion and garlic. ",
            "Saute over high heat and add the carrot and cabbage. Turn around over high heat till glossy. ",
            "Take it off the heat and mix in the Soya sauce, salt, vinegar and black pepper. ",
            "Roll the dough thin (translucent) and cut into 4\"-5\" rounds. ",
            "Take a round, wet edges and place some filling in the center. ",
            "Bring edges together to cover the filling. Twist to seal and fill the rest in the same way. ",
            "Steam for about 10 minutes and serve with soya sauce and chilli sauce."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Chole Bhature",
        "ingredients": [
            "For chole:",
            "2 cup chickpeas (channas)",
            "2 tsp oil",
            "1 bay leaf (tej patta)",
            "1 stick cinnamon (dalchini)",
            "3-4 cloves (laung)",
            "1 tsp whole pepper corns (sabut kali mirch)",
            "3 green cardamom  (choti elaichi)",
            "2 black cardamom (badi elaichi)",
            "1 tsp turmeric powder (haldi)",
            "1 tsp chili powder (lal mirch powder)",
            "1 tsp coriander powder (dhaniya powder)",
            "1 tsp cumin powder (zeera powder)",
            "1 tsp cumin seeds (zeera)",
            "1/2 tsp asafoetida (heeng)",
            "Salt to taste",
            "1 cup onions (chopped)",
            "1 cup tomatoes (chopped)",
            "1 tsp ginger (chopped)",
            "1 tsp garlic (chopped)",
            "1 tsp ajwain",
            "1 tsp lime juice",
            "1 green chili (chopped)                      1 tea bag                                                1 Tbsp butter",
            "For the bhaturas:",
            "2 cups maida (refined flour)",
            "1/2 tsp yeast, dissolved for 10 minutes in luke warm water",
            "1/2 cup whole wheat flour",
            "A pinch of salt",
            "Water to knead",
            "Oil for frying"
        ],
        "instructions": [
            "For chole:",
            "In a pan add oil, bay leaf, cinnamon, cumin seeds, cloves, whole pepper corns, green and black cardamom.",
            "After it gets brown add chopped onions and saute it.",
            "After sauteing add chopped ginger and garlic.",
            "Then add turmeric, chili powder, coriander powder, cumin powder, asafoetida, salt and fry well.",
            "For de glazing the pan add little water.",
            "Now add the chole (soaked overnight and pressure cooked) to the masala.",
            "After stirring well add tomatoes, little sugar and salt to the chole (chickpeas)",
            "Now add ajwain, chopped green chilies and water for the base.",
            "To get the color in the chole, add a tea bag to the masala.",
            "Simmer the chole gently for an hour and cover it.",
            "Add lime juice and a dollop of butter to it.",
            "Garnish the chole with coriander and butter.",
            "Serve the chole hot with bhaturas.",
            "For the bhaturas:",
            "Knead the whole wheat flour, maida and salt together with adequate amount of water.",
            "Sprinkle the yeast on top. Leave it for 2-3 hours for the yeast to work.",
            "Divide it into equal portions. Roll out in an oval or round shape.",
            "Deep fry till golden brown, like a puri.",
            "Serve. "
        ],
        "cook_time": "1 Hour",
        "cuisine": "beverages"
    },
    {
        "name": "Quick Chicken Curry",
        "ingredients": [
            "1 kg chicken",
            "3 large onions, paste",
            "2 large tomatoes, pureed",
            "1 Tbsp garlic paste",
            "1 Tbsp ginger paste",
            "2 tsp coriander powder",
            "2 tsp cumin powder",
            "1/2 tsp turmeric powder",
            "1/2 tsp red chilli powder",
            "1 tsp garam masala powder",
            "2 Tbsp oil",
            "Salt to taste",
            "Chopped coriander for garnish"
        ],
        "instructions": [
            "Heat oil in a pan and sauté the onion paste, garlic & ginger paste till golden brown.",
            "Add tomato puree. When the tomato puree dries up, add coriander powder, cumin powder, garam masala, red chilli powder, turmeric powder and salt. Let the spices cook.",
            "Add chicken pieces into the masala. Stir well and cook till they are golden brown.",
            "Add 1/2 cup of water and stir. Cover with a lid and let it simmer till the chicken is cooked.",
            "Garnish with chopped coriander and serve."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Butter Chicken",
        "ingredients": [
            "700 gm raw chicken  ",
            "For theMarinade:",
            "1 tsp red chilli powder ",
            "1 tsp ginger and garlic paste ",
            "Salt to taste ",
            "1/2 kg curd  ",
            "For theGravy:",
            "175 gm white butter ",
            "1/2 tsp black cumin seeds ",
            "1/2 kg tomato, pureed ",
            "1/2 tsp sugar ",
            "1 tsp red chilli powder ",
            "Salt to taste ",
            "100 gm fresh cream ",
            "4 green chillies, sliced",
            "1/2 tsp fenugreek leaves, crushed"
        ],
        "instructions": [
            "For marinating the chicken",
            "In a mixing bowl, mix red chilli powder, ginger garlic paste, salt and curd.  ",
            "Add the raw chicken pieces to the marinade and mix well. Keep it in the refrigerator overnight or minimum 6 hours.  ",
            "Roast the marinated chicken in a tandoor or an oven for about 10-12 minutes until it is three-fourth done.  ",
            "For the chicken gravy",
            "Heat half the quantity of white butter in pan. ",
            "Pour in the tomato puree, and saute for 2-3 minutes. Add cumin seeds, sugar, red chilli powder and salt. Mix well.  ",
            "Add the prepared chicken, white butter, fresh cream, sliced green chillies and crushed fenugreek leaves.  Saute for 3-4 minutes and let the chicken cook.",
            "Cook till chicken is done. Serve hot with rice or naan."
        ],
        "cook_time": "30 Minutes + Marination time (overnight)",
        "cuisine": "beverages"
    },
    {
        "name": "Espresso Kahlua Martini",
        "ingredients": [
            "30 ml Kahlua",
            "30 ml vodka",
            "20 ml Espresso shot",
            "15 ml sugar syrup"
        ],
        "instructions": [
            " Shake\n all the ingredients in a cocktail shaker along with a few ice cubes. \n",
            " Pour into a chilled martini glass and garnish with 3 coffee beans on \ntop."
        ],
        "cook_time": "5 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Unfinished Business",
        "ingredients": [
            "45 ml Tequila",
            "30 ml Kahlua",
            "25 ml sweet vermouth",
            "4 dashes Angostura bitters"
        ],
        "instructions": [
            "Stir all the ingredients in a mixing glass.",
            " Place an ice ball in a martini glass or champagne saucer. ",
            " Pour the drink over the ice ball and serve in smoked wooden chamber box."
        ],
        "cook_time": "10 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "White Russian",
        "ingredients": [
            "30 ml vodka",
            "15 ml Kahlua",
            "15 ml cream"
        ],
        "instructions": [
            " Fill up a fashioned glass with ice cubes.",
            " Pour in the Kahlua, followed by vodka and top it off with cream.",
            " Stir a little and serve."
        ],
        "cook_time": "5 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Genie in a Bottle",
        "ingredients": [
            "30 ml of white rum  50 gm blueberries",
            "15 ml of lemon juice ",
            "5 ml of lavender syrup ",
            "Soda to top up"
        ],
        "instructions": [
            "Put all the ingredients in a cocktail shaker.",
            "Fill it with ice and shake it well.",
            "Strain into a glass.",
            "Top up with soda.",
            "Garnish with blueberry. "
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Cool as a Cucumber",
        "ingredients": [
            "30 ml gin",
            "50 gm cucumber slice",
            "15 ml of lemon juice",
            "Soda \n \n    ",
            "Mint Sprig"
        ],
        "instructions": [
            "Muddle the cucumber.",
            "\n   Put all the ingredients in cocktail shaker.",
            "Fill with ice and shake it well.\n",
            "Double strain in glass.",
            "Garnish with mint sprig."
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Pina Colada",
        "ingredients": [
            "30ml malibu rum",
            "30ml white rum",
            "60ml fresh coconut water",
            "30ml sugar syrup",
            "60ml pineapple juice",
            "20gm coconut cream",
            "pineapple, orange and maraschino cherry for garnishing"
        ],
        "instructions": [
            "Put all the ingredients in a blender",
            "Blend it well",
            "Serve in tabu tikki glass with ice cubes (5-6)",
            "Garnish with fresh pineapple, orange and maraschino cherry"
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Earl-Y-Gin",
        "ingredients": [
            "60 ml gin",
            "90 ml Earl Grey tea",
            "15 ml sweet and sour ",
            "15 gm cranberry reduction sauce",
            "Monaco crackers"
        ],
        "instructions": [
            "Add gin, sweet & sour mix and tea to the cocktail shaker",
            "Shake it well",
            "Pour the drink in decanter",
            "Put the ice cubes in the wooden glass",
            "Pour the drink while serving",
            "Garnish with cranberry sauce",
            "Serve with Monaco cracker"
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Virgin Cucumber Cooler",
        "ingredients": [
            "300gm fresh cucumber",
            "15ml lemon juice",
            "150gm crushed ice",
            "Soda",
            "A sprig of mint or basil for garnish "
        ],
        "instructions": [
            "Mix all the ingredients ​in a shaker. ",
            "Pour into a glass and top it up with soda. ",
            "Add mint or basil for garnish"
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Eternity",
        "ingredients": [
            "60ml Souching or earl grey tea",
            "6 chunks of fresh pineapple ",
            "60ml fresh apple juice ",
            "15ml honey ",
            "5ml lime juice ",
            "A dash of Angostura Bitters "
        ],
        "instructions": [
            "The process is simple. Make the tea liquor, and make sure it's not too strong. ",
            "Once the tea is cooled, take all the ingredients, muddle them well together and double strain it. ",
            "Serve chilled. "
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Gondhoraj Julep",
        "ingredients": [
            "1 Gondhoraj lime",
            "A handful of mint leaves",
            "Salt and sugar to taste ",
            "30 ml lemonade ",
            "Ice "
        ],
        "instructions": [
            "Cut the lime into small wedges. ",
            "In a glass muddle the wedges along with mint leaves, sugar and salt and top it up with lemonade and ice. ",
            "Stir, and serve. "
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Grape Nectar",
        "ingredients": [
            "6 lychees ",
            "6 lemon chunks ",
            "20ml sugar syrup ",
            "Crushed Ice ",
            "A bunch of fresh black grapes (to yield about 120ml of juice)"
        ],
        "instructions": [
            "Muddle the lychees along with the lemon chunks. ",
            "Make about 120 ml of juice with the black grapes, but don't throw away the pulp. ",
            "In an old fashioned glass, add the muddled fruits, and sugar syrup and crushed ice. ",
            "You can use a shaker to mix them well. Top it up with the fresh grape juice. "
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Homemade Ginger Ale",
        "ingredients": [
            "30ml mint juice (method follows) ",
            "15ml ginger juice ",
            "20ml lemon juice ",
            "15ml sugar syrup ",
            "Sprite or 7Up ",
            "Sprig of mint"
        ],
        "instructions": [
            "To make the mint juice, take mint leaves and ice and blend the two. Strain out the juice. ",
            "To make ginger juice, use ginger and a little bit of water and blend it",
            "Mix mint juice, ginger juice, lemon juice, and the sugar syrup in a tall glass. ",
            "Top it up with Sprite or 7Up. Garnish with a spring of mint. ",
            "Serve chilled. "
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Very Berry Khatta",
        "ingredients": [
            "4 mulberries",
            "1 orange wedge",
            "60ml grape juice ",
            "30ml kala khatta syrup ",
            "2 lime rings",
            "Black salt",
            "Pomegranate",
            "Crushed ice"
        ],
        "instructions": [
            "Muddle two of the mulberries, half of lime and one orange wedge. Add the grape juice, kala khatta syrup, Black salt to taste and stir. ",
            "Serve over crushed ice",
            "Garnish with pomegranate, the remaining mulberries, and lime rings."
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Indian Summer (Mango Cocktail)",
        "ingredients": [
            "60 ml vodka",
            "60 gm fresh mangoes",
            "6-8 fresh mint leaves",
            "1-inch ginger",
            "20 ml sweet and sour syrup",
            "15 ml lime juice",
            "1 mint sprig to garnish "
        ],
        "instructions": [
            "Add the vodka, fresh mangoes, mint leaves, ginger, lime juice, sweet and sour along with a few ice cubes in a blender. Blend until well combined.",
            "Pour it in a margarita glass and serve frozen garnished with a mint sprig."
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Recipes: Healthy",
        "ingredients": [],
        "instructions": [],
        "cook_time": "",
        "cuisine": "beverages"
    },
    {
        "name": "Utterly Simple",
        "ingredients": [
            "Glass: all-purpose wine",
            "30 ml dark rum",
            "1 cinnamon stick",
            "200 ml hot apple juice          Garnish: Cinnamon, sugar rim, slice of apple"
        ],
        "instructions": [
            "Rim glass with cinnamon sugar. ",
            "Put rum in the glass.",
            "Break and add the cinnamon stick. ",
            "Top it up with steaming apple juice.",
            "Float the apple slice."
        ],
        "cook_time": "15 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Pineapple And Bell Pepper Margarita",
        "ingredients": [
            "Glass: Margarita/Old fashioned glass",
            "45 ml Tequila",
            "15 ml lime juice",
            "15 ml sugar syrup",
            "5-6 chunks of pineapple",
            "6 pieces of bell peppers (red, green, yellow)",
            "60 ml pineapple juice ",
            "Garnish: One each strips of red, yellow and green bell peppers"
        ],
        "instructions": [
            "Rim half the glass with salt.",
            "Add all the bell peppers and pineapples in the shaker and muddle. ",
            "Fill the can half with ice cube. Pour tequila, lime juice, sugar syrup, PJ and shake well.",
            "Taste to adjust and double strain or pour on the rocks into salt-rimmed glass.",
            "Garnish with stripes of red, yellow and green bell peppers."
        ],
        "cook_time": "20 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Classic Sangria",
        "ingredients": [
            "Glass: AP wine",
            "Cut fruits (apples, orange, mint & fruits in season)",
            "75ml Red wine ",
            "15ml orange wine - to soak fruits",
            "Top with 7Up",
            "Garnish: mint sprigs"
        ],
        "instructions": [
            "Add the cut fruits in the glass.",
            "Pour in the red wine, orange wine, ice & top with 7Up/Sprite.",
            "Garnish with fresh mint."
        ],
        "cook_time": "5 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Chocolate Cake in a Pressure Cooker",
        "ingredients": [
            "1 cup flour  ",
            "1/4 cup cocoa powder  ",
            "1 1/4 tsp baking powder",
            "1/4 cup butter",
            "3/4 cup caster sugar",
            "1/4 cup water  ",
            "2 eggs  ",
            "1/2 tsp vanilla essence",
            "1/8 tsp salt  ",
            "6 inch round greased baking tin"
        ],
        "instructions": [
            "In a mixing bowl, sift the flour, cocoa powder and baking powder. ",
            "Add in the butter, sugar, salt, water and vanilla, and beat the ingredients using a whisk.     ",
            "Add the eggs and beat the batter until smooth. ",
            "Transfer into the baking tin.    ",
            "Heat the pressure cooker, covered with the lid but without the pressure, for 3-4 minutes on high heat, then place the cake tin in the empty cooker (do not add water in the cooker).     ",
            "Close the lid (without the pressure), lower the flame and let it cook until done (about 30 minutes)."
        ],
        "cook_time": "1 Hour",
        "cuisine": "beverages"
    },
    {
        "name": "Honey Chilli Potatoes",
        "ingredients": [
            "For the potatoes:",
            "2 potatoes, peeled and sliced",
            "3-4 Tbsp cornflour or maida",
            "Salt to taste",
            "1 tsp red chilli powder",
            "Oil, for deep frying",
            "For the base:",
            "1 tsp oil",
            "2 spring onions (with stalk), sliced",
            "1 Tbsp garlic paste",
            "1 capsicum, sliced",
            "2 Tbsp honey",
            "Salt, to taste",
            "1/4 tsp soya sauce",
            "3 tsp white sesame seeds",
            "2 tsp chilli sauce"
        ],
        "instructions": [
            "For the potatoes:",
            "In a bowl, add cornflour or maida, salt and red chilli powder.",
            "Add the sliced potatoes and mix well until the potatoes are coated.",
            "Heat oil in a wok and deep fry the potatoes until golden. Keep aside.",
            "For the Base:",
            "In a wok, add oil, garlic paste and spring onions. Saute on high heat for 1 minute.",
            "Add capsicum, honey, salt, soya sauce, chilli sauce. Saute for 2-3 minutes.",
            "Add the deep-fried potatoes and sesame seeds. Mix well and serve hot."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Vegetable Momos",
        "ingredients": [
            "For Dough:",
            "2 cups maida",
            "1/2 tsp salt ",
            "1/2 tsp baking powder   ",
            "For Filling: ",
            "1 cup carrots - grated ",
            "1 cup cabbage - grated ",
            "1 Tbsp oil ",
            "1/2 cup onion - finely chopped ",
            "1 tsp garlic - chopped  ",
            "1 tsp Soya sauce ",
            "Salt ",
            "1/4 tsp vinegar ",
            "1/4 tsp black pepper"
        ],
        "instructions": [
            "Mix the maida, salt and baking powder and knead to a stiff dough with water. ",
            "Heat oil and add the onion and garlic. ",
            "Saute over high heat and add the carrot and cabbage. Turn around over high heat till glossy. ",
            "Take it off the heat and mix in the Soya sauce, salt, vinegar and black pepper. ",
            "Roll the dough thin (translucent) and cut into 4\"-5\" rounds. ",
            "Take a round, wet edges and place some filling in the center. ",
            "Bring edges together to cover the filling. Twist to seal and fill the rest in the same way. ",
            "Steam for about 10 minutes and serve with soya sauce and chilli sauce."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Chole Bhature",
        "ingredients": [
            "For chole:",
            "2 cup chickpeas (channas)",
            "2 tsp oil",
            "1 bay leaf (tej patta)",
            "1 stick cinnamon (dalchini)",
            "3-4 cloves (laung)",
            "1 tsp whole pepper corns (sabut kali mirch)",
            "3 green cardamom  (choti elaichi)",
            "2 black cardamom (badi elaichi)",
            "1 tsp turmeric powder (haldi)",
            "1 tsp chili powder (lal mirch powder)",
            "1 tsp coriander powder (dhaniya powder)",
            "1 tsp cumin powder (zeera powder)",
            "1 tsp cumin seeds (zeera)",
            "1/2 tsp asafoetida (heeng)",
            "Salt to taste",
            "1 cup onions (chopped)",
            "1 cup tomatoes (chopped)",
            "1 tsp ginger (chopped)",
            "1 tsp garlic (chopped)",
            "1 tsp ajwain",
            "1 tsp lime juice",
            "1 green chili (chopped)                      1 tea bag                                                1 Tbsp butter",
            "For the bhaturas:",
            "2 cups maida (refined flour)",
            "1/2 tsp yeast, dissolved for 10 minutes in luke warm water",
            "1/2 cup whole wheat flour",
            "A pinch of salt",
            "Water to knead",
            "Oil for frying"
        ],
        "instructions": [
            "For chole:",
            "In a pan add oil, bay leaf, cinnamon, cumin seeds, cloves, whole pepper corns, green and black cardamom.",
            "After it gets brown add chopped onions and saute it.",
            "After sauteing add chopped ginger and garlic.",
            "Then add turmeric, chili powder, coriander powder, cumin powder, asafoetida, salt and fry well.",
            "For de glazing the pan add little water.",
            "Now add the chole (soaked overnight and pressure cooked) to the masala.",
            "After stirring well add tomatoes, little sugar and salt to the chole (chickpeas)",
            "Now add ajwain, chopped green chilies and water for the base.",
            "To get the color in the chole, add a tea bag to the masala.",
            "Simmer the chole gently for an hour and cover it.",
            "Add lime juice and a dollop of butter to it.",
            "Garnish the chole with coriander and butter.",
            "Serve the chole hot with bhaturas.",
            "For the bhaturas:",
            "Knead the whole wheat flour, maida and salt together with adequate amount of water.",
            "Sprinkle the yeast on top. Leave it for 2-3 hours for the yeast to work.",
            "Divide it into equal portions. Roll out in an oval or round shape.",
            "Deep fry till golden brown, like a puri.",
            "Serve. "
        ],
        "cook_time": "1 Hour",
        "cuisine": "beverages"
    },
    {
        "name": "Quick Chicken Curry",
        "ingredients": [
            "1 kg chicken",
            "3 large onions, paste",
            "2 large tomatoes, pureed",
            "1 Tbsp garlic paste",
            "1 Tbsp ginger paste",
            "2 tsp coriander powder",
            "2 tsp cumin powder",
            "1/2 tsp turmeric powder",
            "1/2 tsp red chilli powder",
            "1 tsp garam masala powder",
            "2 Tbsp oil",
            "Salt to taste",
            "Chopped coriander for garnish"
        ],
        "instructions": [
            "Heat oil in a pan and sauté the onion paste, garlic & ginger paste till golden brown.",
            "Add tomato puree. When the tomato puree dries up, add coriander powder, cumin powder, garam masala, red chilli powder, turmeric powder and salt. Let the spices cook.",
            "Add chicken pieces into the masala. Stir well and cook till they are golden brown.",
            "Add 1/2 cup of water and stir. Cover with a lid and let it simmer till the chicken is cooked.",
            "Garnish with chopped coriander and serve."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Butter Chicken",
        "ingredients": [
            "700 gm raw chicken  ",
            "For theMarinade:",
            "1 tsp red chilli powder ",
            "1 tsp ginger and garlic paste ",
            "Salt to taste ",
            "1/2 kg curd  ",
            "For theGravy:",
            "175 gm white butter ",
            "1/2 tsp black cumin seeds ",
            "1/2 kg tomato, pureed ",
            "1/2 tsp sugar ",
            "1 tsp red chilli powder ",
            "Salt to taste ",
            "100 gm fresh cream ",
            "4 green chillies, sliced",
            "1/2 tsp fenugreek leaves, crushed"
        ],
        "instructions": [
            "For marinating the chicken",
            "In a mixing bowl, mix red chilli powder, ginger garlic paste, salt and curd.  ",
            "Add the raw chicken pieces to the marinade and mix well. Keep it in the refrigerator overnight or minimum 6 hours.  ",
            "Roast the marinated chicken in a tandoor or an oven for about 10-12 minutes until it is three-fourth done.  ",
            "For the chicken gravy",
            "Heat half the quantity of white butter in pan. ",
            "Pour in the tomato puree, and saute for 2-3 minutes. Add cumin seeds, sugar, red chilli powder and salt. Mix well.  ",
            "Add the prepared chicken, white butter, fresh cream, sliced green chillies and crushed fenugreek leaves.  Saute for 3-4 minutes and let the chicken cook.",
            "Cook till chicken is done. Serve hot with rice or naan."
        ],
        "cook_time": "30 Minutes + Marination time (overnight)",
        "cuisine": "beverages"
    },
    {
        "name": "Fruity Daiquiris",
        "ingredients": [
            "Glass: Margarita glass",
            "45ml white rum",
            "15ml lime juice",
            "45ml  Manama crushes - strawberry, peach, apricot, litchi ",
            "Garnish: sweet lime slice/mint sprig"
        ],
        "instructions": [
            "Rim the glass half with sugar. ",
            "Take a mixing tin filled half with crushed ice.",
            "Add white rum, lime juice, sugar syrup or flavored crushes and blend it until it becomes slushy. ",
            "Serve and garnish with a sprig of mint or any fruit. "
        ],
        "cook_time": "10 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Twisted Whiskey Sour",
        "ingredients": [
            "Glass: Rocks",
            "45ml Whiskey ",
            "20ml lime juice",
            "30ml orange juice",
            "10 ml sugar syrup",
            "Garnish: half slice of orange"
        ],
        "instructions": [
            "Fill 3/4 the shaker with cube ice.",
            "Add all ingredients and shake. ",
            "Strain into a rocks glass filled with ice.",
            "Garnish with half slice of orange.",
            "Drizzle a few drops of Angostura bitter (optional)."
        ],
        "cook_time": "15 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Bloody Mary",
        "ingredients": [
            "Glass: Tall/Collins glass",
            "45 ml vodka",
            "150 ml tomato juice ",
            "15 ml lime juice ",
            "A wedge of lime ",
            "1/4 tsp Wooster sauce ",
            "1 tsp or more Tabasco sauce",
            "Garnish: green chilly and salt rim"
        ],
        "instructions": [
            "Take a tall glass, rim it with salt. ",
            "Fill 3/4 glass with ice cubes.",
            "Add tomato juice, Wooster sauce, Tabasco sauce, lime juice, squeeze a wedge of lime in it.",
            "Stir and taste to adjust flavours - should be sharper and spicier than you want. ",
            "Slide in the vodka and stir.",
            "Place a long green chilly in the glass."
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Cosmopolitan",
        "ingredients": [
            "Glass: Martini",
            "45 ml vodka  ",
            "45 ml cranberry juice ",
            "2 wedges of lime",
            "Garnish: Half a slice orange/sparked orange peel.",
            ""
        ],
        "instructions": [
            "Fill the shaker 3/4 with ice.",
            "Add all the ingredients, squeeze both wedges of lime and drop in.",
            "Shake it and strain into a martini glass.",
            "Take a small peel of orange, flame it to extract the oil essence, drop it in the drink."
        ],
        "cook_time": "5 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Classic Margarita",
        "ingredients": [
            "Glass: Martini glass",
            "45ml Tequila",
            "15ml Cointreau ",
            "15ml lime juice",
            "1 wedge lime",
            "15ml sugar syrup ",
            "Garnish: Half a slice of orange"
        ],
        "instructions": [
            "Rim the glass with salt. ",
            "Fill the mixing tin 3/4 with ice cubes.",
            "Pour tequila, Cointreau, lime wedge and lime juice, shake. ",
            "Strain it in the rimmed glass and Garnish."
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Classic Mojito",
        "ingredients": [
            "Glass: Collins",
            "45ml white rum",
            "6 lime wedges",
            "15ml sugar syrup",
            "10 mint leaves",
            "Crushed ice",
            "Soda to top",
            "Garnish: a sprig of mint"
        ],
        "instructions": [
            "Squeeze and drop lime wedges into glass.",
            "Tear the mint leaves over the lime. Muddle.",
            "Fill glass with crushed ice. Add sugar syrup and white rum.",
            "Add more crushed ice to fill.",
            "Top with soda. Stir and taste to adjust.",
            "Note: Add fresh mango cubes and top with Sprite/7up in place of sugar and soda.",
            ""
        ],
        "cook_time": "5 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Caipiroska",
        "ingredients": [
            "45 ml vodka",
            "6 lime wedges",
            "15ml sugar syrup",
            "10 mint leaves",
            "Crushed ice",
            "Garnish: a sprig of mint leaves/ 1/2 slice sweet lime"
        ],
        "instructions": [
            "Glass: Old Fashioned",
            "Squeeze and drop lime wedges into glass. ",
            "Tear the mint leaves over the lime. ",
            "Muddle. Fill glass with crushed ice. ",
            "Add sugar syrup and Smirnoff. Stir and taste to adjust. ",
            "Top with more crushed ice. Garnish."
        ],
        "cook_time": "5 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Smoked Infused Negroni",
        "ingredients": [
            "20 ml campari",
            "20 ml Bombay Sapphire ",
            "20 ml Martini Rosso ",
            "100 gm orange wedge "
        ],
        "instructions": [
            "Put all the ingredients in a glass, and mix it well. ",
            "Strain it into a tea pot with dry ice.",
            "Garnish beautifully with orange wedges"
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Spaghetti Shot",
        "ingredients": [
            "500 ml orange juice",
            "5 gm agar",
            "90 ml gin",
            "15 ml red wine  ",
            "15 ml cointreau",
            "Cold water",
            "Grapes cooked in red wine for garnish"
        ],
        "instructions": [
            "Heat 500 ml of orange juice with 5 gm of agar as the mix is boiled.",
            "Then add 90 ml of gin in it. ",
            "Mix it properly and fill in spaghetti mold and leave it for 5 minutes in cold water. ",
            "After that release it by the help of air pressure through a syringe then fill it in to a shot glass. ",
            "Pour 15 ml of red wine reduction and 15 ml of cointreau. ",
            "Serve with grapes  cooked in red wine over the top. "
        ],
        "cook_time": "20 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Watermelon Lychee Granita",
        "ingredients": [
            "1/2 cup cubed watermelon",
            "7-8 lychee",
            "1/2 cup sugar",
            "10 mint leaves",
            "1 Tbsp lemon juice",
            "1 tsp grated ginger",
            ""
        ],
        "instructions": [
            "Pit lychees and discard the seeds. ",
            "In a blender, put mint leaves, ginger and sugar. Pulse once to release flavours. ",
            "Now add 1/2 cup of cubed watermelon, lemon juice and lychee.",
            "Blend to a smooth puree and transfer to a bowl. ",
            "Blend the remaining watermelon to a smooth puree and combine this with the previous mixture, mix well.",
            "Pour this mixture into a sturdy freezer-safe container. Freeze till set.",
            "Once frozen, use a fork and start raking the mixture from the sides first. Proceed to the center eventually.",
            "Put it back in the freezer once the entire mass is raked up. ",
            "After 2 hours, remove and repeat the raking process. Freeze till ready to serve. ",
            "Garnish with a few mint leaves. "
        ],
        "cook_time": "30 Minutes + Time to Chill",
        "cuisine": "beverages"
    },
    {
        "name": "Jal Jeera",
        "ingredients": [
            "1/4 cup sonth chutney ",
            "1/2 cup firmly packed mint leaves ",
            "20 gm coriander leaves-ground together ",
            "2-3 green chillies or to taste ",
            "1/2 Tbsp roasted and powdered cumin seeds ",
            "1 tsp salt or to taste ",
            "1/4 tsp chilli powder ",
            "2 cups water ",
            "For sonth ki chutney:",
            "100 gm tamarind-soaked in warm water for half an hour at least ",
            "3/4 cup broken up jaggery ",
            "2 tsp salt ",
            "1 tsp powdered black rock salt ",
            "1/2 tsp garam masala ",
            "1 tsp powdered dry ginger ",
            "1/4 tsp powdered black pepper ",
            "1/4 tsp chilli powder ",
            "1 tsp chaat masala."
        ],
        "instructions": [
            "For sonth ki chutney: ",
            "Strain the tamarind through a strainer, adding water, to facilitate this. ",
            "Add enough water to make it into a pouring consistency. ",
            "Mix\n in the rest of the ingredients and bring to a boil, lower the heat, and\n let it simmer, stirring occasionally, till it thickens a bit.",
            "For the water:",
            "Mix all the ingredients together, chill and serve. "
        ],
        "cook_time": "20 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Gimlet",
        "ingredients": [
            "50 ml gin ",
            "25 ml lime cordial ",
            "1 lemon wedge"
        ],
        "instructions": [
            "Pour gin and lime cordial into a shaker with ice. ",
            "shake well and pour the mixture out into a chilled glass. ",
            "Garnish with a lemon wedge to serve."
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Aam Ras",
        "ingredients": [
            "500 gm mango pulp ",
            "1 tsp cardamom powder ",
            "1 tsp powdered sugar ",
            "1 tsp water ",
            "30 ml lime juice ",
            "20 gm chaat masala powder ",
            "5 gm crushed cumin"
        ],
        "instructions": [
            "Mix all the ingredients and add enough sugar and water to get the desired sweetness and consistency. ",
            "Chill it and serve garnished with mint leaves."
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Gin Fizz",
        "ingredients": [
            "50 ml gin ",
            "25 ml lemon juice ",
            "12.5 ml sugar syrup ",
            "Soda water"
        ],
        "instructions": [
            "Mix together gin, lemon juice, sugar syrup with ice, shake well. ",
            "Strain into a glass topped with ice and soda water."
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Jaswant Sherbat",
        "ingredients": [
            "1 kg sugar ",
            "3 litres water ",
            "2 Tbsp milk ",
            "2 Tbsp lemon juice ",
            "3 cups hibiscus-broken petal"
        ],
        "instructions": [
            "Dissolve the sugar in the water, not letting it come to a boil. ",
            "When sugar is dissolved, increase the heat and bring to a boil. ",
            "Add the milk and continue to cook till scum forms on the sides, which you should skim off. ",
            "Add the lemon juice and continue to cook till one thread consistency is reached. ",
            "Turn off the heat and add the flowers, and cover immediately. ",
            "Leave it overnight. ",
            "Strain and store in bottles."
        ],
        "cook_time": "Overnight",
        "cuisine": "beverages"
    },
    {
        "name": "Rum Punch",
        "ingredients": [
            "50 ml rum ",
            "25 ml lemon juice ",
            "200 ml pineapple juice ",
            "100 ml peach juice ",
            "12.5 ml sugar syrup",
            "2 dashes of Angostura Bitters soda water"
        ],
        "instructions": [
            "Shake with ice and pour entire contents into a tall \nglass.",
            "Top with soda.",
            "Garnish with a slice of pineapple and a cherry."
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Ginger Fizz",
        "ingredients": [
            "100 gm coarsely grated ginger juice ",
            "6 limes ",
            "350 gm sugar ",
            "450 ml water ",
            "2 cloves ",
            "1\" stick cinnamon ",
            "1/2 tsp coriander seeds and soda to dilute ice-cubes"
        ],
        "instructions": [
            "Combine ginger with lime juice in a jar. Seal with lid and place in sunshine for 2 days. ",
            "Strain through muslin. ",
            "Dissolve sugar in water with spices.  Boil for five minutes. ",
            "Cool and strain. ",
            "Place 1 Tbsp ginger juice in glass. ",
            "Sweeten with spiced syrup.  Top up with soda and ice-cubes."
        ],
        "cook_time": "10 Minutes + Preparation time (2 days)",
        "cuisine": "beverages"
    },
    {
        "name": "Mango Squash",
        "ingredients": [
            "1 kg sugar ",
            "1/4 cup lemon juice ",
            "Mango juice (mango pulp, strained through a fine sieve) ",
            "1 kg mangoes for the juice"
        ],
        "instructions": [
            "Method- 1 ",
            "Add together sugar, lemon juice and mango juice in a pan.",
            "Cover the pan and place it under the sun for a few days.",
            "Ensure giving it a stir at least 3-4 times a day.",
            "When dissolved, store in clean bottles.   Method- 2",
            "Add 4 cups sugar and 2 cups water in a pan.",
            "Bring to a boil.",
            "Make sure that the contents are dissolved completely.",
            "Cook over high heat or till one-thread consistency is reached. ",
            "Take it off the heat and mix in the lemon and mango juice. ",
            "Store in sterilized air tight bottles."
        ],
        "cook_time": "15 Minutes + Storage Time(4 days)",
        "cuisine": "beverages"
    },
    {
        "name": "Chocolate Cake in a Pressure Cooker",
        "ingredients": [
            "1 cup flour  ",
            "1/4 cup cocoa powder  ",
            "1 1/4 tsp baking powder",
            "1/4 cup butter",
            "3/4 cup caster sugar",
            "1/4 cup water  ",
            "2 eggs  ",
            "1/2 tsp vanilla essence",
            "1/8 tsp salt  ",
            "6 inch round greased baking tin"
        ],
        "instructions": [
            "In a mixing bowl, sift the flour, cocoa powder and baking powder. ",
            "Add in the butter, sugar, salt, water and vanilla, and beat the ingredients using a whisk.     ",
            "Add the eggs and beat the batter until smooth. ",
            "Transfer into the baking tin.    ",
            "Heat the pressure cooker, covered with the lid but without the pressure, for 3-4 minutes on high heat, then place the cake tin in the empty cooker (do not add water in the cooker).     ",
            "Close the lid (without the pressure), lower the flame and let it cook until done (about 30 minutes)."
        ],
        "cook_time": "1 Hour",
        "cuisine": "beverages"
    },
    {
        "name": "Honey Chilli Potatoes",
        "ingredients": [
            "For the potatoes:",
            "2 potatoes, peeled and sliced",
            "3-4 Tbsp cornflour or maida",
            "Salt to taste",
            "1 tsp red chilli powder",
            "Oil, for deep frying",
            "For the base:",
            "1 tsp oil",
            "2 spring onions (with stalk), sliced",
            "1 Tbsp garlic paste",
            "1 capsicum, sliced",
            "2 Tbsp honey",
            "Salt, to taste",
            "1/4 tsp soya sauce",
            "3 tsp white sesame seeds",
            "2 tsp chilli sauce"
        ],
        "instructions": [
            "For the potatoes:",
            "In a bowl, add cornflour or maida, salt and red chilli powder.",
            "Add the sliced potatoes and mix well until the potatoes are coated.",
            "Heat oil in a wok and deep fry the potatoes until golden. Keep aside.",
            "For the Base:",
            "In a wok, add oil, garlic paste and spring onions. Saute on high heat for 1 minute.",
            "Add capsicum, honey, salt, soya sauce, chilli sauce. Saute for 2-3 minutes.",
            "Add the deep-fried potatoes and sesame seeds. Mix well and serve hot."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Vegetable Momos",
        "ingredients": [
            "For Dough:",
            "2 cups maida",
            "1/2 tsp salt ",
            "1/2 tsp baking powder   ",
            "For Filling: ",
            "1 cup carrots - grated ",
            "1 cup cabbage - grated ",
            "1 Tbsp oil ",
            "1/2 cup onion - finely chopped ",
            "1 tsp garlic - chopped  ",
            "1 tsp Soya sauce ",
            "Salt ",
            "1/4 tsp vinegar ",
            "1/4 tsp black pepper"
        ],
        "instructions": [
            "Mix the maida, salt and baking powder and knead to a stiff dough with water. ",
            "Heat oil and add the onion and garlic. ",
            "Saute over high heat and add the carrot and cabbage. Turn around over high heat till glossy. ",
            "Take it off the heat and mix in the Soya sauce, salt, vinegar and black pepper. ",
            "Roll the dough thin (translucent) and cut into 4\"-5\" rounds. ",
            "Take a round, wet edges and place some filling in the center. ",
            "Bring edges together to cover the filling. Twist to seal and fill the rest in the same way. ",
            "Steam for about 10 minutes and serve with soya sauce and chilli sauce."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Chole Bhature",
        "ingredients": [
            "For chole:",
            "2 cup chickpeas (channas)",
            "2 tsp oil",
            "1 bay leaf (tej patta)",
            "1 stick cinnamon (dalchini)",
            "3-4 cloves (laung)",
            "1 tsp whole pepper corns (sabut kali mirch)",
            "3 green cardamom  (choti elaichi)",
            "2 black cardamom (badi elaichi)",
            "1 tsp turmeric powder (haldi)",
            "1 tsp chili powder (lal mirch powder)",
            "1 tsp coriander powder (dhaniya powder)",
            "1 tsp cumin powder (zeera powder)",
            "1 tsp cumin seeds (zeera)",
            "1/2 tsp asafoetida (heeng)",
            "Salt to taste",
            "1 cup onions (chopped)",
            "1 cup tomatoes (chopped)",
            "1 tsp ginger (chopped)",
            "1 tsp garlic (chopped)",
            "1 tsp ajwain",
            "1 tsp lime juice",
            "1 green chili (chopped)                      1 tea bag                                                1 Tbsp butter",
            "For the bhaturas:",
            "2 cups maida (refined flour)",
            "1/2 tsp yeast, dissolved for 10 minutes in luke warm water",
            "1/2 cup whole wheat flour",
            "A pinch of salt",
            "Water to knead",
            "Oil for frying"
        ],
        "instructions": [
            "For chole:",
            "In a pan add oil, bay leaf, cinnamon, cumin seeds, cloves, whole pepper corns, green and black cardamom.",
            "After it gets brown add chopped onions and saute it.",
            "After sauteing add chopped ginger and garlic.",
            "Then add turmeric, chili powder, coriander powder, cumin powder, asafoetida, salt and fry well.",
            "For de glazing the pan add little water.",
            "Now add the chole (soaked overnight and pressure cooked) to the masala.",
            "After stirring well add tomatoes, little sugar and salt to the chole (chickpeas)",
            "Now add ajwain, chopped green chilies and water for the base.",
            "To get the color in the chole, add a tea bag to the masala.",
            "Simmer the chole gently for an hour and cover it.",
            "Add lime juice and a dollop of butter to it.",
            "Garnish the chole with coriander and butter.",
            "Serve the chole hot with bhaturas.",
            "For the bhaturas:",
            "Knead the whole wheat flour, maida and salt together with adequate amount of water.",
            "Sprinkle the yeast on top. Leave it for 2-3 hours for the yeast to work.",
            "Divide it into equal portions. Roll out in an oval or round shape.",
            "Deep fry till golden brown, like a puri.",
            "Serve. "
        ],
        "cook_time": "1 Hour",
        "cuisine": "beverages"
    },
    {
        "name": "Quick Chicken Curry",
        "ingredients": [
            "1 kg chicken",
            "3 large onions, paste",
            "2 large tomatoes, pureed",
            "1 Tbsp garlic paste",
            "1 Tbsp ginger paste",
            "2 tsp coriander powder",
            "2 tsp cumin powder",
            "1/2 tsp turmeric powder",
            "1/2 tsp red chilli powder",
            "1 tsp garam masala powder",
            "2 Tbsp oil",
            "Salt to taste",
            "Chopped coriander for garnish"
        ],
        "instructions": [
            "Heat oil in a pan and sauté the onion paste, garlic & ginger paste till golden brown.",
            "Add tomato puree. When the tomato puree dries up, add coriander powder, cumin powder, garam masala, red chilli powder, turmeric powder and salt. Let the spices cook.",
            "Add chicken pieces into the masala. Stir well and cook till they are golden brown.",
            "Add 1/2 cup of water and stir. Cover with a lid and let it simmer till the chicken is cooked.",
            "Garnish with chopped coriander and serve."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Butter Chicken",
        "ingredients": [
            "700 gm raw chicken  ",
            "For theMarinade:",
            "1 tsp red chilli powder ",
            "1 tsp ginger and garlic paste ",
            "Salt to taste ",
            "1/2 kg curd  ",
            "For theGravy:",
            "175 gm white butter ",
            "1/2 tsp black cumin seeds ",
            "1/2 kg tomato, pureed ",
            "1/2 tsp sugar ",
            "1 tsp red chilli powder ",
            "Salt to taste ",
            "100 gm fresh cream ",
            "4 green chillies, sliced",
            "1/2 tsp fenugreek leaves, crushed"
        ],
        "instructions": [
            "For marinating the chicken",
            "In a mixing bowl, mix red chilli powder, ginger garlic paste, salt and curd.  ",
            "Add the raw chicken pieces to the marinade and mix well. Keep it in the refrigerator overnight or minimum 6 hours.  ",
            "Roast the marinated chicken in a tandoor or an oven for about 10-12 minutes until it is three-fourth done.  ",
            "For the chicken gravy",
            "Heat half the quantity of white butter in pan. ",
            "Pour in the tomato puree, and saute for 2-3 minutes. Add cumin seeds, sugar, red chilli powder and salt. Mix well.  ",
            "Add the prepared chicken, white butter, fresh cream, sliced green chillies and crushed fenugreek leaves.  Saute for 3-4 minutes and let the chicken cook.",
            "Cook till chicken is done. Serve hot with rice or naan."
        ],
        "cook_time": "30 Minutes + Marination time (overnight)",
        "cuisine": "beverages"
    },
    {
        "name": "Screwdriver",
        "ingredients": [
            "60 ml vodka ",
            "Crushed ice ",
            "Orange juice, half a glass"
        ],
        "instructions": [
            "Fill glass with crushed ice and pour the vodka over it. ",
            "Now fill the glass with orange juice.",
            "Garnish with mint leaves or any garnish of choice and serve."
        ],
        "cook_time": "10 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Hot Fruit Punch",
        "ingredients": [
            "1/2 litre orange juice ",
            "250 ml apple juice ",
            "1/2 litre weak tea ",
            "1 inch pieces of sliced ginger ",
            "2 sticks cinnamon ",
            "Grated nutmeg ",
            "Stick mace ",
            "6-8 cloves ",
            "3 Tbsp grated jaggery ",
            "60 ml lemon juice",
            "Peel 1 orange ",
            "1 sliced red apple ",
            "3 segmented oranges"
        ],
        "instructions": [
            "Combine all the ingredients in a pan, except lemon juice and fruit. ",
            "Bring to a simmer. ",
            "Add lemon juice and fruit. ",
            "Serve immediately."
        ],
        "cook_time": "15 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Orange Liquer",
        "ingredients": [
            "3 oranges ",
            "1/3 cup sugar",
            "3 cups vodka"
        ],
        "instructions": [
            "Wash the fruit well and wipe dry. ",
            "Prick with a needle in two places and \nplace them in a clean jar.   ",
            "Fill 1/4 of the jar with it. ",
            "Now cover with\n a thick layer of sugar and mix well. ",
            "Cover again with a layer of sugar \nand then fill the jar with vodka. ",
            "Keep for about 2 months.",
            "Stir everyday till the sugar dissolves. ",
            "Drain through a thin cloth and store."
        ],
        "cook_time": "20 Minutes + Time to set(1month) ",
        "cuisine": "beverages"
    },
    {
        "name": "Aam Rass",
        "ingredients": [
            "1 kg mangoes - ripe and fresh ",
            "1 cup sugar ",
            "1 cup cold milk and crushed ice"
        ],
        "instructions": [
            "Peel and chop the mangoes and blend it in a food processor along with the sugar. ",
            "Strain the mixture. ",
            "Mix in the milk and pour into glasses filled upto 1/4 with crushed ice. ",
            "Note: In case you like it thinner, dilute it with milk, according to taste."
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Guava Thandai",
        "ingredients": [
            "1 1/2 cup milk ",
            "4 Tbsp thandai mixture",
            "1 full pack guava juice",
            "Ice cubes"
        ],
        "instructions": [
            "Pour the thandai mixture in a jar. ",
            "Add some milk and a full pack of real guava juice. ",
            "Put some ice cubes, give it a nice stir.",
            "Serve chilled!",
            "For thandai mixture",
            ""
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Ginger Litchi Lemonade",
        "ingredients": [
            "1/2 cup ginger (minced)",
            "1/2 cup fresh lemon juice ",
            "Some ice cubes",
            "1 glass lychee juice ",
            "1 cup grapes",
            "1/2 cup chia seeds",
            "Mint leaves",
            "Pinch of salt"
        ],
        "instructions": [
            "In a jar, put minced ginger, lemon juice and lychee juice.",
            "Add some ice, salt to taste and blend it well.",
            "Pour it in a jar. Add sliced grapes and chia seeds to it. Mix it well with spoon.",
            "Finally garnish it with some mint leaves and serve chilled.  "
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Chocolate Hazelnut Milkshake",
        "ingredients": [
            "1 cup cocoa powder",
            "2 Tbsp hazelnut paste",
            "1 cup cream",
            "1 cup milk",
            "Chocolate for garnish ",
            "Some nuts like hazelnut or almonds- whatever available"
        ],
        "instructions": [
            "Add cocoa powder, hazelnut paste, cream, a little milk and some ice cubes.",
            "Blend all the ingredients together. ",
            "Pour the concoction in a glass. Garnish it with some chocolate shavings and few nicely sliced hazelnuts or almonds.",
            ""
        ],
        "cook_time": "15 Minutes ",
        "cuisine": "beverages"
    },
    {
        "name": "Strawberry & Guava Smoothie",
        "ingredients": [
            "6-8 fresh strawberries ",
            "1 real pink guava juice ",
            "1 glass milk",
            "1 1/2 Tbsp honey ",
            "Sugar to taste"
        ],
        "instructions": [
            "Slice the strawberries (or add any fruit of your choice). ",
            "Add real pink guava juice, milk, honey and some ice cubes. ",
            "Blend all the ingredients together. Pour it in a glass and serve it chilled."
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Ananas da Panna",
        "ingredients": [
            "4 fresh pineapple ",
            "1/2 tsp black pepper powder ",
            "1/2 tsp roasted cumin powder ",
            "1/2 tsp black salt ",
            "1 lemon juice ",
            "1/4 cup sugar ",
            "Fresh chopped mint to garnish"
        ],
        "instructions": [
            "Roast the fresh pineapple until it is well cooked on a gas or on a grill. ",
            "Peel it and cut into small size cubes. ",
            "Take out the juice of the pineapple. ",
            "Add all ingredients to it. ",
            "Squeeze-in the lemon. ",
            "Serve chilled garnished with roasted cumin and chopped mint."
        ],
        "cook_time": "15 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Fresh Lime Soda",
        "ingredients": [
            "1/2 cup lemon juice ",
            "1/4 cup (60 gm) sugar-powdered ",
            "3 cups soda ",
            "1 cup crushed ice",
            " A few mint leaves for garnish, optional"
        ],
        "instructions": [
            "Blend the lemon juice, sugar and soda together, till the sugar dissolves.",
            "Divide the ice into four glasses, pour the nimbu paani over it, and serve, garnish with the mint leaves."
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Mint Lassi",
        "ingredients": [
            "300 ml curd ",
            "2 Tbsp sugar ",
            "1 Tbsp dried mint",
            "Roasted ground cumin ",
            "1 tray of ice cubes "
        ],
        "instructions": [
            "Add curd in a container. ",
            "Add sugar and add dried mint and mix it well.",
            "Add a few ice cubes. ",
            "And garnish with a little ground cumin and fresh mint leaves.",
            ""
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Watermelon Ice",
        "ingredients": [
            "200 gm watermelon ",
            "Crushed black rock salt to taste ",
            "1/2 tsp kewda",
            "1 tsp dried mint leaves ",
            "Pomegranate syrup to taste"
        ],
        "instructions": [
            "Peel and deseed the watermelon. ",
            "Add rock salt, kewra and mint and blend completely. ",
            "Freeze until half frozen.   ",
            "Pour into glasses and top with some pomegranate syrup."
        ],
        "cook_time": "15 Minutes + Time to chill",
        "cuisine": "beverages"
    },
    {
        "name": "Iced Mint and Lime Tea",
        "ingredients": [
            "1 tea bag ",
            "300 ml boiling water ",
            "2 Tbsp mint leaves ",
            "1 lime- pared, rind",
            "2 tsp lime juice"
        ],
        "instructions": [
            "Place teabag in a heatproof jug. ",
            "Pour over boiling water, mint leaves \nand lime rind.   ",
            "Cover and allow it to sleep for 30 minutes. ",
            "Strain the \nliquid, chill well. ",
            "Then add lime juice, strips of mint to taste and serve over ice."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Apple Punch",
        "ingredients": [
            "1/2 liter apple juice ",
            "  4 Tbsp lemon juice ",
            " 2\" stick cinnamon    ",
            "1/2 \nginger cube    ",
            "3 cloves    ",
            "1 strip lemon rind ",
            "  Mint sprigs"
        ],
        "instructions": [
            "Add apple juice in a container.",
            "Then add few drops of lime juice into ti. ",
            "Put 2 cinnamon sticks, 1/2  ginger cube, some cloves and lemon strings. Combine the mixture well. ",
            "Chill and garnish it with few mint leaves. ",
            "Serve over ice."
        ],
        "cook_time": "10 Minutes + Time to chill",
        "cuisine": "beverages"
    },
    {
        "name": "Ginger Ale",
        "ingredients": [
            "1/2 cup ginger juice ",
            " 1 cup lemon juice ",
            "2 cups sugar ",
            "2 cups water  \nsoda (carbonated water) ",
            "Crushed ice  ",
            "1 lemon slice ",
            "Mint leaves - for garnish"
        ],
        "instructions": [
            "Dissolve the sugar in the water over low heat, increase the heat after sometime and \nbring it to boil after the sugar dissolves.   ",
            "Cook, till the syrup \nthickens a little - about 1 thread.   ",
            "Shut off the heat and add the ginger\n and lemon juice, mix well and store in an airtight sterilized bottle.  \n ",
            "To serve, pour 3-4 Tbsp of syrup in a glass, add crushed ice and \nsoda/water and mix well.   ",
            "Garnish with the lemon slice and mint leaves \nand serve."
        ],
        "cook_time": "15 Minutes + Time to set",
        "cuisine": "beverages"
    },
    {
        "name": "Lemon Squash",
        "ingredients": [
            "2 cups sugar",
            "2 glass water",
            "4 Tbsp lemon juice"
        ],
        "instructions": [
            "Fill a bottle with sugar and pour lemon juice to come up till the top. \n",
            "Sun it for a few days, shaking the bottle 3-4 times a day, till totally \ndissolved. When dissolved, you use it.   ",
            "Alternatively put 4 cups sugar \nand 3 cups water in a pan and dissolved sugar, by stirring over low \nheat.     ",
            "When dissolved, bring to a boil and cook for about 5 minutes \nover high heat or till one-thread consistency is reached.     ",
            "Take it \noff the heat and mix in 1-1/1/2 cups of lemon juice (according to \ntaste), store in sterilized air tight bottles."
        ],
        "cook_time": "10 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Iced Jaljeera",
        "ingredients": [
            "125 gm tamarind pulp ",
            "3 Tbsp mint leaves ",
            "1/2 tsp ground cumin ",
            "3/4 tsp \nroasted ground cumin ",
            "50 gm grated jaggery ",
            "4 tsp black salt ",
            "1 Tbsp grated\n ginger salt(gourmet flavoured salt) to taste ",
            "3-4 Tbsp lemon juice ",
            "A pinch of chilli powder (kashmiri mirch)",
            "1/2 tsp garam masala",
            "1.5 liter water"
        ],
        "instructions": [
            "For the jaljeera, add all the ingredients in a food processor and blend it together.   ",
            "Chill overnight. Then strain and freeze it.",
            "Garnish the drink with some boondis and serve. "
        ],
        "cook_time": "15 Minutes + Time to chill",
        "cuisine": "beverages"
    },
    {
        "name": "Masalewali Chai",
        "ingredients": [
            "3/4 cup water ",
            "1/2 cup milk ",
            "2 tsp tea leaves  ",
            "1/2 tsp finely chopped ginger ",
            "2 tsp sugar or to taste",
            "1/2 tsp chai masala"
        ],
        "instructions": [
            "Bring the water to a boil. Add the tea leaves and ginger \nand simmer for a minute.",
            "Add the chai masala. For chai masala, grind equal quantities of star anise (badiyan), cinnamon (dal chini), laung (cloves) and elaichi (cardamom). (In this case, one or two of each)",
            "Add the milk and sugar, let it come to a boil\n once more, and then strain it into the cups, and serve. This one is usually allowed to simmer for little longer."
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Chocolate Cake in a Pressure Cooker",
        "ingredients": [
            "1 cup flour  ",
            "1/4 cup cocoa powder  ",
            "1 1/4 tsp baking powder",
            "1/4 cup butter",
            "3/4 cup caster sugar",
            "1/4 cup water  ",
            "2 eggs  ",
            "1/2 tsp vanilla essence",
            "1/8 tsp salt  ",
            "6 inch round greased baking tin"
        ],
        "instructions": [
            "In a mixing bowl, sift the flour, cocoa powder and baking powder. ",
            "Add in the butter, sugar, salt, water and vanilla, and beat the ingredients using a whisk.     ",
            "Add the eggs and beat the batter until smooth. ",
            "Transfer into the baking tin.    ",
            "Heat the pressure cooker, covered with the lid but without the pressure, for 3-4 minutes on high heat, then place the cake tin in the empty cooker (do not add water in the cooker).     ",
            "Close the lid (without the pressure), lower the flame and let it cook until done (about 30 minutes)."
        ],
        "cook_time": "1 Hour",
        "cuisine": "beverages"
    },
    {
        "name": "Honey Chilli Potatoes",
        "ingredients": [
            "For the potatoes:",
            "2 potatoes, peeled and sliced",
            "3-4 Tbsp cornflour or maida",
            "Salt to taste",
            "1 tsp red chilli powder",
            "Oil, for deep frying",
            "For the base:",
            "1 tsp oil",
            "2 spring onions (with stalk), sliced",
            "1 Tbsp garlic paste",
            "1 capsicum, sliced",
            "2 Tbsp honey",
            "Salt, to taste",
            "1/4 tsp soya sauce",
            "3 tsp white sesame seeds",
            "2 tsp chilli sauce"
        ],
        "instructions": [
            "For the potatoes:",
            "In a bowl, add cornflour or maida, salt and red chilli powder.",
            "Add the sliced potatoes and mix well until the potatoes are coated.",
            "Heat oil in a wok and deep fry the potatoes until golden. Keep aside.",
            "For the Base:",
            "In a wok, add oil, garlic paste and spring onions. Saute on high heat for 1 minute.",
            "Add capsicum, honey, salt, soya sauce, chilli sauce. Saute for 2-3 minutes.",
            "Add the deep-fried potatoes and sesame seeds. Mix well and serve hot."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Vegetable Momos",
        "ingredients": [
            "For Dough:",
            "2 cups maida",
            "1/2 tsp salt ",
            "1/2 tsp baking powder   ",
            "For Filling: ",
            "1 cup carrots - grated ",
            "1 cup cabbage - grated ",
            "1 Tbsp oil ",
            "1/2 cup onion - finely chopped ",
            "1 tsp garlic - chopped  ",
            "1 tsp Soya sauce ",
            "Salt ",
            "1/4 tsp vinegar ",
            "1/4 tsp black pepper"
        ],
        "instructions": [
            "Mix the maida, salt and baking powder and knead to a stiff dough with water. ",
            "Heat oil and add the onion and garlic. ",
            "Saute over high heat and add the carrot and cabbage. Turn around over high heat till glossy. ",
            "Take it off the heat and mix in the Soya sauce, salt, vinegar and black pepper. ",
            "Roll the dough thin (translucent) and cut into 4\"-5\" rounds. ",
            "Take a round, wet edges and place some filling in the center. ",
            "Bring edges together to cover the filling. Twist to seal and fill the rest in the same way. ",
            "Steam for about 10 minutes and serve with soya sauce and chilli sauce."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Chole Bhature",
        "ingredients": [
            "For chole:",
            "2 cup chickpeas (channas)",
            "2 tsp oil",
            "1 bay leaf (tej patta)",
            "1 stick cinnamon (dalchini)",
            "3-4 cloves (laung)",
            "1 tsp whole pepper corns (sabut kali mirch)",
            "3 green cardamom  (choti elaichi)",
            "2 black cardamom (badi elaichi)",
            "1 tsp turmeric powder (haldi)",
            "1 tsp chili powder (lal mirch powder)",
            "1 tsp coriander powder (dhaniya powder)",
            "1 tsp cumin powder (zeera powder)",
            "1 tsp cumin seeds (zeera)",
            "1/2 tsp asafoetida (heeng)",
            "Salt to taste",
            "1 cup onions (chopped)",
            "1 cup tomatoes (chopped)",
            "1 tsp ginger (chopped)",
            "1 tsp garlic (chopped)",
            "1 tsp ajwain",
            "1 tsp lime juice",
            "1 green chili (chopped)                      1 tea bag                                                1 Tbsp butter",
            "For the bhaturas:",
            "2 cups maida (refined flour)",
            "1/2 tsp yeast, dissolved for 10 minutes in luke warm water",
            "1/2 cup whole wheat flour",
            "A pinch of salt",
            "Water to knead",
            "Oil for frying"
        ],
        "instructions": [
            "For chole:",
            "In a pan add oil, bay leaf, cinnamon, cumin seeds, cloves, whole pepper corns, green and black cardamom.",
            "After it gets brown add chopped onions and saute it.",
            "After sauteing add chopped ginger and garlic.",
            "Then add turmeric, chili powder, coriander powder, cumin powder, asafoetida, salt and fry well.",
            "For de glazing the pan add little water.",
            "Now add the chole (soaked overnight and pressure cooked) to the masala.",
            "After stirring well add tomatoes, little sugar and salt to the chole (chickpeas)",
            "Now add ajwain, chopped green chilies and water for the base.",
            "To get the color in the chole, add a tea bag to the masala.",
            "Simmer the chole gently for an hour and cover it.",
            "Add lime juice and a dollop of butter to it.",
            "Garnish the chole with coriander and butter.",
            "Serve the chole hot with bhaturas.",
            "For the bhaturas:",
            "Knead the whole wheat flour, maida and salt together with adequate amount of water.",
            "Sprinkle the yeast on top. Leave it for 2-3 hours for the yeast to work.",
            "Divide it into equal portions. Roll out in an oval or round shape.",
            "Deep fry till golden brown, like a puri.",
            "Serve. "
        ],
        "cook_time": "1 Hour",
        "cuisine": "beverages"
    },
    {
        "name": "Quick Chicken Curry",
        "ingredients": [
            "1 kg chicken",
            "3 large onions, paste",
            "2 large tomatoes, pureed",
            "1 Tbsp garlic paste",
            "1 Tbsp ginger paste",
            "2 tsp coriander powder",
            "2 tsp cumin powder",
            "1/2 tsp turmeric powder",
            "1/2 tsp red chilli powder",
            "1 tsp garam masala powder",
            "2 Tbsp oil",
            "Salt to taste",
            "Chopped coriander for garnish"
        ],
        "instructions": [
            "Heat oil in a pan and sauté the onion paste, garlic & ginger paste till golden brown.",
            "Add tomato puree. When the tomato puree dries up, add coriander powder, cumin powder, garam masala, red chilli powder, turmeric powder and salt. Let the spices cook.",
            "Add chicken pieces into the masala. Stir well and cook till they are golden brown.",
            "Add 1/2 cup of water and stir. Cover with a lid and let it simmer till the chicken is cooked.",
            "Garnish with chopped coriander and serve."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Butter Chicken",
        "ingredients": [
            "700 gm raw chicken  ",
            "For theMarinade:",
            "1 tsp red chilli powder ",
            "1 tsp ginger and garlic paste ",
            "Salt to taste ",
            "1/2 kg curd  ",
            "For theGravy:",
            "175 gm white butter ",
            "1/2 tsp black cumin seeds ",
            "1/2 kg tomato, pureed ",
            "1/2 tsp sugar ",
            "1 tsp red chilli powder ",
            "Salt to taste ",
            "100 gm fresh cream ",
            "4 green chillies, sliced",
            "1/2 tsp fenugreek leaves, crushed"
        ],
        "instructions": [
            "For marinating the chicken",
            "In a mixing bowl, mix red chilli powder, ginger garlic paste, salt and curd.  ",
            "Add the raw chicken pieces to the marinade and mix well. Keep it in the refrigerator overnight or minimum 6 hours.  ",
            "Roast the marinated chicken in a tandoor or an oven for about 10-12 minutes until it is three-fourth done.  ",
            "For the chicken gravy",
            "Heat half the quantity of white butter in pan. ",
            "Pour in the tomato puree, and saute for 2-3 minutes. Add cumin seeds, sugar, red chilli powder and salt. Mix well.  ",
            "Add the prepared chicken, white butter, fresh cream, sliced green chillies and crushed fenugreek leaves.  Saute for 3-4 minutes and let the chicken cook.",
            "Cook till chicken is done. Serve hot with rice or naan."
        ],
        "cook_time": "30 Minutes + Marination time (overnight)",
        "cuisine": "beverages"
    },
    {
        "name": "Badaam ka Sharbat",
        "ingredients": [
            "120 gm almonds-soaked overnight and peeled ",
            "8 green cardamoms -crushed, \ncooked in water and strained ",
            "1 tsp almond essence ",
            "3 cups sugar ",
            "2 cups \nwater ",
            "1 tsp kewda essence ",
            "1/8 tsp potassium meta bi-sulphite(potassium salt of bisulfate anion)"
        ],
        "instructions": [
            "Add a little water (enough to facilitate blending) to the almonds and \nblend to a fine paste. ",
            "Strain through a fine sieve or muslin cloth and\n add some more water to the left-over almonds and blend and strain \nagain. ",
            "Make the liquid up-to 2 cups, by adding water if necessary.   ",
            "Add \nsugar to the strained almond liquid and dissolve over low heat. ",
            "When it \ndissolves, increase the heat and bring to a boil and let the syrup cook.\n",
            "Keep skimming off the scum as it cooks.   ",
            "Cook till a drop of syrup \npressed between two fingers, forms a thread (one-thread consistency).   \n",
            "Add the cardamom extract and the kewda essence. Strain through a \nmuslin cloth and cool.   ",
            "When cool, mix the potassium in a little of the\n syrup first and then add to the whole lot. ",
            "Store in clean airtight \nbottles."
        ],
        "cook_time": "20 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Badaam Milk",
        "ingredients": [
            "1 cup chilled milk ",
            "1/4 cup condendsed milk ",
            "1/4 cup almonds ",
            "Pinch of elaichi powder ",
            "1/4 cup ice-crushed"
        ],
        "instructions": [
            "Place the almonds in a bowl and pour boiling water over. Leave for half \nan hour. ",
            "Peel the almonds and Chop half the almonds fine and place the other half in a \nblender. ",
            "Place the milk, condensed milk, elaichi powder and ice in the blender too. ",
            "Blend till well mixed and serve garnished with the chopped almonds."
        ],
        "cook_time": "20 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Fruity Crush",
        "ingredients": [
            "45 ml fresh lime juice  ",
            "20 ml sugar syrup ",
            "Pinch of salt ",
            "Pineapple crush or fresh pineapple puree ",
            "30 ml crushed ice sweet rim   ",
            "Note:\n For a sweet rim, cut a slice of pineapple and drench it in castor \nsugar. ",
            "Then turn a glass upside down and put the rim of the glass on the\n sugared pineapple slice so that the sugar sticks onto the rim of the \nglass."
        ],
        "instructions": [
            "Add lime juice in a container.",
            "Then add pineapple puree or crush, sugar syrup and salt into a shaker.",
            "Mixed the mixture properly. ",
            "Chill and serve over ice."
        ],
        "cook_time": "15 Minutes + Time to chill",
        "cuisine": "beverages"
    },
    {
        "name": "Cold Coffee",
        "ingredients": [
            "2 cups espresso shots",
            "Crushed ice",
            "4 Tbsp condensed milk",
            "1 cup milk"
        ],
        "instructions": [
            "Take some espresso, crushed ice, condensed milk and 1 cup of regular milk.",
            "Throw them all in a blender.",
            "Blend it for a few minutes and served chilled."
        ],
        "cook_time": "5 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Banana & Honey Smoothie",
        "ingredients": [
            "400 ml yogurt, frozen ",
            "2 bananas, frozen",
            "3 tsp honey",
            "2 tsp pumpkin seeds ",
            "10 ml water "
        ],
        "instructions": [
            "Peel the bananas. Put yogurt and bananas in a blender ",
            "Add 2 tsp of honey. Add 2 tsp of pumpkin seeds. Add a dash of water ",
            "Give it a good whisk till smooth.",
            "Pour in a tall cold glass.",
            "Garnish with pumpkin seeds and honey."
        ],
        "cook_time": "10  Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Smoked Melon Martini",
        "ingredients": [
            "60 ml grey goose",
            "8 smoked cantaloupe melon roundels",
            "Fresh mint - few sprigs"
        ],
        "instructions": [
            "Blend with crushed ice.",
            "Double strain in a chilled martini glass"
        ],
        "cook_time": "5 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Beauty Drink Lemona",
        "ingredients": [
            "5 lemons whole",
            "3 bunches mint",
            "1/2 cup honey",
            "Crushed ice"
        ],
        "instructions": [
            "Blitz all the ingredients along with lots of crushed ice in a blender and serve chilled. "
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Irish Cream Liquer",
        "ingredients": [
            "1 cup light cream",
            "14 oz sweetened condensed milk (400 ml approx)",
            "1 2/3 cup Irish whiskey (Here Jameson's is used)",
            "1 tsp instant coffee",
            "2 Tbsp Hershey's chocolate syrup",
            "1 tsp vanilla",
            "1 tsp almond extract"
        ],
        "instructions": [
            "Combine all ingredients in a blender and set on high speed for 30 seconds.",
            "Bottle in a tightly sealed container and refrigerate. Shake before using.",
            "Will keep for up to 2 months.",
            "Tip: Add mint essence and you have mint baileys."
        ],
        "cook_time": "5 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Pomegranate Juice",
        "ingredients": [
            "1 fresh leaf aloe vera",
            "1/2 cup beetroot, chopped",
            "2 cups pomegranate juice or amla juice (Indian gooseberry)",
            "1/4 tsp black pepper powder",
            "1/4 tsp Lavan Bhaskar churan (optional)"
        ],
        "instructions": [
            "Take a sharp knife and carefully peel the rind from the aloe vera plant leaves and discard the rind. Peel the yellow layer just beneath the rind with a sharp knife and you should be left with approximately 2 Tbsp (30 ml) of clear aloe vera gel. (Clean the gel before adding to the juice.)",
            "In a blender add pomegranate juice, chopped beetroot and blend.",
            "Now add aloe vera gel. Give it a whiz.",
            "Lastly add some black pepper.",
            "Serve.",
            "Note: For better taste and digestive properties, add a pinch of Lavan Bhaskar churan.",
            ""
        ],
        "cook_time": "15 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Radiant Lemonade",
        "ingredients": [
            "1 apple chopped",
            "1 carrot, chopped",
            "1/2 beetroot, sliced",
            "2-3 slices white radish",
            "1/2 tsp lemon zest",
            "2 lemons, juice",
            ""
        ],
        "instructions": [
            "Mix all the ingredients in a blender.",
            "Add little bit of water to adjust the consistency.",
            "Sieve and serve.",
            ""
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Radiant Juice",
        "ingredients": [
            "1 orange",
            "1 apple, chopped",
            "2-3 slices of water melon",
            "1 carrot, chopped",
            "1 small piece of chopped ginger",
            "Some water",
            ""
        ],
        "instructions": [
            "Put all the fruits and ginger in a blender.",
            "Add a dash of water to adjust the consistency and blend well.",
            ""
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Melon and Kiwi Fruit Smoothie",
        "ingredients": [
            "1 kiwi, cut",
            "2-3 slices of papaya",
            "2 slices of melon",
            "A couple of grapes",
            "1 plum, sliced",
            "1 glass milk",
            "1/2 - 1 tsp honey",
            "1/2 cup oats"
        ],
        "instructions": [
            "Mix all the ingredients in a blender and blend well.",
            "Serve chilled.",
            "You can use sugar/honey according to your taste.",
            "Fell free to throw in any fruits that you like."
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Honey-Lemon-Ginger Tea",
        "ingredients": [
            "3 cups water",
            "1 tsp ginger, chopped fine",
            "1 tsp tea leaves, for every cup",
            "1 tsp lemon juice",
            "1 tsp honey"
        ],
        "instructions": [
            "In a pan heat 3 cups of water.",
            "Before it begins to boil add ginger.",
            "Just as it starts to boil add the tea leaves, lemon juice and honey.",
            "Strain it into a cup and enjoy!"
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Strawberry Banana Smoothie",
        "ingredients": [
            "1 glass of milk",
            "1 banana, chopped",
            "1 tsp honey",
            "1 cup strawberries, sliced into halves"
        ],
        "instructions": [
            "In a blender add milk, bananas, honey, a handful of strawberries.",
            "Give this a good blend.",
            "Garnish with a some mint leaves."
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Carribean Passion",
        "ingredients": [
            "30 ml lemon rum",
            "10 ml coconut rum",
            "15 ml passion fruit rum",
            "Some basil leaves",
            "60 ml pineapple juice",
            "2 lemon wedges",
            ""
        ],
        "instructions": [
            "Fill up a martini glass with ice and keep aside.",
            "Crush the basil leave in a can and muddle them.",
            "Add the pine apple juice to it along with some a crushed lemon wedge.",
            "Add the three rums to it.",
            "Shake well.",
            "Remove the ice from the glass and strain this mixture into it."
        ],
        "cook_time": "10 Minutes ",
        "cuisine": "beverages"
    },
    {
        "name": "Chocolate Malt Milkshake",
        "ingredients": [
            "2 cups milk",
            "3-4 cookies",
            "2 Tbsp malt",
            "2 cups chocolate ice cream",
            "1 tsp vanilla essence"
        ],
        "instructions": [
            "In a blender add milk, cookies, malt, ice cream and vanilla essence. Blend.",
            "Pour in a glass and your chocolate milkshake is ready."
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Hot Apple Punch",
        "ingredients": [
            "4 (500 gm) apples, medium    1 Tbsp ginger, coarsely chopped",
            "1/b tsp dal chini (cinnamon), broken",
            "1/2 tsp salt or to taste",
            "1/4 tsp pissi kali mirch (black pepper)",
            "Lemon juice to taste",
            "2 Tbsp pudina (mint) leaves ",
            "Ginger, julienned to taste (optional)"
        ],
        "instructions": [
            "Extract the apple juice along with the ginger.",
            "Put the juice, dalchini, salt and black pepper in a pan and bring to a boil.",
            "Simmer for 2-3 minutes to infuse the flavors.",
            "Divide the pudina and julienne ginger into four cups, and strain the hot liquid over it.",
            "Add a few drops of lemon juice and serve. "
        ],
        "cook_time": "15 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Beetroot Milkshake",
        "ingredients": [
            "2 beetroots, boiled with skin on, peeled and cut into chunks",
            "2 Tbsp sugar syrup",
            "125 ml milk, chilled",
            "1 tsp cinnamon powder",
            "2 scoops vanilla icecream"
        ],
        "instructions": [
            "In a blender puree the beetroot.",
            "Add sugar syrup, milk, crushed ice and cinnamon powder. Blend.",
            "Add vanilla ice cream and mix.",
            "Serve chilled."
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Chocolate Cake in a Pressure Cooker",
        "ingredients": [
            "1 cup flour  ",
            "1/4 cup cocoa powder  ",
            "1 1/4 tsp baking powder",
            "1/4 cup butter",
            "3/4 cup caster sugar",
            "1/4 cup water  ",
            "2 eggs  ",
            "1/2 tsp vanilla essence",
            "1/8 tsp salt  ",
            "6 inch round greased baking tin"
        ],
        "instructions": [
            "In a mixing bowl, sift the flour, cocoa powder and baking powder. ",
            "Add in the butter, sugar, salt, water and vanilla, and beat the ingredients using a whisk.     ",
            "Add the eggs and beat the batter until smooth. ",
            "Transfer into the baking tin.    ",
            "Heat the pressure cooker, covered with the lid but without the pressure, for 3-4 minutes on high heat, then place the cake tin in the empty cooker (do not add water in the cooker).     ",
            "Close the lid (without the pressure), lower the flame and let it cook until done (about 30 minutes)."
        ],
        "cook_time": "1 Hour",
        "cuisine": "beverages"
    },
    {
        "name": "Honey Chilli Potatoes",
        "ingredients": [
            "For the potatoes:",
            "2 potatoes, peeled and sliced",
            "3-4 Tbsp cornflour or maida",
            "Salt to taste",
            "1 tsp red chilli powder",
            "Oil, for deep frying",
            "For the base:",
            "1 tsp oil",
            "2 spring onions (with stalk), sliced",
            "1 Tbsp garlic paste",
            "1 capsicum, sliced",
            "2 Tbsp honey",
            "Salt, to taste",
            "1/4 tsp soya sauce",
            "3 tsp white sesame seeds",
            "2 tsp chilli sauce"
        ],
        "instructions": [
            "For the potatoes:",
            "In a bowl, add cornflour or maida, salt and red chilli powder.",
            "Add the sliced potatoes and mix well until the potatoes are coated.",
            "Heat oil in a wok and deep fry the potatoes until golden. Keep aside.",
            "For the Base:",
            "In a wok, add oil, garlic paste and spring onions. Saute on high heat for 1 minute.",
            "Add capsicum, honey, salt, soya sauce, chilli sauce. Saute for 2-3 minutes.",
            "Add the deep-fried potatoes and sesame seeds. Mix well and serve hot."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Vegetable Momos",
        "ingredients": [
            "For Dough:",
            "2 cups maida",
            "1/2 tsp salt ",
            "1/2 tsp baking powder   ",
            "For Filling: ",
            "1 cup carrots - grated ",
            "1 cup cabbage - grated ",
            "1 Tbsp oil ",
            "1/2 cup onion - finely chopped ",
            "1 tsp garlic - chopped  ",
            "1 tsp Soya sauce ",
            "Salt ",
            "1/4 tsp vinegar ",
            "1/4 tsp black pepper"
        ],
        "instructions": [
            "Mix the maida, salt and baking powder and knead to a stiff dough with water. ",
            "Heat oil and add the onion and garlic. ",
            "Saute over high heat and add the carrot and cabbage. Turn around over high heat till glossy. ",
            "Take it off the heat and mix in the Soya sauce, salt, vinegar and black pepper. ",
            "Roll the dough thin (translucent) and cut into 4\"-5\" rounds. ",
            "Take a round, wet edges and place some filling in the center. ",
            "Bring edges together to cover the filling. Twist to seal and fill the rest in the same way. ",
            "Steam for about 10 minutes and serve with soya sauce and chilli sauce."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Chole Bhature",
        "ingredients": [
            "For chole:",
            "2 cup chickpeas (channas)",
            "2 tsp oil",
            "1 bay leaf (tej patta)",
            "1 stick cinnamon (dalchini)",
            "3-4 cloves (laung)",
            "1 tsp whole pepper corns (sabut kali mirch)",
            "3 green cardamom  (choti elaichi)",
            "2 black cardamom (badi elaichi)",
            "1 tsp turmeric powder (haldi)",
            "1 tsp chili powder (lal mirch powder)",
            "1 tsp coriander powder (dhaniya powder)",
            "1 tsp cumin powder (zeera powder)",
            "1 tsp cumin seeds (zeera)",
            "1/2 tsp asafoetida (heeng)",
            "Salt to taste",
            "1 cup onions (chopped)",
            "1 cup tomatoes (chopped)",
            "1 tsp ginger (chopped)",
            "1 tsp garlic (chopped)",
            "1 tsp ajwain",
            "1 tsp lime juice",
            "1 green chili (chopped)                      1 tea bag                                                1 Tbsp butter",
            "For the bhaturas:",
            "2 cups maida (refined flour)",
            "1/2 tsp yeast, dissolved for 10 minutes in luke warm water",
            "1/2 cup whole wheat flour",
            "A pinch of salt",
            "Water to knead",
            "Oil for frying"
        ],
        "instructions": [
            "For chole:",
            "In a pan add oil, bay leaf, cinnamon, cumin seeds, cloves, whole pepper corns, green and black cardamom.",
            "After it gets brown add chopped onions and saute it.",
            "After sauteing add chopped ginger and garlic.",
            "Then add turmeric, chili powder, coriander powder, cumin powder, asafoetida, salt and fry well.",
            "For de glazing the pan add little water.",
            "Now add the chole (soaked overnight and pressure cooked) to the masala.",
            "After stirring well add tomatoes, little sugar and salt to the chole (chickpeas)",
            "Now add ajwain, chopped green chilies and water for the base.",
            "To get the color in the chole, add a tea bag to the masala.",
            "Simmer the chole gently for an hour and cover it.",
            "Add lime juice and a dollop of butter to it.",
            "Garnish the chole with coriander and butter.",
            "Serve the chole hot with bhaturas.",
            "For the bhaturas:",
            "Knead the whole wheat flour, maida and salt together with adequate amount of water.",
            "Sprinkle the yeast on top. Leave it for 2-3 hours for the yeast to work.",
            "Divide it into equal portions. Roll out in an oval or round shape.",
            "Deep fry till golden brown, like a puri.",
            "Serve. "
        ],
        "cook_time": "1 Hour",
        "cuisine": "beverages"
    },
    {
        "name": "Quick Chicken Curry",
        "ingredients": [
            "1 kg chicken",
            "3 large onions, paste",
            "2 large tomatoes, pureed",
            "1 Tbsp garlic paste",
            "1 Tbsp ginger paste",
            "2 tsp coriander powder",
            "2 tsp cumin powder",
            "1/2 tsp turmeric powder",
            "1/2 tsp red chilli powder",
            "1 tsp garam masala powder",
            "2 Tbsp oil",
            "Salt to taste",
            "Chopped coriander for garnish"
        ],
        "instructions": [
            "Heat oil in a pan and sauté the onion paste, garlic & ginger paste till golden brown.",
            "Add tomato puree. When the tomato puree dries up, add coriander powder, cumin powder, garam masala, red chilli powder, turmeric powder and salt. Let the spices cook.",
            "Add chicken pieces into the masala. Stir well and cook till they are golden brown.",
            "Add 1/2 cup of water and stir. Cover with a lid and let it simmer till the chicken is cooked.",
            "Garnish with chopped coriander and serve."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Butter Chicken",
        "ingredients": [
            "700 gm raw chicken  ",
            "For theMarinade:",
            "1 tsp red chilli powder ",
            "1 tsp ginger and garlic paste ",
            "Salt to taste ",
            "1/2 kg curd  ",
            "For theGravy:",
            "175 gm white butter ",
            "1/2 tsp black cumin seeds ",
            "1/2 kg tomato, pureed ",
            "1/2 tsp sugar ",
            "1 tsp red chilli powder ",
            "Salt to taste ",
            "100 gm fresh cream ",
            "4 green chillies, sliced",
            "1/2 tsp fenugreek leaves, crushed"
        ],
        "instructions": [
            "For marinating the chicken",
            "In a mixing bowl, mix red chilli powder, ginger garlic paste, salt and curd.  ",
            "Add the raw chicken pieces to the marinade and mix well. Keep it in the refrigerator overnight or minimum 6 hours.  ",
            "Roast the marinated chicken in a tandoor or an oven for about 10-12 minutes until it is three-fourth done.  ",
            "For the chicken gravy",
            "Heat half the quantity of white butter in pan. ",
            "Pour in the tomato puree, and saute for 2-3 minutes. Add cumin seeds, sugar, red chilli powder and salt. Mix well.  ",
            "Add the prepared chicken, white butter, fresh cream, sliced green chillies and crushed fenugreek leaves.  Saute for 3-4 minutes and let the chicken cook.",
            "Cook till chicken is done. Serve hot with rice or naan."
        ],
        "cook_time": "30 Minutes + Marination time (overnight)",
        "cuisine": "beverages"
    },
    {
        "name": "Beetroot And Berry Shots",
        "ingredients": [
            "1 kg beetroot",
            "200 gm strawberry or any berry",
            "2 Tbsp olive oil",
            "1 Tbsp rosemary",
            "1 Tbsp chopped parsley",
            "Few drops of balsamic vinegar",
            "Salt and pepper to season"
        ],
        "instructions": [
            "Preheat the oven at 200 degree Celsius. Peel the beetroot and boil till tender, say 20 minutes.",
            "Slice the beetroot. In a mixing bowl, add olive oil, balsamic, rosemary, salt and pepper.",
            "Add the beetroot and mix it well so it is evenly coated.",
            "Arrange on a baking tray and roast it for about 20 minutes or you could simply saute in a pan. Let it cool.",
            "In a food processor add the beetroot and the berries and blend it well.",
            "Add some water if need be. You want a consistency of a flowing cream.",
            "Adjust the seasoning again, chill in the fridge.",
            "Serve with a little sprinkling of chopped parsley."
        ],
        "cook_time": "20 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Virgin Punch",
        "ingredients": [
            "Juice of half a lemon",
            "500 ml orange juice",
            "500 ml mango juice",
            "500 ml apple juice",
            "400 ml sparkling lemonade",
            "250 g mandarin segments, drained",
            "A  pinch of black pepper (optional)"
        ],
        "instructions": [
            "Stir together all the ingredients in a large jug or bowl and add some ice cubes."
        ],
        "cook_time": "20 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Ginger Zinger",
        "ingredients": [
            "1/2 tsp peeled and grated root ginger",
            "400 ml apple juice",
            "Juice of half a lime",
            "A pinch of coarse black pepper"
        ],
        "instructions": [
            "Mix all the ingredients together and then strain before serving with ice.",
            "Tip: Use a stick of lemon grass as a stirrer cum garnish. "
        ],
        "cook_time": "15 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Mango Smoothie",
        "ingredients": [
            "100 ml (3 1/2 fl oz) single cream",
            "200 ml (7fl oz) full-fat milk",
            "400 ml (14fl oz) natural unsweetened yogurt",
            "400 ml (14fl oz) mango pulp",
            "4 tsp castor sugar"
        ],
        "instructions": [
            "This variation on the basic lassi recipe is made using a fruit that is synonymous with India. ",
            "In this recipe, ready-made mango pulp is used for extra sweetness, but a fresh-pulped large or medium mango can be substituted.",
            "Blend the ingredients together and serve with ice."
        ],
        "cook_time": "15 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Pear Granita",
        "ingredients": [
            "2 pears, peeled and chopped",
            "2 tsp brown sugar",
            "2 Tbsp lemon juice",
            "1 cup cream"
        ],
        "instructions": [
            "Place the pears with the lemon juice and brown sugar and blend in a mixer. ",
            "Remove the mixture from the blender and place in 2 glasses. ",
            "Whip the cream in a bowl and spread it over the pear mixture. ",
            "Serve chilled. ",
            "Tip: If you're placing the glasses in the refrigerator, make sure the granitas are covered. "
        ],
        "cook_time": "15 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Lemon Cheer",
        "ingredients": [
            "1 1/2 liters of water",
            "6-7 Tbsp of sugar",
            "1/2 a cup lime juice",
            "A handful of mint leaves"
        ],
        "instructions": [
            "For the sugar syrup, mix the sugar in 1/2 a cup of water and bring to a boil.",
            "Reduce the flame and cook till it reduces to a concentrate. Lightly pound the mint leaves to bring out the aroma.",
            "Put them in a jug and pour in in the sugar syrup. Add the lime juice and water.",
            "Shake well and serve chilled."
        ],
        "cook_time": "20 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Zeta Colada",
        "ingredients": [
            "45 ml white/light rum",
            "10 ml coconut liqueur",
            "60 ml pineapple juice",
            "30 ml single cream",
            "Garnish: Coconut foam + roasted coconut + cocktail umbrellaGlass: Tall/hurricane"
        ],
        "instructions": [
            "Add all ingredients into shaker with ice.",
            "Shake and strain into glass.",
            "Squirt the coconut foam.",
            "Sprinkle with roasted coconut."
        ],
        "cook_time": "20 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Yellow Scorpion",
        "ingredients": [
            "45 ml pot still vodka",
            "1 tablespoon aniseeds (saunf)",
            "Few cubes of fresh pineapple",
            "45 ml Pineapple juice",
            "Splash of lime juice and sugar syrup",
            "Ice cubes",
            "Garnish: Freshly ground anise",
            "Glass: Martini glass"
        ],
        "instructions": [
            "Fill the martini glass with ice to chill it.",
            "Put the aniseed into the mixing can. Muddle.",
            "Add the pineapple. Muddle it again.",
            "Half fill shaker with ice.",
            "Add the vodka, pineapple juice, lime and sugar. Shake.",
            "Double strain into the chilled martini glass.",
            "Garnish with some freshly ground anise."
        ],
        "cook_time": "20 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "TLC (Tender Loving Care)",
        "ingredients": [
            "45 ml silver tequila",
            "4-5 strawberries",
            "30 ml cream",
            "1 scoop ice cream",
            "15-20 ml strawberry crush or syrup (optional)",
            "Garnish: Chocolate sauce drizzle",
            "Glass: Margarita"
        ],
        "instructions": [
            "Blend all ingredients together with crushed ice till slushed.",
            "\nPour into glass. ",
            "\nDrizzle the chocolate sauce to decorate."
        ],
        "cook_time": "20 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Thai Mai Shu",
        "ingredients": [
            "40 ml London Dry gin",
            "20 ml apple liqueur",
            "10 ml ginger liqueur",
            "10 ml chilli syrup",
            "3 cm de-seeded chilli",
            "1 cm lemon grass",
            "2 slices ginger",
            "2 basil leaves",
            "Garnish: Lemon grass stalk."
        ],
        "instructions": [
            "Create 2 chilli - apple spheres using 2.5ml measuring spoon.",
            "Cook for 1/2 min and then rinse in water. Place in ceramic spoon.",
            "Muddle ginger, chilli and lemongrass and syrup until paste turns red.",
            "Add remaining gin, liqueurs and basil.",
            "Shake and double strain in glass, and serve on a cocktail plate with spheres."
        ],
        "cook_time": "20 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Strawberry Daiquiri",
        "ingredients": [
            "45 ml 3YO Trinidad & Tobago rum",
            "15 ml coconut rum liqueur",
            "45 ml strawberry crush",
            "15 ml lime juiceGarnish: Half slice sweet lime, mint leaves",
            "Glass: Bavaria/ large saucer"
        ],
        "instructions": [
            "Fill shaker/pitcher with crushed ice.",
            "Pour all ingredients over the ice. Blend to a slush.",
            "Taste to adjust flavors.",
            "Pour into glass. Garnish."
        ],
        "cook_time": "15 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Singapore Sling",
        "ingredients": [
            "30 ml gin",
            "15 ml cherry brandy",
            "10 ml benedictine",
            "15 ml orange liqueur",
            "15 ml lime juice",
            "Splash of sugar syrup",
            "Soda to top",
            "Splash of grenadine",
            "100/120 ml pineapple juice",
            "Garnish: Pineapple and cherry",
            "Glass: Tall"
        ],
        "instructions": [
            "Add all ingredients into shaker with ice.",
            "Shake and strain over fresh ice or pour with ice into glass.",
            "Splash with soda and garnish."
        ],
        "cook_time": "15 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Shamrock",
        "ingredients": [
            "30 ml Irish single malt whiskey",
            "15 ml almond liqueur",
            "30 ml coffee liqueur",
            "2-3 drops of mint liqueur",
            "30 ml milk",
            "A splash of sugar syrup",
            "Ice cubes",
            "A cherry for garnishing",
            "Glass: Old fashioned"
        ],
        "instructions": [
            "Chill the glass and rim it with some sugar and mint liqueur.",
            "Put some ice in a shaker and pour in all the ingredients except the whiskey.",
            "Shake it well. Fill the glass with ice cubes and pour in the drink.",
            "Pour the whiskey on top. Garnish and serve."
        ],
        "cook_time": "15 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Sgroppino",
        "ingredients": [
            "20 ml Finnish lime vodka",
            "1 scoop of lemon gelato",
            "1 scoop of panna (cream) gelato",
            "115 ml of prosecco/sparkling wine",
            "Garnish: Julienne of Italian lemon rind and almond flakes",
            "Glass: Martini"
        ],
        "instructions": [
            "Put the scoops of ice cream in a glass bowl or mixing glass.",
            "Soften the ice creams with a spoon & fork.",
            "Add the sparkling wine and gently whisk till the ice cream is creamy.",
            "Stir in the vodka. Pour creamy mixture into martini glass.",
            "Garnish with lemon rind juliennes and almond flakes."
        ],
        "cook_time": "15 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Pure Sin",
        "ingredients": [
            "Crushed ice",
            "45 ml Irish whiskey",
            "15 ml Irish creme liqueur",
            "2 Tbsp cream",
            "1 scoop vanilla ice cream",
            "1 Tbsp frozen raspberries",
            "2 Tbsp frozen strawberries",
            "Garnish: Chocolate stick & a sprig of mint",
            "Glass: Large margarita"
        ],
        "instructions": [
            "Put 1 scoop of crushed ice in a blender.",
            "Add all the ingredients and blend till smooth.",
            "Pour it into the glass. Garnish & serve."
        ],
        "cook_time": "15 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Pimms Cup",
        "ingredients": [
            "1/3 pitcher Pimm's",
            "1/2 pitcher Gingerale",
            "1/2 pitcher lemonade",
            "Fresh fruits",
            "Cucumber sticks",
            "Fresh mintGarnish: Cucumber stick",
            "Glass: Pitcher/ wine/ tall"
        ],
        "instructions": [
            "Fill a jug with ice. Pour in the Pimm's generously.",
            "Top with ginger ale and lemonade.",
            "Add fresh fruit(orange, lemon, strawberries, cucumber) and mint leaves.",
            "Stir."
        ],
        "cook_time": "15 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Oriental Cooler",
        "ingredients": [
            "45 ml raspberry vodka",
            "Handful of freshly chopped lemongrass",
            "60 ml cranberry juice",
            "Dash of sugar syrup",
            "Ice",
            "Garnish: Basil leaf, lemongrass stick",
            "Glass: Old fashioned/rocks glass"
        ],
        "instructions": [
            "Put the lemongrass in the mixing can. Muddle.",
            "Add ice cubes. Pour the raspberry vodka.",
            "Add a dash of sugar syrup and the cranberry juice.",
            "Shake.",
            "Fill glass with ice cubes.",
            "Double strain the mixture on the ice.",
            "Add a some more ice. Take a lemongrass stick and put it in the drink.",
            "Garnish it with a basil leaf. Serve."
        ],
        "cook_time": "15 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Negroni",
        "ingredients": [
            "20/30 ml Campari",
            "20/30 ml Red vermouth",
            "20/30 ml Gin",
            "Garnish: Wedge of orange",
            "Glass: Old fashioned/rocks"
        ],
        "instructions": [
            "Fill glass with ice cubes. Pour all ingredients over ice.",
            "Stir. Drop the orange wedge into drink"
        ],
        "cook_time": "15 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Chocolate Cake in a Pressure Cooker",
        "ingredients": [
            "1 cup flour  ",
            "1/4 cup cocoa powder  ",
            "1 1/4 tsp baking powder",
            "1/4 cup butter",
            "3/4 cup caster sugar",
            "1/4 cup water  ",
            "2 eggs  ",
            "1/2 tsp vanilla essence",
            "1/8 tsp salt  ",
            "6 inch round greased baking tin"
        ],
        "instructions": [
            "In a mixing bowl, sift the flour, cocoa powder and baking powder. ",
            "Add in the butter, sugar, salt, water and vanilla, and beat the ingredients using a whisk.     ",
            "Add the eggs and beat the batter until smooth. ",
            "Transfer into the baking tin.    ",
            "Heat the pressure cooker, covered with the lid but without the pressure, for 3-4 minutes on high heat, then place the cake tin in the empty cooker (do not add water in the cooker).     ",
            "Close the lid (without the pressure), lower the flame and let it cook until done (about 30 minutes)."
        ],
        "cook_time": "1 Hour",
        "cuisine": "beverages"
    },
    {
        "name": "Honey Chilli Potatoes",
        "ingredients": [
            "For the potatoes:",
            "2 potatoes, peeled and sliced",
            "3-4 Tbsp cornflour or maida",
            "Salt to taste",
            "1 tsp red chilli powder",
            "Oil, for deep frying",
            "For the base:",
            "1 tsp oil",
            "2 spring onions (with stalk), sliced",
            "1 Tbsp garlic paste",
            "1 capsicum, sliced",
            "2 Tbsp honey",
            "Salt, to taste",
            "1/4 tsp soya sauce",
            "3 tsp white sesame seeds",
            "2 tsp chilli sauce"
        ],
        "instructions": [
            "For the potatoes:",
            "In a bowl, add cornflour or maida, salt and red chilli powder.",
            "Add the sliced potatoes and mix well until the potatoes are coated.",
            "Heat oil in a wok and deep fry the potatoes until golden. Keep aside.",
            "For the Base:",
            "In a wok, add oil, garlic paste and spring onions. Saute on high heat for 1 minute.",
            "Add capsicum, honey, salt, soya sauce, chilli sauce. Saute for 2-3 minutes.",
            "Add the deep-fried potatoes and sesame seeds. Mix well and serve hot."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Vegetable Momos",
        "ingredients": [
            "For Dough:",
            "2 cups maida",
            "1/2 tsp salt ",
            "1/2 tsp baking powder   ",
            "For Filling: ",
            "1 cup carrots - grated ",
            "1 cup cabbage - grated ",
            "1 Tbsp oil ",
            "1/2 cup onion - finely chopped ",
            "1 tsp garlic - chopped  ",
            "1 tsp Soya sauce ",
            "Salt ",
            "1/4 tsp vinegar ",
            "1/4 tsp black pepper"
        ],
        "instructions": [
            "Mix the maida, salt and baking powder and knead to a stiff dough with water. ",
            "Heat oil and add the onion and garlic. ",
            "Saute over high heat and add the carrot and cabbage. Turn around over high heat till glossy. ",
            "Take it off the heat and mix in the Soya sauce, salt, vinegar and black pepper. ",
            "Roll the dough thin (translucent) and cut into 4\"-5\" rounds. ",
            "Take a round, wet edges and place some filling in the center. ",
            "Bring edges together to cover the filling. Twist to seal and fill the rest in the same way. ",
            "Steam for about 10 minutes and serve with soya sauce and chilli sauce."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Chole Bhature",
        "ingredients": [
            "For chole:",
            "2 cup chickpeas (channas)",
            "2 tsp oil",
            "1 bay leaf (tej patta)",
            "1 stick cinnamon (dalchini)",
            "3-4 cloves (laung)",
            "1 tsp whole pepper corns (sabut kali mirch)",
            "3 green cardamom  (choti elaichi)",
            "2 black cardamom (badi elaichi)",
            "1 tsp turmeric powder (haldi)",
            "1 tsp chili powder (lal mirch powder)",
            "1 tsp coriander powder (dhaniya powder)",
            "1 tsp cumin powder (zeera powder)",
            "1 tsp cumin seeds (zeera)",
            "1/2 tsp asafoetida (heeng)",
            "Salt to taste",
            "1 cup onions (chopped)",
            "1 cup tomatoes (chopped)",
            "1 tsp ginger (chopped)",
            "1 tsp garlic (chopped)",
            "1 tsp ajwain",
            "1 tsp lime juice",
            "1 green chili (chopped)                      1 tea bag                                                1 Tbsp butter",
            "For the bhaturas:",
            "2 cups maida (refined flour)",
            "1/2 tsp yeast, dissolved for 10 minutes in luke warm water",
            "1/2 cup whole wheat flour",
            "A pinch of salt",
            "Water to knead",
            "Oil for frying"
        ],
        "instructions": [
            "For chole:",
            "In a pan add oil, bay leaf, cinnamon, cumin seeds, cloves, whole pepper corns, green and black cardamom.",
            "After it gets brown add chopped onions and saute it.",
            "After sauteing add chopped ginger and garlic.",
            "Then add turmeric, chili powder, coriander powder, cumin powder, asafoetida, salt and fry well.",
            "For de glazing the pan add little water.",
            "Now add the chole (soaked overnight and pressure cooked) to the masala.",
            "After stirring well add tomatoes, little sugar and salt to the chole (chickpeas)",
            "Now add ajwain, chopped green chilies and water for the base.",
            "To get the color in the chole, add a tea bag to the masala.",
            "Simmer the chole gently for an hour and cover it.",
            "Add lime juice and a dollop of butter to it.",
            "Garnish the chole with coriander and butter.",
            "Serve the chole hot with bhaturas.",
            "For the bhaturas:",
            "Knead the whole wheat flour, maida and salt together with adequate amount of water.",
            "Sprinkle the yeast on top. Leave it for 2-3 hours for the yeast to work.",
            "Divide it into equal portions. Roll out in an oval or round shape.",
            "Deep fry till golden brown, like a puri.",
            "Serve. "
        ],
        "cook_time": "1 Hour",
        "cuisine": "beverages"
    },
    {
        "name": "Quick Chicken Curry",
        "ingredients": [
            "1 kg chicken",
            "3 large onions, paste",
            "2 large tomatoes, pureed",
            "1 Tbsp garlic paste",
            "1 Tbsp ginger paste",
            "2 tsp coriander powder",
            "2 tsp cumin powder",
            "1/2 tsp turmeric powder",
            "1/2 tsp red chilli powder",
            "1 tsp garam masala powder",
            "2 Tbsp oil",
            "Salt to taste",
            "Chopped coriander for garnish"
        ],
        "instructions": [
            "Heat oil in a pan and sauté the onion paste, garlic & ginger paste till golden brown.",
            "Add tomato puree. When the tomato puree dries up, add coriander powder, cumin powder, garam masala, red chilli powder, turmeric powder and salt. Let the spices cook.",
            "Add chicken pieces into the masala. Stir well and cook till they are golden brown.",
            "Add 1/2 cup of water and stir. Cover with a lid and let it simmer till the chicken is cooked.",
            "Garnish with chopped coriander and serve."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Butter Chicken",
        "ingredients": [
            "700 gm raw chicken  ",
            "For theMarinade:",
            "1 tsp red chilli powder ",
            "1 tsp ginger and garlic paste ",
            "Salt to taste ",
            "1/2 kg curd  ",
            "For theGravy:",
            "175 gm white butter ",
            "1/2 tsp black cumin seeds ",
            "1/2 kg tomato, pureed ",
            "1/2 tsp sugar ",
            "1 tsp red chilli powder ",
            "Salt to taste ",
            "100 gm fresh cream ",
            "4 green chillies, sliced",
            "1/2 tsp fenugreek leaves, crushed"
        ],
        "instructions": [
            "For marinating the chicken",
            "In a mixing bowl, mix red chilli powder, ginger garlic paste, salt and curd.  ",
            "Add the raw chicken pieces to the marinade and mix well. Keep it in the refrigerator overnight or minimum 6 hours.  ",
            "Roast the marinated chicken in a tandoor or an oven for about 10-12 minutes until it is three-fourth done.  ",
            "For the chicken gravy",
            "Heat half the quantity of white butter in pan. ",
            "Pour in the tomato puree, and saute for 2-3 minutes. Add cumin seeds, sugar, red chilli powder and salt. Mix well.  ",
            "Add the prepared chicken, white butter, fresh cream, sliced green chillies and crushed fenugreek leaves.  Saute for 3-4 minutes and let the chicken cook.",
            "Cook till chicken is done. Serve hot with rice or naan."
        ],
        "cook_time": "30 Minutes + Marination time (overnight)",
        "cuisine": "beverages"
    },
    {
        "name": "Mai Tai",
        "ingredients": [
            "30 ml Dark Jamaican",
            "30 ml Golden Over-proof Rum",
            "15 ml orange liqueur",
            "15 ml almond syrup or almond liqueur",
            "4 lime wedges",
            "Splash lime juice",
            "Garnish: 2 cherries, pineapple wedge, pineapple leaf, mint leaves",
            "Glass: Hawaii/Tall"
        ],
        "instructions": [
            "Add crushed ice to shaker. Pour all ingredients over ice.",
            "Squeeze and drop the lime wedges in. Shake for 10 seconds.",
            "Taste to adjust flavors. Fill glass with crushed ice.",
            "Pour drink over ice. Garnish."
        ],
        "cook_time": "15 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Island Affair",
        "ingredients": [
            "15 ml Puerto Rican white rum",
            "15 ml 3YO Trinidad & Tobago rum",
            "15 ml coconut rum liqueur",
            "30 ml dark Indian rum",
            "15 ml litchi crush",
            "1 wedge of lime",
            "10 ml blue curacao syrup",
            "Soda/ sprite to topGarnish: Half slice sweet lime, mint leaves",
            "Glass: Pilsner"
        ],
        "instructions": [
            "Fill shaker with ice.",
            "Squeeze wedge of lime and drop in.",
            "Add white rum, coconut liqueur, litchi crush and shake.",
            "Pour into glass. Add blue curacao. Top with 1/2 soda, 1/2 sprite.",
            "Float dark rum over the ice. Garnish!"
        ],
        "cook_time": "15 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Blonde Sangria",
        "ingredients": [
            "1 bottle white wine",
            "120 ml citrus vodka",
            "Sliced cherries, kiwi, lychees, mango",
            "Fresh mint leaves",
            "Apple soda to top",
            "Lots of ice"
        ],
        "instructions": [
            "Fill the jug with ice.",
            "Add the citrus vodka.",
            "Put in the chopped fruits.",
            "Pour the wine. Top with apple soda.",
            "Garnish with mint.",
            "Stir!"
        ],
        "cook_time": "15 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Melon Saketini",
        "ingredients": [
            "15 ml sake",
            "15 ml melon liqueur",
            "15 ml jasmine tea",
            "15 ml vermouth",
            "30/45 ml gin/vodka",
            "Splash of sugar syrup"
        ],
        "instructions": [
            "Add all ingredients into shaker with ice.",
            "Shake and strain into glass.",
            "Garnish."
        ],
        "cook_time": "15 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Mediterranean Martini",
        "ingredients": [
            "30 ml Polish rye vodka/ French grape vodka",
            "4 fresh strawberries",
            "2 fresh gooseberries",
            "Few mint leaves (bruised)",
            "Splash lime juice",
            "Splash sugar syrup",
            "Chilled sparkling wine to top",
            "Glass: Chilled martini"
        ],
        "instructions": [
            "Add strawberries, gooseberries and mint leaves in mixing glass.",
            "Muddle to release juices.",
            "Fill mixing glass with ice.",
            "Add vodka, lime & sugar.",
            "Shake and strain into martini glass.",
            "Top with sparkling wine.",
            "Garnish."
        ],
        "cook_time": "20 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Litchi Shochutini",
        "ingredients": [
            "30/45 shochu (local Japanese grain spirit)",
            "15 ml litchi liqueur",
            "4/5 lychees",
            "Splash of lime juice",
            "Splash of lychee syrup/juiceGarnish: Whole lychee",
            "Glass: Martini"
        ],
        "instructions": [
            "Add all ingredients into shaker with ice.",
            "\nTaste to adjust flavor.",
            "\nShake and strain into glass.",
            "\nGarnish."
        ],
        "cook_time": "15 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Liquid Fruit Salad",
        "ingredients": [
            "45 ml French grape vodka",
            "2-3 lychees, cut into bits",
            "1/2 a peach, cut into cubes",
            "5 cubes of mango",
            "Few mint leaves",
            "2 wedges of lime",
            "Crushed ice",
            "Splash of lime juice",
            "Splash of lychee juice",
            "Glass: Tall glass"
        ],
        "instructions": [
            "Put lychees, peach, mango and the mint in the glass.",
            "Muddle all of it.",
            "Put some crushed ice.",
            "Pour the lychee juice, a dash of lime juice.",
            "Add the vodka. Stir.",
            "Top with some more crushed ice. Serve!"
        ],
        "cook_time": "15 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Espresso Martini",
        "ingredients": [
            "45 ml Swedish vanilla vodka",
            "15 ml Mexican coffee liqueur",
            "1/2 shot espresso coffee",
            "10 ml hazelnut syrupGarnish: 2 mint ringsGlass: Martini"
        ],
        "instructions": [
            "Fill martini glass with ice and keep to chill.",
            "Fill shaker with ice.",
            "Pour all the ingredients over the ice.",
            "Shake and strain into chilled glass.",
            "Sit the mints on a stick over the rim."
        ],
        "cook_time": "15 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Cuban Martini",
        "ingredients": [
            "30 ml Polish rye vodka/ French grape vodka",
            "15 ml orange liqueur/ triple sec",
            "Few mint leaves (bruised)",
            "Splash lime juice",
            "Splash sugar syrup",
            "10 ml cranberry juice",
            "Chilled sparkling wine to top",
            "Garnish: Orange twist",
            "Glass: Chilled Martini glass"
        ],
        "instructions": [
            "Fill mixing glass with ice.",
            "Pour in vodka, triple sec, lime & sugar.",
            "Add fresh mint.",
            "Shake & strain into martini glass.",
            "Top with sparkling wine.",
            "Splash in the cranberry juice.",
            "Twist the orange peel and drop into drink."
        ],
        "cook_time": "20 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Classic Dry Martini",
        "ingredients": [
            "60 ml Polish rye vodka (chilled)",
            "A breeze of scotchGarnish: 3 dry vermouth soaked olives on a cocktail stickGlass: Martini"
        ],
        "instructions": [
            "Fill martini glass with ice and keep to chill.",
            "Add plenty of ice in the cocktail shaker and pour in the chilled vodka.",
            "Dip a stirrer into a bottle of scotch and stir the vodka and ice with the scotch lined stirrer.",
            "Strain into the chilled glass.",
            "Stick in the olive stick."
        ],
        "cook_time": "15 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Chocolate Martini",
        "ingredients": [
            "Baileys creme liqueur",
            "Vodka",
            "Chocolate in a cone",
            "Ice",
            "Garnish: Chocolate cigar",
            "Glass: Martini"
        ],
        "instructions": [
            "Grease the glass with chocolate.",
            "Put ice in the mixer.",
            "Pour the creme liqueur, vodka on the ice.",
            "Shake it.",
            "Pour it into the glass.",
            "Stick in the chocolate cigar.",
            "Serve!"
        ],
        "cook_time": "15 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Cherry Martini",
        "ingredients": [
            "Gin",
            "Martini",
            "Manachino cherry liqueur",
            "Fresh cherry juice",
            "CherriesGlass: Martini"
        ],
        "instructions": [
            "Put ice in the mixer.",
            "\nPour a shot of gin on the ice.",
            "\nPour a capful of martini.",
            "\nPour a shot of manachino cherry liqueur.",
            "\nPour a shot glass of cherry juice.",
            "\nShake it.",
            "\nPour into the glass.",
            "\nGarnish it with cherries."
        ],
        "cook_time": "15 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Bellini",
        "ingredients": [
            "30/45 ml fresh peach puree (preferably white Italian peaches)",
            "Cold sparkling wine (preferably Italian Prosecco) to top",
            "Glass: Champagne tulip/flute"
        ],
        "instructions": [
            "Put peach puree in glass.",
            "Fill with cold sparkling wine.",
            "Stir."
        ],
        "cook_time": "15 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Kurumba Sunset",
        "ingredients": [
            "30 ml cachaca (Brazilian cane spirit)",
            "15/20 ml peach liqueur",
            "15 ml campari",
            "4 wedges of lime",
            "2 slices of orange",
            "8/10 mint sprigs",
            "Garnish: Slice of orange/mint sprig",
            "Glass: Old fashioned"
        ],
        "instructions": [
            "Muddle the lime wedges, orange slices & mint leaves.",
            "Fill glass with crushed ice and pour other ingredients.",
            "Stir, taste, adjust, top with more ice if requires.",
            "Garnish."
        ],
        "cook_time": "20 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Kurumba Passion",
        "ingredients": [
            "45ml dark rum",
            "60ml cranberry juice",
            "60ml mango juice",
            "60ml pineapple juice",
            "30ml passion fruit cordial",
            "3 lime wedges",
            "Splash of grenadine",
            "Garnish: Slice of dragon fruitGlass: Hurricane/Tall"
        ],
        "instructions": [
            "Pour cranberry and grenadine, then, fill glass with ice.",
            "Pour all ingredients over ice in a shaker.",
            "Shake and strain into the glass.",
            "Float the dark rum.",
            "Garnish."
        ],
        "cook_time": "20 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Kurumba Fire",
        "ingredients": [
            "45 ml orange vodka",
            "15 ml orange curacao",
            "15 ml cointreau",
            "10-15 ml lime juice",
            "45-60 ml cranberry juice",
            "Garnish: Slice of orange",
            "Glass: Martini"
        ],
        "instructions": [
            "Fill shaker with ice.",
            "Pour in all ingredients.",
            "Shake and strain into martini glass.",
            "Garnish."
        ],
        "cook_time": "20 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "High On Grass",
        "ingredients": [
            "45 ml New Zealand feijoa vodka",
            "15 ml sour apple liqueur",
            "1 Tbsp honey",
            "45 ml apple juice",
            "12 mint leaves",
            "2-3 pandang leaves",
            "Bunch of wheat grass",
            "1 and 1/2 scoop crushed ice",
            "Glass: Wine glass"
        ],
        "instructions": [
            "Put all ingredients into blender over ice.",
            "Blend till smooth and slushed.",
            "Pour into glass."
        ],
        "cook_time": "20 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Hemmingway Air",
        "ingredients": [
            "45 ml white/light rum",
            "15 ml maraschino (clear cherry) liqueur",
            "60 ml lime juice",
            "Garnish: Pink grapefruit foam and cherry",
            "Glass: Martini"
        ],
        "instructions": [
            "Add all ingredients into shaker with ice.",
            "Shake and strain into glass.",
            "Squirt the grapefruit foam over drink.",
            "Garnish."
        ],
        "cook_time": "20 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Chocolate Cake in a Pressure Cooker",
        "ingredients": [
            "1 cup flour  ",
            "1/4 cup cocoa powder  ",
            "1 1/4 tsp baking powder",
            "1/4 cup butter",
            "3/4 cup caster sugar",
            "1/4 cup water  ",
            "2 eggs  ",
            "1/2 tsp vanilla essence",
            "1/8 tsp salt  ",
            "6 inch round greased baking tin"
        ],
        "instructions": [
            "In a mixing bowl, sift the flour, cocoa powder and baking powder. ",
            "Add in the butter, sugar, salt, water and vanilla, and beat the ingredients using a whisk.     ",
            "Add the eggs and beat the batter until smooth. ",
            "Transfer into the baking tin.    ",
            "Heat the pressure cooker, covered with the lid but without the pressure, for 3-4 minutes on high heat, then place the cake tin in the empty cooker (do not add water in the cooker).     ",
            "Close the lid (without the pressure), lower the flame and let it cook until done (about 30 minutes)."
        ],
        "cook_time": "1 Hour",
        "cuisine": "beverages"
    },
    {
        "name": "Honey Chilli Potatoes",
        "ingredients": [
            "For the potatoes:",
            "2 potatoes, peeled and sliced",
            "3-4 Tbsp cornflour or maida",
            "Salt to taste",
            "1 tsp red chilli powder",
            "Oil, for deep frying",
            "For the base:",
            "1 tsp oil",
            "2 spring onions (with stalk), sliced",
            "1 Tbsp garlic paste",
            "1 capsicum, sliced",
            "2 Tbsp honey",
            "Salt, to taste",
            "1/4 tsp soya sauce",
            "3 tsp white sesame seeds",
            "2 tsp chilli sauce"
        ],
        "instructions": [
            "For the potatoes:",
            "In a bowl, add cornflour or maida, salt and red chilli powder.",
            "Add the sliced potatoes and mix well until the potatoes are coated.",
            "Heat oil in a wok and deep fry the potatoes until golden. Keep aside.",
            "For the Base:",
            "In a wok, add oil, garlic paste and spring onions. Saute on high heat for 1 minute.",
            "Add capsicum, honey, salt, soya sauce, chilli sauce. Saute for 2-3 minutes.",
            "Add the deep-fried potatoes and sesame seeds. Mix well and serve hot."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Vegetable Momos",
        "ingredients": [
            "For Dough:",
            "2 cups maida",
            "1/2 tsp salt ",
            "1/2 tsp baking powder   ",
            "For Filling: ",
            "1 cup carrots - grated ",
            "1 cup cabbage - grated ",
            "1 Tbsp oil ",
            "1/2 cup onion - finely chopped ",
            "1 tsp garlic - chopped  ",
            "1 tsp Soya sauce ",
            "Salt ",
            "1/4 tsp vinegar ",
            "1/4 tsp black pepper"
        ],
        "instructions": [
            "Mix the maida, salt and baking powder and knead to a stiff dough with water. ",
            "Heat oil and add the onion and garlic. ",
            "Saute over high heat and add the carrot and cabbage. Turn around over high heat till glossy. ",
            "Take it off the heat and mix in the Soya sauce, salt, vinegar and black pepper. ",
            "Roll the dough thin (translucent) and cut into 4\"-5\" rounds. ",
            "Take a round, wet edges and place some filling in the center. ",
            "Bring edges together to cover the filling. Twist to seal and fill the rest in the same way. ",
            "Steam for about 10 minutes and serve with soya sauce and chilli sauce."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Chole Bhature",
        "ingredients": [
            "For chole:",
            "2 cup chickpeas (channas)",
            "2 tsp oil",
            "1 bay leaf (tej patta)",
            "1 stick cinnamon (dalchini)",
            "3-4 cloves (laung)",
            "1 tsp whole pepper corns (sabut kali mirch)",
            "3 green cardamom  (choti elaichi)",
            "2 black cardamom (badi elaichi)",
            "1 tsp turmeric powder (haldi)",
            "1 tsp chili powder (lal mirch powder)",
            "1 tsp coriander powder (dhaniya powder)",
            "1 tsp cumin powder (zeera powder)",
            "1 tsp cumin seeds (zeera)",
            "1/2 tsp asafoetida (heeng)",
            "Salt to taste",
            "1 cup onions (chopped)",
            "1 cup tomatoes (chopped)",
            "1 tsp ginger (chopped)",
            "1 tsp garlic (chopped)",
            "1 tsp ajwain",
            "1 tsp lime juice",
            "1 green chili (chopped)                      1 tea bag                                                1 Tbsp butter",
            "For the bhaturas:",
            "2 cups maida (refined flour)",
            "1/2 tsp yeast, dissolved for 10 minutes in luke warm water",
            "1/2 cup whole wheat flour",
            "A pinch of salt",
            "Water to knead",
            "Oil for frying"
        ],
        "instructions": [
            "For chole:",
            "In a pan add oil, bay leaf, cinnamon, cumin seeds, cloves, whole pepper corns, green and black cardamom.",
            "After it gets brown add chopped onions and saute it.",
            "After sauteing add chopped ginger and garlic.",
            "Then add turmeric, chili powder, coriander powder, cumin powder, asafoetida, salt and fry well.",
            "For de glazing the pan add little water.",
            "Now add the chole (soaked overnight and pressure cooked) to the masala.",
            "After stirring well add tomatoes, little sugar and salt to the chole (chickpeas)",
            "Now add ajwain, chopped green chilies and water for the base.",
            "To get the color in the chole, add a tea bag to the masala.",
            "Simmer the chole gently for an hour and cover it.",
            "Add lime juice and a dollop of butter to it.",
            "Garnish the chole with coriander and butter.",
            "Serve the chole hot with bhaturas.",
            "For the bhaturas:",
            "Knead the whole wheat flour, maida and salt together with adequate amount of water.",
            "Sprinkle the yeast on top. Leave it for 2-3 hours for the yeast to work.",
            "Divide it into equal portions. Roll out in an oval or round shape.",
            "Deep fry till golden brown, like a puri.",
            "Serve. "
        ],
        "cook_time": "1 Hour",
        "cuisine": "beverages"
    },
    {
        "name": "Quick Chicken Curry",
        "ingredients": [
            "1 kg chicken",
            "3 large onions, paste",
            "2 large tomatoes, pureed",
            "1 Tbsp garlic paste",
            "1 Tbsp ginger paste",
            "2 tsp coriander powder",
            "2 tsp cumin powder",
            "1/2 tsp turmeric powder",
            "1/2 tsp red chilli powder",
            "1 tsp garam masala powder",
            "2 Tbsp oil",
            "Salt to taste",
            "Chopped coriander for garnish"
        ],
        "instructions": [
            "Heat oil in a pan and sauté the onion paste, garlic & ginger paste till golden brown.",
            "Add tomato puree. When the tomato puree dries up, add coriander powder, cumin powder, garam masala, red chilli powder, turmeric powder and salt. Let the spices cook.",
            "Add chicken pieces into the masala. Stir well and cook till they are golden brown.",
            "Add 1/2 cup of water and stir. Cover with a lid and let it simmer till the chicken is cooked.",
            "Garnish with chopped coriander and serve."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Butter Chicken",
        "ingredients": [
            "700 gm raw chicken  ",
            "For theMarinade:",
            "1 tsp red chilli powder ",
            "1 tsp ginger and garlic paste ",
            "Salt to taste ",
            "1/2 kg curd  ",
            "For theGravy:",
            "175 gm white butter ",
            "1/2 tsp black cumin seeds ",
            "1/2 kg tomato, pureed ",
            "1/2 tsp sugar ",
            "1 tsp red chilli powder ",
            "Salt to taste ",
            "100 gm fresh cream ",
            "4 green chillies, sliced",
            "1/2 tsp fenugreek leaves, crushed"
        ],
        "instructions": [
            "For marinating the chicken",
            "In a mixing bowl, mix red chilli powder, ginger garlic paste, salt and curd.  ",
            "Add the raw chicken pieces to the marinade and mix well. Keep it in the refrigerator overnight or minimum 6 hours.  ",
            "Roast the marinated chicken in a tandoor or an oven for about 10-12 minutes until it is three-fourth done.  ",
            "For the chicken gravy",
            "Heat half the quantity of white butter in pan. ",
            "Pour in the tomato puree, and saute for 2-3 minutes. Add cumin seeds, sugar, red chilli powder and salt. Mix well.  ",
            "Add the prepared chicken, white butter, fresh cream, sliced green chillies and crushed fenugreek leaves.  Saute for 3-4 minutes and let the chicken cook.",
            "Cook till chicken is done. Serve hot with rice or naan."
        ],
        "cook_time": "30 Minutes + Marination time (overnight)",
        "cuisine": "beverages"
    },
    {
        "name": "Grilled Lemon Margarita",
        "ingredients": [
            "45 ml vanilla infused tequila",
            "10 ml vanilla liqueur",
            "40 ml lemon juice",
            "3/4 grilled lemons",
            "Garnish: Grilled lemonGlass: Margarita/large martini"
        ],
        "instructions": [
            "Muddle grilled lemons.",
            "Add all ingredients into shaker with ice.",
            "Shake and double strain into salt rimmed glass."
        ],
        "cook_time": "20 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Chrysanthemum Infusion Shot",
        "ingredients": [
            "45 ml chrysanthemum infused vodka",
            "15 ml sugar syrup",
            "Glass: 2 shot glasses"
        ],
        "instructions": [
            "Infuse 1 bottle unflavoured, clean vodka with 4-5 chrysanthemum flower petals for one day and strain.",
            "Put ice in the shaker.",
            "Add the infused vodka.",
            "Add a splash of sugar syrup.",
            "Shake and strain into the shot glasses."
        ],
        "cook_time": "10 minutes + 1 day to infuse vodka",
        "cuisine": "beverages"
    },
    {
        "name": "Banana Walnut Lassi",
        "ingredients": [
            "1 cup low fat yoghurt",
            "1/2 banana",
            "3-4 walnuts (or include Brazil nuts, hazelnuts, almonds and pine nuts)",
            "1 tsp seeds (mix of flax seeds and sesame seeds)",
            "1-2 tsp honey"
        ],
        "instructions": [
            "In a food processor, pour yoghurt, whey powder, flax seed, sesame seeds, walnuts, honey and bananas.",
            "Blend it well till smooth and creamy.",
            "Transfer into a glass and garnish with chopped walnuts before serving."
        ],
        "cook_time": "15 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Iced Tea",
        "ingredients": [
            "1 cup strong black tea ",
            "2 Tbsp sugar or to taste - dissolved in some water",
            "1 Tbsp lemon juice ",
            "Ice cubes to fill the glass ",
            "10-12 mint leaves-whole ",
            "Thin lemon slice-slit in one place to hang on the rim of the glass ",
            "A sprig of mint for decoration"
        ],
        "instructions": [
            "Fill the glass with the ice cubes.  ",
            "Pour over this the sugar syrup, lemon juice and sprinkle the mint leaves.  ",
            "Pour the tea over and stir gently. Allow to cool for a while.",
            "Place the lemon slice on the rim and decorate with the mint sprig.",
            ""
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Kesaria Doodh",
        "ingredients": [
            "5 cups milk     ",
            "1/2 cup sugar ",
            "Few strands of saffron     ",
            "4 green cardamoms - powdered    ",
            "To Garnish:",
            "Pistachios-blanched & shredded ",
            "Almonds-blanched & shredded"
        ],
        "instructions": [
            "Put milk in a pan and bring to a boil. ",
            "Simmer over low heat, stirring a few times till it thickens (about 1/3 should be evaporated, at least). ",
            "Add sugar, saffron and cardamom powder. ",
            "Stir till the sugar is dissolved and simmer for about 5 min.  ",
            "Serve hot garnished with green cardamoms, pistachios and almonds."
        ],
        "cook_time": "20 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Bhaang",
        "ingredients": [
            "1 1/2 litres water ",
            "1 1/2 cups sugar   ",
            "1 cup milk   ",
            "1 Tbsp almonds   ",
            "1 Tbsp cantaloupes/watermelon-seeds skinned  ",
            "1/2 Tbsp poppy seeds  ",
            "1/2 tbsp aniseed  ",
            "1/2 tsp cardamom powder  ",
            "1/2 tsp rose water-optional  ",
            "1 tsp peppercorns whole  ",
            "1/4 cup dried or fresh rose petals"
        ],
        "instructions": [
            "Soak sugar in a liter of the water and keep aside.   ",
            "Wash and clean all the other dry ingredients, except for the cardamom if you are using powder.   ",
            "Soak in two cups of remaining water and leave aside. ",
            "Allow all the soaked items to stand for at least 2 hours. ",
            "Grind the soaked ingredients to a very fine paste, excluding the sugar in a grinder. ",
            "When the paste is very fine, mix the remaining water.   ",
            "Place a strong muslin strainer over a large deep vessel. ",
            "Press through muslin with back of hands, extracting the liquid into vessel. ",
            "Add remaining water, a little at a time to extract more.  ",
            "Pour back some of the extract and press and repress. ",
            "Repeat this process till the residue becomes dry and husk-like. ",
            "Add milk, sugar and rosewater to the extracted liquid. ",
            "If using cardamom powder mix it in with the milk. ",
            "Mix well. ",
            "Chill for an hour before serving."
        ],
        "cook_time": "15 Minutes + Time to soak spices(2hrs)",
        "cuisine": "beverages"
    },
    {
        "name": "Cappuccino",
        "ingredients": [
            "2 cups milk",
            "1 cinnamon stick",
            "2 cups strong coffee",
            "Sugar - to taste",
            "Ground cinnamon"
        ],
        "instructions": [
            "In a saucepan heat the milk and the cinnamon stick just until milk comes to a boil.",
            "Turn heat down and let milk simmer for 10 minutes.",
            "Remove the cinnamon stick from the heated milk.",
            "Pour 1/2 cup of coffee in the cup and add sugar to taste.",
            "Now pour the hot milk, raising it high.",
            "Sprinkle ground cinnamon and serve hot."
        ],
        "cook_time": "15 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Pina Colada",
        "ingredients": [
            "45 ml white rum",
            "10 ml Monin coconut syrup",
            "100 ml pineapple juice ",
            "30 ml cream/coconut cream",
            "Scoop of vanilla ice cream",
            "Garnish: Half a slice of pineapple."
        ],
        "instructions": [
            "Glass: Hurricane",
            "Rim the glass with desiccated coconut. ",
            "Blend all the ingredients with a scoop of crushed ice using a jug and hand blender.",
            "Pour into a rimmed glass.",
            "Garnish: Use mango juice instead of pineapple to make a mango colada. Garnish with fresh mango or fresh mint."
        ],
        "cook_time": "15 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Long Island Iced Tea",
        "ingredients": [
            "15ml vodka (preferably orange flavoured)",
            "15ml rum",
            "15ml gin",
            "15ml Tequila/Desmondji 51% (agave spirit)",
            "15ml Cointreau/Desmondji (orange liqueur)",
            "10ml lime juice",
            "Top with coke",
            "Garnish: orange slice with sprig of mint and orange"
        ],
        "instructions": [
            "Take tall glasses filled with ice.",
            "Add all ingredients except DJ 51 & orange liqueur.",
            "Top with coke & float the DJ 51 & orange liqueur on top.",
            "Give a gentle swirl & garnish."
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Instant Coffee",
        "ingredients": [
            "Coffee powder",
            "Water",
            "Milk",
            "Sugar"
        ],
        "instructions": [
            "Mix 1 tsp of instant coffee per cup of hot water or hot water and milk solution.",
            "Serve with desired amount of sugar."
        ],
        "cook_time": "5 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Filter Coffee",
        "ingredients": [
            "1/4 cup coffee powder",
            "1 cup water",
            "1 cup milk",
            "Sugar to taste"
        ],
        "instructions": [
            "Place coffee powder in the perforated container that comes on top and place the container on the lower container.",
            "Boil the water and pour immediately over the powder.",
            "Place the press over it, cover and leave to drip into the lower container.",
            "When the entire solution has drained into the lower container, heat he milk and mix into the solution.",
            "Serve with desired amount of sugar."
        ],
        "cook_time": "20 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Virgin Mary",
        "ingredients": [
            "3 cups tomato juice",
            "2 tsp Worcestershire sauce",
            "Tobasco sauce to taste",
            "1 tsp powdered black pepper",
            "Salt to taste",
            "1 tsp celery salt or chopped celery",
            "Crushed ice",
            "Salt to decorate the glass stemmed glasses"
        ],
        "instructions": [
            "Wet the glass rims and dip into the salt, so that the rim is covered with salt.",
            "Place the juice, Worcestershire sauce, Tobasco, black pepper, salt, celery, and ice in a shaker (or jug).",
            "Shake to mix well.",
            "Pour into the prepared glasses and serve."
        ],
        "cook_time": "15 minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Strawberry Lassi",
        "ingredients": [
            "45 ml fresh strawberry puree",
            "75 ml yoghurt",
            "Granulated sugar, to taste",
            "Water or crushed ice, to top"
        ],
        "instructions": [
            "Blend yoghurt, sugar and water or crushed ice.",
            "Pour into glass and add strawberry puree for a good color base."
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Royal Falooda",
        "ingredients": [
            "2 cups chilled milk ",
            "1 Tbsp cornflour ",
            "1 cup rose syrup/sherbet",
            "1 Tbsp isabgol seeds (tukmaleha) ",
            "Iced water in a pan with a colander on top of it ",
            "Ice cream to top it - optional"
        ],
        "instructions": [
            "Mix the cornflour with one cup water and bring to a boil, then simmer, stirring all the time. ",
            "As soon as becomes translucent, take it off the heat. ",
            "In another pan place some iced water.",
            "Transfer the cornflour paste on to the colander (filter or sieve) and press with the spoon so that the pressed paste falls into the iced water in shreds (long lines).   ",
            "Keep aside for half an hour.  ",
            "When ready to serve, take four glasses. ",
            "Divide the rose syrup into the glasses.  ",
            "Pour the milk over this equally in the four glasses. ",
            "Add 1/4 cup crushed ice and top it with the isabgol seeds and falooda, which have been strained of the water.   ",
            "Serve.  (You can also serve it topped with a scoop of ice-cream)",
            "Note: A colander is a bowl-shaped kitchen utensil with holes in it used for draining food."
        ],
        "cook_time": "1 Hour",
        "cuisine": "beverages"
    },
    {
        "name": "Madiera",
        "ingredients": [
            "750 gm fresh beetroot juice ",
            "1 Tbsp melon syrup  ",
            "1 tsp fresh lime juice ",
            "1 Tbsp cinnamon syrup or boil 1 tbsp of whole cinnamon and strain"
        ],
        "instructions": [
            "Take out the juice of the beetroot.   ",
            "Mix all the ingredients in a cocktail shaker, shake it well.   ",
            "Pour in a glass on top of ice cubes."
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Cucumber and Kiwi Juice",
        "ingredients": [
            "4 Kiwi fruit",
            "2 cucumbers",
            "1/2 inch piece Galangal or ginger  crushed",
            "Pepper to taste salt to taste",
            "2 celery sticks as stirrers",
            "2 scoops crushed ice",
            "1 cup water",
            "Sprouts to garnish"
        ],
        "instructions": [
            "Peel the fruits and cut into small pieces.",
            "Chill for 1 hour.",
            "Take a powerful blender add crushed ice and water.",
            "Drop all the fruits in the blender and blend at high speed for 1 minute.",
            "Pour into tall glasses and garnish with sprouts."
        ],
        "cook_time": "15 Minutes + Chilling time",
        "cuisine": "beverages"
    },
    {
        "name": "Lassi",
        "ingredients": [
            "750 gm yoghurt",
            "50 gm ice cubes",
            "Salt or sugar",
            "200 ml water"
        ],
        "instructions": [
            "Crush the ice cubes in a blender.",
            "Add the yoghurt, water, salt or sugar.",
            "Blend for about 1 minute.",
            "Serve chilled.",
            "If you are making a namkeen lassi you can add masala like bhuna jeera and kala namak and as desired."
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Kahwa",
        "ingredients": [
            "1 liter water",
            "75 gm sugar",
            "20 gm cinnamon sticks",
            "10 gm cardamom powder",
            "40 gm kahwa tea",
            "50 gm almonds-slivered"
        ],
        "instructions": [
            "Boil the water with sugar, cinnamon and green cardamom powder for 5 minutes.",
            "Add the tea leaves and remove from the flame.",
            "Cover with a lid and brew for 3 minutes.",
            "Strain and pour into cups and add slivered almonds into each cup.",
            "Serve hot."
        ],
        "cook_time": "20 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Chocolate Cake in a Pressure Cooker",
        "ingredients": [
            "1 cup flour  ",
            "1/4 cup cocoa powder  ",
            "1 1/4 tsp baking powder",
            "1/4 cup butter",
            "3/4 cup caster sugar",
            "1/4 cup water  ",
            "2 eggs  ",
            "1/2 tsp vanilla essence",
            "1/8 tsp salt  ",
            "6 inch round greased baking tin"
        ],
        "instructions": [
            "In a mixing bowl, sift the flour, cocoa powder and baking powder. ",
            "Add in the butter, sugar, salt, water and vanilla, and beat the ingredients using a whisk.     ",
            "Add the eggs and beat the batter until smooth. ",
            "Transfer into the baking tin.    ",
            "Heat the pressure cooker, covered with the lid but without the pressure, for 3-4 minutes on high heat, then place the cake tin in the empty cooker (do not add water in the cooker).     ",
            "Close the lid (without the pressure), lower the flame and let it cook until done (about 30 minutes)."
        ],
        "cook_time": "1 Hour",
        "cuisine": "beverages"
    },
    {
        "name": "Honey Chilli Potatoes",
        "ingredients": [
            "For the potatoes:",
            "2 potatoes, peeled and sliced",
            "3-4 Tbsp cornflour or maida",
            "Salt to taste",
            "1 tsp red chilli powder",
            "Oil, for deep frying",
            "For the base:",
            "1 tsp oil",
            "2 spring onions (with stalk), sliced",
            "1 Tbsp garlic paste",
            "1 capsicum, sliced",
            "2 Tbsp honey",
            "Salt, to taste",
            "1/4 tsp soya sauce",
            "3 tsp white sesame seeds",
            "2 tsp chilli sauce"
        ],
        "instructions": [
            "For the potatoes:",
            "In a bowl, add cornflour or maida, salt and red chilli powder.",
            "Add the sliced potatoes and mix well until the potatoes are coated.",
            "Heat oil in a wok and deep fry the potatoes until golden. Keep aside.",
            "For the Base:",
            "In a wok, add oil, garlic paste and spring onions. Saute on high heat for 1 minute.",
            "Add capsicum, honey, salt, soya sauce, chilli sauce. Saute for 2-3 minutes.",
            "Add the deep-fried potatoes and sesame seeds. Mix well and serve hot."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Vegetable Momos",
        "ingredients": [
            "For Dough:",
            "2 cups maida",
            "1/2 tsp salt ",
            "1/2 tsp baking powder   ",
            "For Filling: ",
            "1 cup carrots - grated ",
            "1 cup cabbage - grated ",
            "1 Tbsp oil ",
            "1/2 cup onion - finely chopped ",
            "1 tsp garlic - chopped  ",
            "1 tsp Soya sauce ",
            "Salt ",
            "1/4 tsp vinegar ",
            "1/4 tsp black pepper"
        ],
        "instructions": [
            "Mix the maida, salt and baking powder and knead to a stiff dough with water. ",
            "Heat oil and add the onion and garlic. ",
            "Saute over high heat and add the carrot and cabbage. Turn around over high heat till glossy. ",
            "Take it off the heat and mix in the Soya sauce, salt, vinegar and black pepper. ",
            "Roll the dough thin (translucent) and cut into 4\"-5\" rounds. ",
            "Take a round, wet edges and place some filling in the center. ",
            "Bring edges together to cover the filling. Twist to seal and fill the rest in the same way. ",
            "Steam for about 10 minutes and serve with soya sauce and chilli sauce."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Chole Bhature",
        "ingredients": [
            "For chole:",
            "2 cup chickpeas (channas)",
            "2 tsp oil",
            "1 bay leaf (tej patta)",
            "1 stick cinnamon (dalchini)",
            "3-4 cloves (laung)",
            "1 tsp whole pepper corns (sabut kali mirch)",
            "3 green cardamom  (choti elaichi)",
            "2 black cardamom (badi elaichi)",
            "1 tsp turmeric powder (haldi)",
            "1 tsp chili powder (lal mirch powder)",
            "1 tsp coriander powder (dhaniya powder)",
            "1 tsp cumin powder (zeera powder)",
            "1 tsp cumin seeds (zeera)",
            "1/2 tsp asafoetida (heeng)",
            "Salt to taste",
            "1 cup onions (chopped)",
            "1 cup tomatoes (chopped)",
            "1 tsp ginger (chopped)",
            "1 tsp garlic (chopped)",
            "1 tsp ajwain",
            "1 tsp lime juice",
            "1 green chili (chopped)                      1 tea bag                                                1 Tbsp butter",
            "For the bhaturas:",
            "2 cups maida (refined flour)",
            "1/2 tsp yeast, dissolved for 10 minutes in luke warm water",
            "1/2 cup whole wheat flour",
            "A pinch of salt",
            "Water to knead",
            "Oil for frying"
        ],
        "instructions": [
            "For chole:",
            "In a pan add oil, bay leaf, cinnamon, cumin seeds, cloves, whole pepper corns, green and black cardamom.",
            "After it gets brown add chopped onions and saute it.",
            "After sauteing add chopped ginger and garlic.",
            "Then add turmeric, chili powder, coriander powder, cumin powder, asafoetida, salt and fry well.",
            "For de glazing the pan add little water.",
            "Now add the chole (soaked overnight and pressure cooked) to the masala.",
            "After stirring well add tomatoes, little sugar and salt to the chole (chickpeas)",
            "Now add ajwain, chopped green chilies and water for the base.",
            "To get the color in the chole, add a tea bag to the masala.",
            "Simmer the chole gently for an hour and cover it.",
            "Add lime juice and a dollop of butter to it.",
            "Garnish the chole with coriander and butter.",
            "Serve the chole hot with bhaturas.",
            "For the bhaturas:",
            "Knead the whole wheat flour, maida and salt together with adequate amount of water.",
            "Sprinkle the yeast on top. Leave it for 2-3 hours for the yeast to work.",
            "Divide it into equal portions. Roll out in an oval or round shape.",
            "Deep fry till golden brown, like a puri.",
            "Serve. "
        ],
        "cook_time": "1 Hour",
        "cuisine": "beverages"
    },
    {
        "name": "Quick Chicken Curry",
        "ingredients": [
            "1 kg chicken",
            "3 large onions, paste",
            "2 large tomatoes, pureed",
            "1 Tbsp garlic paste",
            "1 Tbsp ginger paste",
            "2 tsp coriander powder",
            "2 tsp cumin powder",
            "1/2 tsp turmeric powder",
            "1/2 tsp red chilli powder",
            "1 tsp garam masala powder",
            "2 Tbsp oil",
            "Salt to taste",
            "Chopped coriander for garnish"
        ],
        "instructions": [
            "Heat oil in a pan and sauté the onion paste, garlic & ginger paste till golden brown.",
            "Add tomato puree. When the tomato puree dries up, add coriander powder, cumin powder, garam masala, red chilli powder, turmeric powder and salt. Let the spices cook.",
            "Add chicken pieces into the masala. Stir well and cook till they are golden brown.",
            "Add 1/2 cup of water and stir. Cover with a lid and let it simmer till the chicken is cooked.",
            "Garnish with chopped coriander and serve."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Butter Chicken",
        "ingredients": [
            "700 gm raw chicken  ",
            "For theMarinade:",
            "1 tsp red chilli powder ",
            "1 tsp ginger and garlic paste ",
            "Salt to taste ",
            "1/2 kg curd  ",
            "For theGravy:",
            "175 gm white butter ",
            "1/2 tsp black cumin seeds ",
            "1/2 kg tomato, pureed ",
            "1/2 tsp sugar ",
            "1 tsp red chilli powder ",
            "Salt to taste ",
            "100 gm fresh cream ",
            "4 green chillies, sliced",
            "1/2 tsp fenugreek leaves, crushed"
        ],
        "instructions": [
            "For marinating the chicken",
            "In a mixing bowl, mix red chilli powder, ginger garlic paste, salt and curd.  ",
            "Add the raw chicken pieces to the marinade and mix well. Keep it in the refrigerator overnight or minimum 6 hours.  ",
            "Roast the marinated chicken in a tandoor or an oven for about 10-12 minutes until it is three-fourth done.  ",
            "For the chicken gravy",
            "Heat half the quantity of white butter in pan. ",
            "Pour in the tomato puree, and saute for 2-3 minutes. Add cumin seeds, sugar, red chilli powder and salt. Mix well.  ",
            "Add the prepared chicken, white butter, fresh cream, sliced green chillies and crushed fenugreek leaves.  Saute for 3-4 minutes and let the chicken cook.",
            "Cook till chicken is done. Serve hot with rice or naan."
        ],
        "cook_time": "30 Minutes + Marination time (overnight)",
        "cuisine": "beverages"
    },
    {
        "name": "Mocha Cooler",
        "ingredients": [
            "25 ml strong black coffee ",
            "250 ml milk ",
            "100 ml cream ",
            "4 scoops chocolate ice-cream ",
            "4 Tbsp drinking chocolate"
        ],
        "instructions": [
            "Dissolve the chocolate in hot coffee.   Pour in milk. Chill. ",
            "Whisk in cream.   Pour over ice cream in the glasses. ",
            "Serve immediately."
        ],
        "cook_time": "15 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Spiced Coffee",
        "ingredients": [
            "50 gm freshly ground coffee    ",
            "2 tsp cardamom powder    ",
            "3 Tbsp finely chopped ginger    ",
            "200 ml milk    ",
            "1 1/2 tsp sugar ",
            "4 Tbsp cream    ",
            "25 gm grated chocolate"
        ],
        "instructions": [
            "Combine coffee, 1 1/2 tsp cardamom powder and ginger. Brew in 1 liter of water. ",
            "Heat milk and sugar until scalding point. ",
            "Pour in the hot coffee with the milk.",
            "Whip cream and 1/2 tsp cardamom powder together. ",
            "Spoon over the coffee. ",
            "Serve with grated chocolate on the top."
        ],
        "cook_time": "15 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Chamomile Tea",
        "ingredients": [
            "2 tsp dried camomile flowers  ",
            "2 cups hot water   ",
            "Optional: 2 tsp sugar or honey"
        ],
        "instructions": [
            "Mix camomile flowers in hot water and let it infuse for 2 to 3 minutes. ",
            "Strain and serve.  ",
            "Optional: Sugar or honey can also be added to flavor it."
        ],
        "cook_time": "15 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Thandai",
        "ingredients": [
            "10 green cardamoms - seeds only",
            "1 1/2 tsp fennel seeds",
            "1/2 tsp black peppercorns",
            "1/2 coriander seeds",
            "1 tsp melon/sunflower seeds ",
            "50 gm skinned almonds",
            "5 Tbsp sugar",
            "3 Tbsp rose petals",
            "2 Tbsp rose water",
            "750 ml milk"
        ],
        "instructions": [
            "Roast spices lightly on a tawa.",
            "Soak all ingredients except milk in enough water to cover.",
            "Set aside for 2 hours.     Grind into a fine paste.",
            "Mix with milk.",
            "Strain liquid through muslin.",
            "Decorate with rose petals and serve chilled."
        ],
        "cook_time": "15 Minutes + Time to soak masala",
        "cuisine": "beverages"
    },
    {
        "name": "Phalse Ka Sharbat",
        "ingredients": [
            "1/2 kg phalsa",
            "200 gm sugar",
            "350 ml water",
            "Soda water",
            "Ice cubes"
        ],
        "instructions": [
            "Clean berries. Prepare sugar syrup with sugar and water.",
            "Boil for five minutes.",
            "Add the berries and allow to steep overnight. (Steep: Keeping the berries in the sugar-water liquid. This helps improve the flavor)",
            "Blend and strain mixture.",
            "Combine with soda and ice and serve."
        ],
        "cook_time": "Overnight",
        "cuisine": "beverages"
    },
    {
        "name": "Watermelon And Musk Melon Granita",
        "ingredients": [
            "200 ml watermelon juice",
            "200 ml musk melon juice",
            "Dry ice crushed as much required",
            "2 tsp sugar substitute",
            "Few sprigs of mint to garnish"
        ],
        "instructions": [
            "Put one teaspoon of sugar substitute in each juice.",
            "Whisk the juice with the dry ice, while putting spoonfuls of dry ice one spoon at a time.",
            "Until it resembles a sorbet or until the juice thickens and is a frozen sludge.",
            "Put in a martini glass and garnish with mint leaves.",
            "Alternatively, freeze the juice mix and blend to get the right consistency."
        ],
        "cook_time": "15 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Dragon Fruit And Yogurt Smoothie",
        "ingredients": [
            "1 dragon fruit",
            "2 fresh apricots",
            "2 drops of any sugar substitute ",
            "2 tbsp hung yogurt",
            "1/2  a cup milk",
            "6-7 ice cubes",
            "3 Tbsp corn cereal"
        ],
        "instructions": [
            "Peel and cut the dragon fruit into chunks.",
            "Deseed and dice up the apricots and put in a blender along with the dragon fruit.",
            "Put the sugar drops, yogurt and milk and give it nice blend.",
            "Add some ice cubes to cool it quickly.",
            "Add the corn flakes.",
            "Blend it well till it's luscious, smooth and silky.",
            "Serve in a nice glass garnished with cereal."
        ],
        "cook_time": "15 mins",
        "cuisine": "beverages"
    },
    {
        "name": "Mulled Wine",
        "ingredients": [
            "2 oranges",
            "1 peeled lemon",
            "60 g castor sugar",
            "6 whole cloves",
            "1 cinnamon stick",
            "3 fresh bay leaves",
            "1 tsp whole vanilla essence",
            "1 bottle red wine"
        ],
        "instructions": [
            "Put the castor sugar in a large saucepan over a medium heat.",
            "Peel large sections of peel from your oranges, lemon and lime using a speed peeler.",
            "Add the cloves, cinnamon stick and bay leaves.",
            "Add the pieces of peel and squeeze in the juice.",
            "Put vanilla essence and stir in just enough red wine to cover the sugar.",
            "Let this simmer until the sugar has completely dissolved into the red wine and add more wine.",
            "Bring the mixture to boil.",
            "Keep on a rolling boil for about 4 to 5 minutes, or until you have got a beautiful thick syrup.",
            "When the syrup is ready turn the heat down to low.",
            "When it is warm and delicious, ladle it into glasses and serve.",
            ""
        ],
        "cook_time": "30 mins",
        "cuisine": "beverages"
    },
    {
        "name": "Marys Talapeno Foam",
        "ingredients": [
            "2-3 dashes tabasco sauce",
            "200 ml tomato juice",
            "Juice of half a lime",
            "Salt to season",
            "3-4 jalapeno chillies/pickled red chillies",
            "1 Tbsp parsley",
            "2 gms Xantham gum",
            "For the Salsa:",
            "3-4 basil leaves",
            "Salt & pepper to taste",
            "Remains from the juice extracted"
        ],
        "instructions": [
            "Mix all the ingredients together in a blender.",
            "Strain the juice into a bowl. Keep the solids for later.",
            "Add the Xantham gum to the juice and mix well using a hand blender until it thickens.",
            "Use the remains of the juice and make a nice salsa with some basil, salt and pepper.",
            "Rim a martini glass with some salt and roasted jeera (cumin) powder.",
            "Pour the mixture in a foam gun and squeeze into the glass."
        ],
        "cook_time": "20 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Soy, Custard Apple and Peach Milkshake",
        "ingredients": [
            "1 custard apple",
            "1 peach",
            "6 cubes of crushed ice",
            "200 ml soya milk",
            "Few leaves of mint",
            "2 drops sugar free"
        ],
        "instructions": [
            "In a blender add the pulp of custard apple, slices of peach, soya milk, ice cubes and some mint leaves for flavor.",
            "Blend it all together until it's nice and smooth.",
            "Pour into a nice glass and garnish with sprig of mint."
        ],
        "cook_time": "10 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Chandan ka Sharbat",
        "ingredients": [
            "1 kg sugar ",
            "3 litre water ",
            "10 gms chandan powder (sandalwood ) - tied in a potli",
            "2 Tbsp milk ",
            "2 Tbsp lemon juice"
        ],
        "instructions": [
            "Dissolve the sugar in the water, not letting it come to a boil. ",
            "When sugar is dissolved, increase the heat and bring to a boil.   ",
            "Add the milk and continue to cook till scum forms on the sides, which you should skim off.   ",
            "Add the lemon juice and continue to cook till one thread consistency is reached.   ",
            "Take the pan off the heat and put the chandan packet into the syrup and cover immediately.   ",
            "Leave it overnight. ",
            "Strain and store the Chandan ka Sherbet in bottles."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Plum Squash",
        "ingredients": [
            "500 gm plums - soaked overnight  ",
            "3 cups sugar ",
            "1 Tbsp lemon juice  ",
            "1/2 tsp potassium meta bisulphate"
        ],
        "instructions": [
            "Squeeze the plums and discard the seeds.   ",
            "Blend the plum mixture and strain the juice through a sieve.  ",
            "Place the strained juice and sugar in a pan and stir over low heat till the sugar dissolves.  ",
            "Once it dissolves, add the lemon juice and bring to a boil. ",
            "Cook for about five minutes, stirring all the time, so that it does not get caramelised.   ",
            "Take the mixture off the heat and let it cool. ",
            "Mix in the potassium metabisulphite dissolved in one tbsp of boiled water.   ",
            "Store in sterilised bottles."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Litchi Squash",
        "ingredients": [
            "1 cup litchi pulp - de-seed and blend in a blender ",
            "1 cup sugar ",
            "1 cup water ",
            "1 Tbsp lemon juice  ",
            "1/2 tsp potassium metabisulphate"
        ],
        "instructions": [
            "Blend the litchi and strain the litchi juice through a sieve.  ",
            "Place the water and sugar in a pan and stir over low heat till the sugar dissolves.   ",
            "Once it dissolves, add the lemon juice and bring to a boil. ",
            "Cook for about two minutes.  ",
            "Take the mixture off the heat and let it cool. ",
            "Mix in the blended litchi and add the potassium metabisulphite dissolved in one tbsp of boiled water.   ",
            "Store the Litchi Squash in sterilised bottles."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Amras",
        "ingredients": [
            "1 cup ripe mango pulp or 1 cup tinned mango pulp ",
            "2 Tbsp sugar  ",
            "1 cup milk  ",
            "1/2 tsp green cardamom powder  ",
            "A  pinch of saffron  ",
            "1 tsp kevra water"
        ],
        "instructions": [
            "In a deep bowl add the mango pulp, sugar and milk, stir.    ",
            "Add the green cardamom powder, saffron and kevra water.    ",
            "Stir well and add some ice cubes and serve in glasses."
        ],
        "cook_time": "15 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Mint Lime Fizz",
        "ingredients": [
            "Juice of 6 limes   ",
            "350 gms sugar   ",
            "450 ml water   ",
            "1/4 cup mint leaves - chopped   ",
            "Soda - to dilute   ice-cubes"
        ],
        "instructions": [
            "Blend the lime juice, sugar and water. ",
            "Divide the lime juice mixture into four glasses, add some ice cubes and then divide the mint into the glasses too.     ",
            "Stir to mix and top up the glasses with soda and serve."
        ],
        "cook_time": "15 Minutes ",
        "cuisine": "beverages"
    },
    {
        "name": "Aam Panna",
        "ingredients": [
            "500 gm green mangoes  ",
            "1/2 cup sugar  ",
            "2 tsp salt  ",
            "2 tsp kala namak (black rock salt) ",
            "2 tsp roasted and powdered cumin seeds  ",
            "2 Tbsp finely chopped mint leaves  ",
            "2 cups water"
        ],
        "instructions": [
            "Boil the mangoes till they become soft inside, and the skin gets dis colored.    ",
            "When cool enough to handle, remove the skin and squeeze the pulp out of the mangoes.    ",
            "Mix all the ingredients together, blend and add 2 cups of water.    ",
            "Put some ice in the glasses and pour the panna over it."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Gajar ki Kanji",
        "ingredients": [
            "250 gm carrots-preferably the dark variety (called kaali gajar)  ",
            "6 cups water  ",
            "3 Tbsp powdered mustard seeds  ",
            "2 Tbsp salt"
        ],
        "instructions": [
            "Peel the carrots, and cut them into 7cm/3\" pieces, not too thin (about finger size, you can say). ",
            "Boil the water and add the carrots to it. ",
            "When the water comes to a boil again, shut off the heat and leave to cool.    ",
            "Add the salt and the mustard powder, and transfer into a jar with a lid, and keep this in the sun, to mature.    ",
            "In sunny weather, it takes 3-4 days, for the taste of the mustard to become strong. ",
            "Do not keep the jar in the sun, after it is ready."
        ],
        "cook_time": "20 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Strawberry Ice Cream Soda",
        "ingredients": [
            "1 packet prepared strawberry jelly",
            "4 scoops vanilla/ strawberry ice cream",
            "100 gm chopped strawberries",
            "2 bottles soda",
            "250 gm pureed strawberries",
            "1 Tbsp icing sugar",
            "Decoration:",
            "Sprigs of mint",
            "1 strawberry",
            "Grated chocolate"
        ],
        "instructions": [
            "Set jelly in the base of four glass tumblers.",
            "Place a scoop of ice cream in each glass.",
            "Whisk together strawberry puree and icing sugar.",
            "Pour over ice cream. Spoon over strawberries and pour on soda.",
            "Decorate with sprigs of mint and chocolate."
        ],
        "cook_time": "20 Minutes + Time to set jelly",
        "cuisine": "beverages"
    },
    {
        "name": "Chocolate Cake in a Pressure Cooker",
        "ingredients": [
            "1 cup flour  ",
            "1/4 cup cocoa powder  ",
            "1 1/4 tsp baking powder",
            "1/4 cup butter",
            "3/4 cup caster sugar",
            "1/4 cup water  ",
            "2 eggs  ",
            "1/2 tsp vanilla essence",
            "1/8 tsp salt  ",
            "6 inch round greased baking tin"
        ],
        "instructions": [
            "In a mixing bowl, sift the flour, cocoa powder and baking powder. ",
            "Add in the butter, sugar, salt, water and vanilla, and beat the ingredients using a whisk.     ",
            "Add the eggs and beat the batter until smooth. ",
            "Transfer into the baking tin.    ",
            "Heat the pressure cooker, covered with the lid but without the pressure, for 3-4 minutes on high heat, then place the cake tin in the empty cooker (do not add water in the cooker).     ",
            "Close the lid (without the pressure), lower the flame and let it cook until done (about 30 minutes)."
        ],
        "cook_time": "1 Hour",
        "cuisine": "beverages"
    },
    {
        "name": "Honey Chilli Potatoes",
        "ingredients": [
            "For the potatoes:",
            "2 potatoes, peeled and sliced",
            "3-4 Tbsp cornflour or maida",
            "Salt to taste",
            "1 tsp red chilli powder",
            "Oil, for deep frying",
            "For the base:",
            "1 tsp oil",
            "2 spring onions (with stalk), sliced",
            "1 Tbsp garlic paste",
            "1 capsicum, sliced",
            "2 Tbsp honey",
            "Salt, to taste",
            "1/4 tsp soya sauce",
            "3 tsp white sesame seeds",
            "2 tsp chilli sauce"
        ],
        "instructions": [
            "For the potatoes:",
            "In a bowl, add cornflour or maida, salt and red chilli powder.",
            "Add the sliced potatoes and mix well until the potatoes are coated.",
            "Heat oil in a wok and deep fry the potatoes until golden. Keep aside.",
            "For the Base:",
            "In a wok, add oil, garlic paste and spring onions. Saute on high heat for 1 minute.",
            "Add capsicum, honey, salt, soya sauce, chilli sauce. Saute for 2-3 minutes.",
            "Add the deep-fried potatoes and sesame seeds. Mix well and serve hot."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Vegetable Momos",
        "ingredients": [
            "For Dough:",
            "2 cups maida",
            "1/2 tsp salt ",
            "1/2 tsp baking powder   ",
            "For Filling: ",
            "1 cup carrots - grated ",
            "1 cup cabbage - grated ",
            "1 Tbsp oil ",
            "1/2 cup onion - finely chopped ",
            "1 tsp garlic - chopped  ",
            "1 tsp Soya sauce ",
            "Salt ",
            "1/4 tsp vinegar ",
            "1/4 tsp black pepper"
        ],
        "instructions": [
            "Mix the maida, salt and baking powder and knead to a stiff dough with water. ",
            "Heat oil and add the onion and garlic. ",
            "Saute over high heat and add the carrot and cabbage. Turn around over high heat till glossy. ",
            "Take it off the heat and mix in the Soya sauce, salt, vinegar and black pepper. ",
            "Roll the dough thin (translucent) and cut into 4\"-5\" rounds. ",
            "Take a round, wet edges and place some filling in the center. ",
            "Bring edges together to cover the filling. Twist to seal and fill the rest in the same way. ",
            "Steam for about 10 minutes and serve with soya sauce and chilli sauce."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Chole Bhature",
        "ingredients": [
            "For chole:",
            "2 cup chickpeas (channas)",
            "2 tsp oil",
            "1 bay leaf (tej patta)",
            "1 stick cinnamon (dalchini)",
            "3-4 cloves (laung)",
            "1 tsp whole pepper corns (sabut kali mirch)",
            "3 green cardamom  (choti elaichi)",
            "2 black cardamom (badi elaichi)",
            "1 tsp turmeric powder (haldi)",
            "1 tsp chili powder (lal mirch powder)",
            "1 tsp coriander powder (dhaniya powder)",
            "1 tsp cumin powder (zeera powder)",
            "1 tsp cumin seeds (zeera)",
            "1/2 tsp asafoetida (heeng)",
            "Salt to taste",
            "1 cup onions (chopped)",
            "1 cup tomatoes (chopped)",
            "1 tsp ginger (chopped)",
            "1 tsp garlic (chopped)",
            "1 tsp ajwain",
            "1 tsp lime juice",
            "1 green chili (chopped)                      1 tea bag                                                1 Tbsp butter",
            "For the bhaturas:",
            "2 cups maida (refined flour)",
            "1/2 tsp yeast, dissolved for 10 minutes in luke warm water",
            "1/2 cup whole wheat flour",
            "A pinch of salt",
            "Water to knead",
            "Oil for frying"
        ],
        "instructions": [
            "For chole:",
            "In a pan add oil, bay leaf, cinnamon, cumin seeds, cloves, whole pepper corns, green and black cardamom.",
            "After it gets brown add chopped onions and saute it.",
            "After sauteing add chopped ginger and garlic.",
            "Then add turmeric, chili powder, coriander powder, cumin powder, asafoetida, salt and fry well.",
            "For de glazing the pan add little water.",
            "Now add the chole (soaked overnight and pressure cooked) to the masala.",
            "After stirring well add tomatoes, little sugar and salt to the chole (chickpeas)",
            "Now add ajwain, chopped green chilies and water for the base.",
            "To get the color in the chole, add a tea bag to the masala.",
            "Simmer the chole gently for an hour and cover it.",
            "Add lime juice and a dollop of butter to it.",
            "Garnish the chole with coriander and butter.",
            "Serve the chole hot with bhaturas.",
            "For the bhaturas:",
            "Knead the whole wheat flour, maida and salt together with adequate amount of water.",
            "Sprinkle the yeast on top. Leave it for 2-3 hours for the yeast to work.",
            "Divide it into equal portions. Roll out in an oval or round shape.",
            "Deep fry till golden brown, like a puri.",
            "Serve. "
        ],
        "cook_time": "1 Hour",
        "cuisine": "beverages"
    },
    {
        "name": "Quick Chicken Curry",
        "ingredients": [
            "1 kg chicken",
            "3 large onions, paste",
            "2 large tomatoes, pureed",
            "1 Tbsp garlic paste",
            "1 Tbsp ginger paste",
            "2 tsp coriander powder",
            "2 tsp cumin powder",
            "1/2 tsp turmeric powder",
            "1/2 tsp red chilli powder",
            "1 tsp garam masala powder",
            "2 Tbsp oil",
            "Salt to taste",
            "Chopped coriander for garnish"
        ],
        "instructions": [
            "Heat oil in a pan and sauté the onion paste, garlic & ginger paste till golden brown.",
            "Add tomato puree. When the tomato puree dries up, add coriander powder, cumin powder, garam masala, red chilli powder, turmeric powder and salt. Let the spices cook.",
            "Add chicken pieces into the masala. Stir well and cook till they are golden brown.",
            "Add 1/2 cup of water and stir. Cover with a lid and let it simmer till the chicken is cooked.",
            "Garnish with chopped coriander and serve."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "beverages"
    },
    {
        "name": "Butter Chicken",
        "ingredients": [
            "700 gm raw chicken  ",
            "For theMarinade:",
            "1 tsp red chilli powder ",
            "1 tsp ginger and garlic paste ",
            "Salt to taste ",
            "1/2 kg curd  ",
            "For theGravy:",
            "175 gm white butter ",
            "1/2 tsp black cumin seeds ",
            "1/2 kg tomato, pureed ",
            "1/2 tsp sugar ",
            "1 tsp red chilli powder ",
            "Salt to taste ",
            "100 gm fresh cream ",
            "4 green chillies, sliced",
            "1/2 tsp fenugreek leaves, crushed"
        ],
        "instructions": [
            "For marinating the chicken",
            "In a mixing bowl, mix red chilli powder, ginger garlic paste, salt and curd.  ",
            "Add the raw chicken pieces to the marinade and mix well. Keep it in the refrigerator overnight or minimum 6 hours.  ",
            "Roast the marinated chicken in a tandoor or an oven for about 10-12 minutes until it is three-fourth done.  ",
            "For the chicken gravy",
            "Heat half the quantity of white butter in pan. ",
            "Pour in the tomato puree, and saute for 2-3 minutes. Add cumin seeds, sugar, red chilli powder and salt. Mix well.  ",
            "Add the prepared chicken, white butter, fresh cream, sliced green chillies and crushed fenugreek leaves.  Saute for 3-4 minutes and let the chicken cook.",
            "Cook till chicken is done. Serve hot with rice or naan."
        ],
        "cook_time": "30 Minutes + Marination time (overnight)",
        "cuisine": "beverages"
    }
]