[
    {
        "name": "Milk Mendiant",
        "ingredients": [
            "500 gms milk cooking chocolate",
            "1 per piece  cashew",
            "1 per piece  almond",
            "1 per piece  prunes (small, diced)",
            "1 per piece  apricot (small, diced)",
            "1 per piece raisin"
        ],
        "instructions": [
            "Melt the milk chocolate in a microwave oven or a double boiler.",
            "Cool it down to 26 degrees and warm upto 28 degress to temper the chocolate and ensure a good crystallisation.",
            "Put the chocolate into moulds and scrape off excess chocolate.",
            "Tap the mould onto a surface to avoid air bubbles.",
            "Set cashew, almond, prunes, apricots and raisin while the chocolate is still in semi liquid state.",
            "Demould and serve."
        ],
        "cook_time": "15 Minutes ",
        "cuisine": "french"
    },
    {
        "name": "Ratatouille Nicoise",
        "ingredients": [
            "600 gms eggplant",
            "700 gms zucchinis",
            "1.5 kg tomatoes",
            "1 chopped onion",
            "1 green pepper",
            "1 red  pepper",
            "1 yellow pepper",
            "2 crushed cloves of garlic",
            "Olive oil",
            "Basil and Thyme",
            "Salt",
            "Pepper"
        ],
        "instructions": [
            "Wash eggplants, zucchinis and paprika.",
            "Cut them in dices.",
            "Wash and peel tomatoes, dice them.  Sauté eggplant in olive oil for 3 to 4 minutes and remove them.",
            "Do the same with the zucchinis, but add onions and paprika to them.  Put all the veggies back to the fryer and tomatoes, garlic, basil and thyme. Add two tablespoons of olive oil to the dish. Salt and pepper. stir.  Cook with the lid on, cook gently on heat for 10 t0 12 min,. Stir during cooking.",
            "For the last 3  minutes remove the lid, so that the remaining liquid would evaporate. ",
            "Once cooked check for seasoning and serve with rice or pasta  "
        ],
        "cook_time": "45 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Lobster Thermidor",
        "ingredients": [
            "1 whole lobster (weighing approx. 500 grams)",
            "100 gms mushrooms",
            "8 gms garlic",
            "10 gms red onion",
            "50 ml fresh cream",
            "1 egg yolk",
            "60 ml cognac",
            "10 gm thyme",
            "A pinch of nutmeg",
            "10 - 20 gms Parmesan cheese",
            "20 - 30 gms Gruyere cheese"
        ],
        "instructions": [
            "Split the lobster length-wise into two parts and clean the head thoroughly under cold running water.",
            "Scope all the meat from the lobster and clean.  Keep the shell aside for finishing in the oven.",
            "Now dice the Lobster meat. In another pan sauté the garlic and onion & later add the sliced mushrooms.",
            "After the mushroom has slightly dried out add in the lobster meat and de-glaze with 30 ml Cognac. ",
            "In another pan, add the rest of the Cognac to the fresh cream and one egg yolk, grate the nutmeg and mix well.",
            "Add this mixture to the pan containing lobster and mix well, mix in the thyme now.",
            "Get the pan off the flame and mix well till it turns thick. Fill the cleaned empty shell of the lobster with this mixture that has been prepared.",
            "Top up the lobster with Gruyère cheese and Parmesan cheese. Finish in a medium hot oven for 4 minutes. "
        ],
        "cook_time": "35 minutes",
        "cuisine": "french"
    },
    {
        "name": "Crepe Suzette",
        "ingredients": [
            "6 Tbsp flour6 eggs6 Tbsp milk3 Tbsp heavy creamUnsalted butter, as needed",
            "For the sauce:",
            "3 oranges",
            "16 Tbsp unsalted butter, softened",
            "10 Tbsp. sugar",
            "7 Tbsp Cointreau",
            "1 tsp orange juice",
            "5 Tbsp cognac",
            "For the crepes:",
            "6 Tbsp flour",
            "6 eggs",
            "6 Tbsp milk",
            "3 Tbsp heavy cream",
            "Unsalted butter, as needed",
            "3 oranges",
            "16 Tbsp unsalted butter, softened",
            "10 Tbsp sugar",
            "7 Tbsp Cointreau",
            "1 tsp orange flower water",
            "5 Tbsp cognac"
        ],
        "instructions": [
            "Whisk together flour and eggs in a medium bowl. Add milk and cream, and whisk until smooth.",
            "Pour through a fine strainer into a bowl, cover, and refrigerate for 2 hours or overnight.",
            "For the sauce:",
            "Use a vegetable peeler to remove rind from 2 of the oranges, avoiding pith; mince rind and set aside.",
            "Juice all the oranges and set juice aside.",
            "In a medium bowl, beat butter and half cup sugar on high speed of a hand mixer until light and fluffy, about 2 minutes. Add rind to butter and beat for 1 minute.",
            "Gradually drizzle in juice, 2 tbsp. of the Cointreau, kirsch, and orange flower water, beating constantly until very light and fluffy, about 2 minutes more.",
            "Heat a seasoned crepe pan or small nonstick skillet over medium-high heat until hot.",
            "Grease pan with a little butter, and then pour in 1/4 cup batter.",
            "Working quickly, swirl batter to just coat pan, and cook until edges brown, about 1 minute. Turn with a spatula and brown other side for about 30 seconds.",
            "Transfer to a plate and repeat with remaining batter, greasing pan only as needed.",
            "Add caramel sugar in a pan and add orange butter sauce in a 12 inch skillet over medium heat until bubbling.",
            "Dip both sides of one crepe in sauce, then, with best side facing down, fold in half, then in half again. Repeat process with remaining crepes, arranging and overlapping them around the perimeter of the pan. Sprinkle with remaining sugar.",
            "Remove pan from heat, pour remaining Cointreau and the cognac over crêpes, and carefully ignite with a match. Spoon sauce over crepes until flame dies out, and then serves immediately."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Spinach and Potato Soup",
        "ingredients": [
            "100 gms potatoes, peeled and chopped",
            "30 gms leeks, chopped",
            "50 gms butter",
            "20 ml olive oil",
            "300 ml full cream milk",
            "60 ml fresh cream",
            "150 gm spinach, cleaned and chopped",
            "8 cloves garlic, chopped",
            "60 gms onion, chopped",
            "1 tsp thyme, chopped",
            "A pinch of nutmeg",
            "Salt to taste",
            "White pepper powder to taste"
        ],
        "instructions": [
            "Heat the oil in a large saucepan. Add the chopped onions, thyme, garlic and saute for a few minutes.",
            "Add the chopped potatoes, toss gently and sprinkle some salt.",
            "After about 5 minutes add milk and cook on low flame for abut 20 minutes. Or till the potatoes are cooked and are soft.",
            "Now, blend the potatoes to a smooth soup consistency (add extra milk if required).",
            "Check for seasoning and finish with cream and nutmeg for flavoring.",
            "Toss spinach in soft butter and check for seasoning. Mix spinach with the finished potato soup and serve hot."
        ],
        "cook_time": "25 minutes",
        "cuisine": "french"
    },
    {
        "name": "Gousse d Ail (Mushroom on Toast)",
        "ingredients": [
            "400 gms button mushrooms, halved",
            "100 gms portobello mushroom, sliced",
            "100 gms dried porcini mushrooms, soaked and chopped",
            "40 gms dried morels, soaked and chopped",
            "8 cloves garlic, chopped",
            "50 gms onion, chopped",
            "2 Tbsp olive oil",
            "50 ml sherry",
            "Salt to taste",
            "Ground black pepper to taste",
            "5 ml truffle oil",
            "30 gms butter",
            "4 pieces of bread, sliced in half"
        ],
        "instructions": [
            "Heat the oil in a large saucepan. Add the chopped onions, garlic and saute for a few minutes.",
            "Add the mushrooms and toss gently. Cook the mushrooms until tender, for about 8 minutes.",
            "Add the sherry, parsley, salt, and pepper. Cook for another 5 minutes, or until mushrooms are soft and finish with butter and truffle oil.",
            "Check for seasoning and serve hot with toasted white bread on top."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Coq Au Vin (Chicken Braised in Wine)",
        "ingredients": [
            "For marination:",
            "1500 ml red wine, full body",
            "100 gms onion, sliced",
            "30 gms celery stalks, sliced",
            "100 gms carrot, peeled and sliced",
            "20 garlic clove, peeled and flattened",
            "1 tsp whole black peppercorns",
            "2 Tbsp olive oil",
            "4 chicken halves, with bone and skin on",
            "Cooking chicken:",
            "1 Tbsp olive oil",
            "150 gms bacon slices, thick",
            "3 Tbsp all purpose flour",
            "60 gms onion, chopped",
            "10 garlic cloves, chopped",
            "1 tsp thyme sprigs, chopped",
            "2 tsp parsley sprigs",
            "2 bay leaves, small",
            "200 ml chicken stock",
            "50 gms butter",
            "150 gms button mushrooms"
        ],
        "instructions": [
            "For marinating chicken:",
            "Combine wine, onion, celery, carrot, garlic, and peppercorns in large pot and bring to boil over high heat. Reduce heat to medium and simmer 5 minutes. Cool completely; mix in oil.",
            "Place the chicken pieces in a large bowl and pour the wine mixture over it. Cover and refrigerate for at least 12 hours and up to 24 hours, turning the chicken occasionally.",
            "For cooking chicken:",
            "Using tongs, transfer chicken pieces from marinade to paper towels to drain; pat dry.",
            "Strain the marinade and reserve the vegetables and liquid separately.",
            "Heat oil in heavy large pot over medium-high heat. Add bacon and saute until crisp and brown. Using slotted spoon, transfer bacon to small bowl. Add chicken, skin side down, to drippings in pot. Saute until brown, about 3 minutes per side.",
            "Transfer chicken to large bowl and add vegetables reserved from marinade to the pot. Saute until brown, for about 6minutes. Mix in flour and stir for about 2 minutes. Gradually whisk in reserved marinade liquid. Bring to boil, whisking frequently. Cook until sauce thickens, whisking occasionally, for about 2 minutes.",
            "Mix in the shallots, garlic, parsley, and bay leaves, stock. Add chicken and bring to simmer; reduce heat to medium-low. Cover pot and simmer chicken 20 minutes. Using tongs, turn chicken over. Cover and simmer until tender, about 10 minutes longer.",
            "Melt butter in heavy large skillet over medium heat. Add mushrooms and saute until tender, for about 8 minutes. Transfer mushrooms to plate.",
            "Melt butter in the same skillet. Add onions and saute until beginning to brown, about 3 minutes. Transfer onions to plate alongside mushrooms.",
            "Using tongs, transfer chicken to plate. Strain sauce from pot into reserved skillet, pressing on solids in strainer to extract all sauce; discard solids. Bring sauce to simmer, scraping up browned bits. Return sauce to pot.",
            "Add mushrooms and bacon. Simmer uncovered until sauce is slightly reduced, about 8 minutes. Tilt pot and spoon off excess fat from top of sauce. Season sauce with salt and pepper. Return chicken to sauce.",
            "Cook for another 2 minutes and arrange chicken on plate and sprinkle with parsley. Serve hot."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Lobster Thermidor",
        "ingredients": [
            "2 live lobsters (500gms each)",
            "150 gms unsalted butter",
            "100 gms mushrooms, trimmed and thinly sliced",
            "2 tsp Dijon mustard",
            "Salt to taste",
            "Black pepper to taste",
            "80 ml brandy",
            "250 ml heavy cream, scalded",
            "2 large egg yolks"
        ],
        "instructions": [
            "Plunge lobsters headfirst into a pot of boiling salted water. Loosely cover pot and cook lobsters over moderately high heat for 9 minutes from the time they enter water. Then transfer with tongs to sink to cool.",
            "When lobsters are cool enough to handle, twist off claws and crack them, then remove meat. ",
            "Halve lobsters lengthwise with kitchen knife, beginning from tail end, then remove tail meat, reserving shells. Cut all lobster meat into 2.5cm pieces. Discard lobster innards, then rinse and dry shells.",
            "Heat butter in a heavy saucepan over moderate heat , then cook mushrooms, stirring, until liquid that mushrooms give off is evaporated and they begin to brown, about 5 minutes. ",
            "Add lobster meat, mustard, salt, and pepper and reduce heat to low. Add 50ml brandy and half the amount of  cream and simmer 5 minutes.",
            "Whisk together yolks and remaining brandy in a small bowl. Slowly pour remaining cream into yolks, whisking constantly, and transfer to a small heavy saucepan. ",
            "Cook the mixture over very low heat, whisking constantly, until it is slightly thickened now add the same to lobster mixture, stirring gently.",
            "Arrange lobster shells, cut sides up, in a plate and spoon lobster with some of sauce into shells. Heat  under salamander until golden brown, for about 4 to 5 minutes. Serve remaining sauce on the side."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Beetroot and Avocado Tartare",
        "ingredients": [
            "Ingredients:",
            "120gm beetroot",
            "Seasonings, as per taste",
            "20ml sunflower oil ",
            "60gm avocado",
            "30gm cucumber",
            "For the marination",
            "10ml lemon juice",
            "1 Tbsp sugar",
            "10ml water ",
            "1 tsp sesame seed paste",
            "1 tsp soya sauce",
            "For the Avocado Marination with Spicy Mayo",
            "30gm egg-less Mayonnaise (ready to use)",
            "5gm chilli garlic paste ",
            "For the Garnish5 tsp roasted poppy seeds",
            "3 gm blanched edamame pods/ green peas",
            "5 gm Kimchi dressing (ready to use)"
        ],
        "instructions": [
            "Wash and peel the beetroots. Season them with salt and pepper, and rub with oil. Wrap them in silver foil and roast in the oven for about 15-20 minutes at 140 degree Celsius until they are cooked. Cool, and cut into small dices.",
            "Peel the avocado and cut into small dices.",
            "Slice cucumber into rounds and arrange on a plate in concentric circles.",
            "To make the marinade, mix together all the ingredients, and add beetroot and avocado to the it. Keep it aside for 5 minutes.",
            "Take a round mould, and neatly layer the beetroot at the base, followed by a layer of avocado. Finish with a layer of beetroot on top, sprinkling some poppy seeds between each layer.",
            "Garnish with blanched edamame / green peas, and serve with kimchi."
        ],
        "cook_time": "45 minutes",
        "cuisine": "french"
    },
    {
        "name": "Coq Au Vin",
        "ingredients": [
            "900 gm chicken leg w/o skin               ",
            "900 gm chicken breast w/o skin        ",
            "200 gm flour                                 ",
            "1/2 cup vegetable oil                 ",
            "75 gm garlic cloves caramelized         ",
            "200 gm pearl onions peeled                        ",
            "200 gm button mushrooms                 ",
            "150 gm bacon lardons               ",
            "20 gm thyme sprigs                   ",
            "2 cups red wine",
            "2 cups brown sauce / demi glace                   ",
            "80 gm butter for sauce                          ",
            "800 gm potatoes tournee            ",
            "30 gm parsley chopped               ",
            "80 gm butter for potatoes   ",
            "10 portions bread",
            "Salt and pepper - to taste"
        ],
        "instructions": [
            "Season the chicken leg and breast with salt and pepper.",
            "Dredge in flour and saute in the vegetable oil. ",
            "Remove the oil and add the bacon, mushrooms,garlic, pearl onions and thyme sprig. ",
            "De-glaze with the red wine and reduce by half. ",
            "Add the demi glace to the chicken and cook till the chicken is cooked fully through.                  Heat the butter in the pan and saute the potatoes until hot but still white.",
            "Add the parsley.",
            ""
        ],
        "cook_time": "45 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Algerienne Fish",
        "ingredients": [
            "1/2 kg fish fillet ",
            "1 lemon, juice",
            "6-8 parsley stalks ",
            "1 green capsicum - sliced and blanched ",
            "1 red capsicum - sliced ",
            "1 Tbsp butter ",
            "1 onion - chopped ",
            "1 tsp garlic paste ",
            "1/2 kg peeled, seeded tomatoes ",
            "1 Tbsp chopped parsley",
            "Salt and pepper "
        ],
        "instructions": [
            "Season the fish and squeeze lemon juice. Add parsley stalks. ",
            "Cover with foil and bake at 180 degrees for about 15 minutes. ",
            "While the fish bakes, fry onions in butter until soft. Add capsicums. ",
            "Season well and add garlic. Stir in tomatoes and paprika. ",
            "Cook well.",
            "Spoon over this mix over the fish and garnish with parsley. "
        ],
        "cook_time": "25 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Poisson Provencale",
        "ingredients": [
            "Red tuna fish ",
            "For marination:",
            "Lemon ",
            "Salt ",
            "Black pepper ",
            "Mixed herbs (rosemary, thyme, and marjoram) ",
            "For main preparation:",
            "1 Tbsp refined oil ",
            "4 Tbsp chopped onions ",
            "3 tsp roasted, peeled and de-seeded capsicum ",
            "4 tsp chopped tomatoes ",
            "1 tsp chopped garlic ",
            "1 tsp chopped parsley ",
            "1 pinch of mixed herbs ",
            "Marinated fish ",
            "25 ml white wine ",
            "1/2 cup of water ",
            "Salt to taste ",
            "pepper to taste "
        ],
        "instructions": [
            "Marinate the fish with lemon, salt, black pepper powder and herbs for 1 hour. ",
            "Heat oil in pan. ",
            "Add chopped onions and saute till translucent. ",
            "Now add the roasted, peeled and de-seeded capsicum, tomatoes, garlic, chopped parsley, herbs and the marinated fish.",
            "Add white wine, water, salt and pepper. ",
            "Cover the pan and cook the preparation for 20 minutes on low flame.",
            "Serve poisson provencale with rice."
        ],
        "cook_time": "25 Minutes + Marination time(1hr)",
        "cuisine": "french"
    },
    {
        "name": "Le Turinois (Chocolate Chestnut Cake)",
        "ingredients": [
            "1 kg chestnut ",
            "Water to cover    ",
            "350 ml milk    ",
            "1 tsp toasted fennel \nseeds    ",
            "125 gm butter    ",
            "125 gm castor sugar    ",
            "250 gm chopped bitter \nchocolate    ",
            "1/2 tsp vanilla essence    ",
            "1-2 Tbsp rum"
        ],
        "instructions": [
            "Put chestnuts in a pan. Cover with cold water and milk.   Simmer until \ntender and drain. ",
            "Peel and mash chestnuts. ",
            "Mix cream, butter and sugar with melted chocolate in 75 ml water. ",
            "Once it's cool add it to the butter \nmixture and chestnuts.   Flavor with vanilla and rum. Mix well. ",
            "Pour \ninto an oiled and lined tin. Chill overnight. Turn out and serve with \ncream."
        ],
        "cook_time": "1 Hour",
        "cuisine": "french"
    },
    {
        "name": "Hollandaise Sauce",
        "ingredients": [
            "2 Tbsp white-wine or tarragon vinegar  ",
            "Lemon juice ",
            "4 Tbsp boiling water ",
            "3 large egg yolks ",
            "1/2 cup unsalted butter ",
            "1/4 tsp cayenne ",
            "1/2 tsp salt"
        ],
        "instructions": [
            "Melt the butter and keep it warm. ",
            "Heat the vinegar or lemon juice until warm. ",
            "Meanwhile keep a small saucepan with boiling water and a measuring Tbsp ready. ",
            "Place the top of a double boiler over (not in) hot water. (This means the bottom of the top of the double boiler sound not make contact with the water heating in the bottom half of the double boiler.) ",
            "Place the egg yolks in the top of a double boiler and whisk until they begin to thicken. ",
            "Now add 1 Tbsp of the boiling water. ",
            "Continue to beat the sauce until it begins to thicken. ",
            "Repeat with the remaining water, one Tbsp at a time, beating the mixture after each addition. ",
            "Now add the warmed vinegar or lemon juice. Remove the double boiler from the heat. ",
            "Beat the sauce briskly with a wire whisk. Continue to beat the mixture as you slowly pour in the melted butter. ",
            "Add the salt and cayenne and beat the sauce until it is thick. Serve immediately."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Profiteroles",
        "ingredients": [
            "For choux pastry:",
            "125 ml water    ",
            "50 gm butter ",
            "60 gm flour    ",
            "2 large eggs ",
            "For chocolate filling:",
            "125 gm chopped chocolate ",
            "60 ml cream    ",
            "50 gm butter    ",
            "2 egg yolks    ",
            "Rum to taste      ",
            "For cream filling:",
            "Chocolate sauce 275 ml water ",
            "275 gm sugar    ",
            "1 heaped Tbsp cocoa    ",
            "75 gm chopped chocolate    ",
            "125 ml cream    ",
            "2 Tbsp butter"
        ],
        "instructions": [
            "To make the pastry:",
            "Boil water and butter together. ",
            "Put in flour; stir until mixture leaves the sides of the pan. Beat in the eggs a little at a time. ",
            "Pipe out small domes on a damp baking sheet.   ",
            "Bake at 200 degrees C for 20 minutes or until risen and golden in color. ",
            "After baking, pierce each profiterole to allow steam to escape. ",
            "Return pastry to a low oven to dry out.     ",
            "8. For the filling:",
            "Melt chocolate with the cream and butter. ",
            "Stir in yolks.  Flavor with rum. Pipe into profiteroles along with the whipped cream.     ",
            "11. For the sauce:",
            "Prepare sugar syrup with water, sugar, cocoa and cream. ",
            "Boil it for 5 minutes. Stir in chocolate and butter. Serve with dessert."
        ],
        "cook_time": "1 Hour 30 Minutes",
        "cuisine": "french"
    },
    {
        "name": "French Pea Soup",
        "ingredients": [
            "500 gm shelled peas ",
            "1 onion, finely chopped ",
            "2 1/2 cup vegetable or chicken stock ",
            "1 Tbsp olive oil ",
            "2 tsp fresh cream ",
            "Salt and pepper to taste"
        ],
        "instructions": [
            "Heat oil in a pan.  Add the onion and saute till white. ",
            "Now add the peas and saute for about 5 minutes. ",
            "Add seasoning and vegetable stock. ",
            "Give it a boil and simmer till the peas are cooked. ",
            "Puree in a grinder. Heat again and serve hot topped with fresh cream."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Crêpe Suzette",
        "ingredients": [
            "200 gm orange juice  ",
            "Lemon ",
            "1 star anise ",
            "2 eggs",
            "2 Tbsp fine sugar ",
            "3 Tbsp refined flour ",
            "100 gm milk",
            "1 Tbsp butter ",
            "Cinnamon powder"
        ],
        "instructions": [
            "Pour orange juice, lemon juice and a star anise in a pan and boil it. ",
            "Reduce the heat and let the orange juice simmer. Add the 1 Tbsp fine sugar to it.",
            "Break eggs in a bowl, add flour, 1 Tbsp sugar and milk to it. Whisk it. This is the batter.",
            "In a pan heat some butter and wait till it melts. Add the butter to the batter above.",
            "Then keep it in the refrigerator for 15-20 minutes (till the batter prepares)",
            "Put butter in a pan and pour the batter into the pan and cook it until it turns light brown. ",
            "Flip the crepe. ",
            "Fold the crepe quarterly and spread butter on top. Pour reduced orange juice over the crepe and sprinkle some cinnamon powder."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Mixed Vegetable Gratin",
        "ingredients": [
            "18-19 par-boiled baby potatoes",
            "500 gm par-boiled pumpkin",
            "1 Par boiled cauliflower",
            "2 cobs of parboiled sweet corn",
            "Salt & pepper",
            "1 tsp chilli flakes",
            "3 tsp cumin",
            "2 tsp coriander seeds",
            "2 Tbsp butter",
            "Sprigs of Thyme",
            "Béchamel sauce",
            "100 gm Cheddar cheese",
            "50 gm Processed cheese ",
            "For the Bechamel sauce:",
            "3 Tbsp butter",
            "500ml milk",
            "Sprigs of fresh thyme",
            "5 Tbsp flour",
            "Salt and pepper",
            "1/2 tsp nutmeg"
        ],
        "instructions": [
            "Pre-heat the oven at 180 degrees.",
            "Halve par boiled baby potatoes. ",
            "Heat the pan and then add 2 Tbsp of butter.",
            "Add a handful of par boiled baby potatoes and par boiled pumpkin chopped.",
            "Add 1 bowl of frozen sweet corn and par boiled cauliflower cut into florets. ",
            "Then add salt & pepper, 1/2 tsp of chili flakes, 3 tsp of cumin seeds, 2 tsp of coriander seeds and some sprigs of thyme.",
            "Cook till the vegetables are soft. After some time toss and turn off the heat.",
            "Transfer the cooked vegetables to a baking dish and pour the Bechamel sauce on top.",
            "Layer it with some grated processed and cheddar cheese.",
            "Add fresh thyme, 1/2 tsp of chili flakes and pepper on top.",
            "Put the gratin into the pre-heated oven for 10-15 minutes and serve. ",
            "For Bechamel sauce:",
            "Heat 3 Tbsp butter in a pan.",
            "Add some sprigs of fresh thyme and mix.",
            "Then add 5 Tbsp of flour.",
            "Whisk till it turns into a thick paste.",
            "Then add 500 ml milk and continue to whisk till it gets into a smooth consistency.",
            "Season it with pepper, salt and nutmeg to taste."
        ],
        "cook_time": "1 Hour",
        "cuisine": "french"
    },
    {
        "name": "Chocolate Cake in a Pressure Cooker",
        "ingredients": [
            "1 cup flour  ",
            "1/4 cup cocoa powder  ",
            "1 1/4 tsp baking powder",
            "1/4 cup butter",
            "3/4 cup caster sugar",
            "1/4 cup water  ",
            "2 eggs  ",
            "1/2 tsp vanilla essence",
            "1/8 tsp salt  ",
            "6 inch round greased baking tin"
        ],
        "instructions": [
            "In a mixing bowl, sift the flour, cocoa powder and baking powder. ",
            "Add in the butter, sugar, salt, water and vanilla, and beat the ingredients using a whisk.     ",
            "Add the eggs and beat the batter until smooth. ",
            "Transfer into the baking tin.    ",
            "Heat the pressure cooker, covered with the lid but without the pressure, for 3-4 minutes on high heat, then place the cake tin in the empty cooker (do not add water in the cooker).     ",
            "Close the lid (without the pressure), lower the flame and let it cook until done (about 30 minutes)."
        ],
        "cook_time": "1 Hour",
        "cuisine": "french"
    },
    {
        "name": "Honey Chilli Potatoes",
        "ingredients": [
            "For the potatoes:",
            "2 potatoes, peeled and sliced",
            "3-4 Tbsp cornflour or maida",
            "Salt to taste",
            "1 tsp red chilli powder",
            "Oil, for deep frying",
            "For the base:",
            "1 tsp oil",
            "2 spring onions (with stalk), sliced",
            "1 Tbsp garlic paste",
            "1 capsicum, sliced",
            "2 Tbsp honey",
            "Salt, to taste",
            "1/4 tsp soya sauce",
            "3 tsp white sesame seeds",
            "2 tsp chilli sauce"
        ],
        "instructions": [
            "For the potatoes:",
            "In a bowl, add cornflour or maida, salt and red chilli powder.",
            "Add the sliced potatoes and mix well until the potatoes are coated.",
            "Heat oil in a wok and deep fry the potatoes until golden. Keep aside.",
            "For the Base:",
            "In a wok, add oil, garlic paste and spring onions. Saute on high heat for 1 minute.",
            "Add capsicum, honey, salt, soya sauce, chilli sauce. Saute for 2-3 minutes.",
            "Add the deep-fried potatoes and sesame seeds. Mix well and serve hot."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Vegetable Momos",
        "ingredients": [
            "For Dough:",
            "2 cups maida",
            "1/2 tsp salt ",
            "1/2 tsp baking powder   ",
            "For Filling: ",
            "1 cup carrots - grated ",
            "1 cup cabbage - grated ",
            "1 Tbsp oil ",
            "1/2 cup onion - finely chopped ",
            "1 tsp garlic - chopped  ",
            "1 tsp Soya sauce ",
            "Salt ",
            "1/4 tsp vinegar ",
            "1/4 tsp black pepper"
        ],
        "instructions": [
            "Mix the maida, salt and baking powder and knead to a stiff dough with water. ",
            "Heat oil and add the onion and garlic. ",
            "Saute over high heat and add the carrot and cabbage. Turn around over high heat till glossy. ",
            "Take it off the heat and mix in the Soya sauce, salt, vinegar and black pepper. ",
            "Roll the dough thin (translucent) and cut into 4\"-5\" rounds. ",
            "Take a round, wet edges and place some filling in the center. ",
            "Bring edges together to cover the filling. Twist to seal and fill the rest in the same way. ",
            "Steam for about 10 minutes and serve with soya sauce and chilli sauce."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Chole Bhature",
        "ingredients": [
            "For chole:",
            "2 cup chickpeas (channas)",
            "2 tsp oil",
            "1 bay leaf (tej patta)",
            "1 stick cinnamon (dalchini)",
            "3-4 cloves (laung)",
            "1 tsp whole pepper corns (sabut kali mirch)",
            "3 green cardamom  (choti elaichi)",
            "2 black cardamom (badi elaichi)",
            "1 tsp turmeric powder (haldi)",
            "1 tsp chili powder (lal mirch powder)",
            "1 tsp coriander powder (dhaniya powder)",
            "1 tsp cumin powder (zeera powder)",
            "1 tsp cumin seeds (zeera)",
            "1/2 tsp asafoetida (heeng)",
            "Salt to taste",
            "1 cup onions (chopped)",
            "1 cup tomatoes (chopped)",
            "1 tsp ginger (chopped)",
            "1 tsp garlic (chopped)",
            "1 tsp ajwain",
            "1 tsp lime juice",
            "1 green chili (chopped)                      1 tea bag                                                1 Tbsp butter",
            "For the bhaturas:",
            "2 cups maida (refined flour)",
            "1/2 tsp yeast, dissolved for 10 minutes in luke warm water",
            "1/2 cup whole wheat flour",
            "A pinch of salt",
            "Water to knead",
            "Oil for frying"
        ],
        "instructions": [
            "For chole:",
            "In a pan add oil, bay leaf, cinnamon, cumin seeds, cloves, whole pepper corns, green and black cardamom.",
            "After it gets brown add chopped onions and saute it.",
            "After sauteing add chopped ginger and garlic.",
            "Then add turmeric, chili powder, coriander powder, cumin powder, asafoetida, salt and fry well.",
            "For de glazing the pan add little water.",
            "Now add the chole (soaked overnight and pressure cooked) to the masala.",
            "After stirring well add tomatoes, little sugar and salt to the chole (chickpeas)",
            "Now add ajwain, chopped green chilies and water for the base.",
            "To get the color in the chole, add a tea bag to the masala.",
            "Simmer the chole gently for an hour and cover it.",
            "Add lime juice and a dollop of butter to it.",
            "Garnish the chole with coriander and butter.",
            "Serve the chole hot with bhaturas.",
            "For the bhaturas:",
            "Knead the whole wheat flour, maida and salt together with adequate amount of water.",
            "Sprinkle the yeast on top. Leave it for 2-3 hours for the yeast to work.",
            "Divide it into equal portions. Roll out in an oval or round shape.",
            "Deep fry till golden brown, like a puri.",
            "Serve. "
        ],
        "cook_time": "1 Hour",
        "cuisine": "french"
    },
    {
        "name": "Quick Chicken Curry",
        "ingredients": [
            "1 kg chicken",
            "3 large onions, paste",
            "2 large tomatoes, pureed",
            "1 Tbsp garlic paste",
            "1 Tbsp ginger paste",
            "2 tsp coriander powder",
            "2 tsp cumin powder",
            "1/2 tsp turmeric powder",
            "1/2 tsp red chilli powder",
            "1 tsp garam masala powder",
            "2 Tbsp oil",
            "Salt to taste",
            "Chopped coriander for garnish"
        ],
        "instructions": [
            "Heat oil in a pan and sauté the onion paste, garlic & ginger paste till golden brown.",
            "Add tomato puree. When the tomato puree dries up, add coriander powder, cumin powder, garam masala, red chilli powder, turmeric powder and salt. Let the spices cook.",
            "Add chicken pieces into the masala. Stir well and cook till they are golden brown.",
            "Add 1/2 cup of water and stir. Cover with a lid and let it simmer till the chicken is cooked.",
            "Garnish with chopped coriander and serve."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Butter Chicken",
        "ingredients": [
            "700 gm raw chicken  ",
            "For theMarinade:",
            "1 tsp red chilli powder ",
            "1 tsp ginger and garlic paste ",
            "Salt to taste ",
            "1/2 kg curd  ",
            "For theGravy:",
            "175 gm white butter ",
            "1/2 tsp black cumin seeds ",
            "1/2 kg tomato, pureed ",
            "1/2 tsp sugar ",
            "1 tsp red chilli powder ",
            "Salt to taste ",
            "100 gm fresh cream ",
            "4 green chillies, sliced",
            "1/2 tsp fenugreek leaves, crushed"
        ],
        "instructions": [
            "For marinating the chicken",
            "In a mixing bowl, mix red chilli powder, ginger garlic paste, salt and curd.  ",
            "Add the raw chicken pieces to the marinade and mix well. Keep it in the refrigerator overnight or minimum 6 hours.  ",
            "Roast the marinated chicken in a tandoor or an oven for about 10-12 minutes until it is three-fourth done.  ",
            "For the chicken gravy",
            "Heat half the quantity of white butter in pan. ",
            "Pour in the tomato puree, and saute for 2-3 minutes. Add cumin seeds, sugar, red chilli powder and salt. Mix well.  ",
            "Add the prepared chicken, white butter, fresh cream, sliced green chillies and crushed fenugreek leaves.  Saute for 3-4 minutes and let the chicken cook.",
            "Cook till chicken is done. Serve hot with rice or naan."
        ],
        "cook_time": "30 Minutes + Marination time (overnight)",
        "cuisine": "french"
    },
    {
        "name": "Milk Mendiant",
        "ingredients": [
            "500 gms milk cooking chocolate",
            "1 per piece  cashew",
            "1 per piece  almond",
            "1 per piece  prunes (small, diced)",
            "1 per piece  apricot (small, diced)",
            "1 per piece raisin"
        ],
        "instructions": [
            "Melt the milk chocolate in a microwave oven or a double boiler.",
            "Cool it down to 26 degrees and warm upto 28 degress to temper the chocolate and ensure a good crystallisation.",
            "Put the chocolate into moulds and scrape off excess chocolate.",
            "Tap the mould onto a surface to avoid air bubbles.",
            "Set cashew, almond, prunes, apricots and raisin while the chocolate is still in semi liquid state.",
            "Demould and serve."
        ],
        "cook_time": "15 Minutes ",
        "cuisine": "french"
    },
    {
        "name": "Ratatouille Nicoise",
        "ingredients": [
            "600 gms eggplant",
            "700 gms zucchinis",
            "1.5 kg tomatoes",
            "1 chopped onion",
            "1 green pepper",
            "1 red  pepper",
            "1 yellow pepper",
            "2 crushed cloves of garlic",
            "Olive oil",
            "Basil and Thyme",
            "Salt",
            "Pepper"
        ],
        "instructions": [
            "Wash eggplants, zucchinis and paprika.",
            "Cut them in dices.",
            "Wash and peel tomatoes, dice them.  Sauté eggplant in olive oil for 3 to 4 minutes and remove them.",
            "Do the same with the zucchinis, but add onions and paprika to them.  Put all the veggies back to the fryer and tomatoes, garlic, basil and thyme. Add two tablespoons of olive oil to the dish. Salt and pepper. stir.  Cook with the lid on, cook gently on heat for 10 t0 12 min,. Stir during cooking.",
            "For the last 3  minutes remove the lid, so that the remaining liquid would evaporate. ",
            "Once cooked check for seasoning and serve with rice or pasta  "
        ],
        "cook_time": "45 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Lobster Thermidor",
        "ingredients": [
            "1 whole lobster (weighing approx. 500 grams)",
            "100 gms mushrooms",
            "8 gms garlic",
            "10 gms red onion",
            "50 ml fresh cream",
            "1 egg yolk",
            "60 ml cognac",
            "10 gm thyme",
            "A pinch of nutmeg",
            "10 - 20 gms Parmesan cheese",
            "20 - 30 gms Gruyere cheese"
        ],
        "instructions": [
            "Split the lobster length-wise into two parts and clean the head thoroughly under cold running water.",
            "Scope all the meat from the lobster and clean.  Keep the shell aside for finishing in the oven.",
            "Now dice the Lobster meat. In another pan sauté the garlic and onion & later add the sliced mushrooms.",
            "After the mushroom has slightly dried out add in the lobster meat and de-glaze with 30 ml Cognac. ",
            "In another pan, add the rest of the Cognac to the fresh cream and one egg yolk, grate the nutmeg and mix well.",
            "Add this mixture to the pan containing lobster and mix well, mix in the thyme now.",
            "Get the pan off the flame and mix well till it turns thick. Fill the cleaned empty shell of the lobster with this mixture that has been prepared.",
            "Top up the lobster with Gruyère cheese and Parmesan cheese. Finish in a medium hot oven for 4 minutes. "
        ],
        "cook_time": "35 minutes",
        "cuisine": "french"
    },
    {
        "name": "Crepe Suzette",
        "ingredients": [
            "6 Tbsp flour6 eggs6 Tbsp milk3 Tbsp heavy creamUnsalted butter, as needed",
            "For the sauce:",
            "3 oranges",
            "16 Tbsp unsalted butter, softened",
            "10 Tbsp. sugar",
            "7 Tbsp Cointreau",
            "1 tsp orange juice",
            "5 Tbsp cognac",
            "For the crepes:",
            "6 Tbsp flour",
            "6 eggs",
            "6 Tbsp milk",
            "3 Tbsp heavy cream",
            "Unsalted butter, as needed",
            "3 oranges",
            "16 Tbsp unsalted butter, softened",
            "10 Tbsp sugar",
            "7 Tbsp Cointreau",
            "1 tsp orange flower water",
            "5 Tbsp cognac"
        ],
        "instructions": [
            "Whisk together flour and eggs in a medium bowl. Add milk and cream, and whisk until smooth.",
            "Pour through a fine strainer into a bowl, cover, and refrigerate for 2 hours or overnight.",
            "For the sauce:",
            "Use a vegetable peeler to remove rind from 2 of the oranges, avoiding pith; mince rind and set aside.",
            "Juice all the oranges and set juice aside.",
            "In a medium bowl, beat butter and half cup sugar on high speed of a hand mixer until light and fluffy, about 2 minutes. Add rind to butter and beat for 1 minute.",
            "Gradually drizzle in juice, 2 tbsp. of the Cointreau, kirsch, and orange flower water, beating constantly until very light and fluffy, about 2 minutes more.",
            "Heat a seasoned crepe pan or small nonstick skillet over medium-high heat until hot.",
            "Grease pan with a little butter, and then pour in 1/4 cup batter.",
            "Working quickly, swirl batter to just coat pan, and cook until edges brown, about 1 minute. Turn with a spatula and brown other side for about 30 seconds.",
            "Transfer to a plate and repeat with remaining batter, greasing pan only as needed.",
            "Add caramel sugar in a pan and add orange butter sauce in a 12 inch skillet over medium heat until bubbling.",
            "Dip both sides of one crepe in sauce, then, with best side facing down, fold in half, then in half again. Repeat process with remaining crepes, arranging and overlapping them around the perimeter of the pan. Sprinkle with remaining sugar.",
            "Remove pan from heat, pour remaining Cointreau and the cognac over crêpes, and carefully ignite with a match. Spoon sauce over crepes until flame dies out, and then serves immediately."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Spinach and Potato Soup",
        "ingredients": [
            "100 gms potatoes, peeled and chopped",
            "30 gms leeks, chopped",
            "50 gms butter",
            "20 ml olive oil",
            "300 ml full cream milk",
            "60 ml fresh cream",
            "150 gm spinach, cleaned and chopped",
            "8 cloves garlic, chopped",
            "60 gms onion, chopped",
            "1 tsp thyme, chopped",
            "A pinch of nutmeg",
            "Salt to taste",
            "White pepper powder to taste"
        ],
        "instructions": [
            "Heat the oil in a large saucepan. Add the chopped onions, thyme, garlic and saute for a few minutes.",
            "Add the chopped potatoes, toss gently and sprinkle some salt.",
            "After about 5 minutes add milk and cook on low flame for abut 20 minutes. Or till the potatoes are cooked and are soft.",
            "Now, blend the potatoes to a smooth soup consistency (add extra milk if required).",
            "Check for seasoning and finish with cream and nutmeg for flavoring.",
            "Toss spinach in soft butter and check for seasoning. Mix spinach with the finished potato soup and serve hot."
        ],
        "cook_time": "25 minutes",
        "cuisine": "french"
    },
    {
        "name": "Gousse d Ail (Mushroom on Toast)",
        "ingredients": [
            "400 gms button mushrooms, halved",
            "100 gms portobello mushroom, sliced",
            "100 gms dried porcini mushrooms, soaked and chopped",
            "40 gms dried morels, soaked and chopped",
            "8 cloves garlic, chopped",
            "50 gms onion, chopped",
            "2 Tbsp olive oil",
            "50 ml sherry",
            "Salt to taste",
            "Ground black pepper to taste",
            "5 ml truffle oil",
            "30 gms butter",
            "4 pieces of bread, sliced in half"
        ],
        "instructions": [
            "Heat the oil in a large saucepan. Add the chopped onions, garlic and saute for a few minutes.",
            "Add the mushrooms and toss gently. Cook the mushrooms until tender, for about 8 minutes.",
            "Add the sherry, parsley, salt, and pepper. Cook for another 5 minutes, or until mushrooms are soft and finish with butter and truffle oil.",
            "Check for seasoning and serve hot with toasted white bread on top."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Coq Au Vin (Chicken Braised in Wine)",
        "ingredients": [
            "For marination:",
            "1500 ml red wine, full body",
            "100 gms onion, sliced",
            "30 gms celery stalks, sliced",
            "100 gms carrot, peeled and sliced",
            "20 garlic clove, peeled and flattened",
            "1 tsp whole black peppercorns",
            "2 Tbsp olive oil",
            "4 chicken halves, with bone and skin on",
            "Cooking chicken:",
            "1 Tbsp olive oil",
            "150 gms bacon slices, thick",
            "3 Tbsp all purpose flour",
            "60 gms onion, chopped",
            "10 garlic cloves, chopped",
            "1 tsp thyme sprigs, chopped",
            "2 tsp parsley sprigs",
            "2 bay leaves, small",
            "200 ml chicken stock",
            "50 gms butter",
            "150 gms button mushrooms"
        ],
        "instructions": [
            "For marinating chicken:",
            "Combine wine, onion, celery, carrot, garlic, and peppercorns in large pot and bring to boil over high heat. Reduce heat to medium and simmer 5 minutes. Cool completely; mix in oil.",
            "Place the chicken pieces in a large bowl and pour the wine mixture over it. Cover and refrigerate for at least 12 hours and up to 24 hours, turning the chicken occasionally.",
            "For cooking chicken:",
            "Using tongs, transfer chicken pieces from marinade to paper towels to drain; pat dry.",
            "Strain the marinade and reserve the vegetables and liquid separately.",
            "Heat oil in heavy large pot over medium-high heat. Add bacon and saute until crisp and brown. Using slotted spoon, transfer bacon to small bowl. Add chicken, skin side down, to drippings in pot. Saute until brown, about 3 minutes per side.",
            "Transfer chicken to large bowl and add vegetables reserved from marinade to the pot. Saute until brown, for about 6minutes. Mix in flour and stir for about 2 minutes. Gradually whisk in reserved marinade liquid. Bring to boil, whisking frequently. Cook until sauce thickens, whisking occasionally, for about 2 minutes.",
            "Mix in the shallots, garlic, parsley, and bay leaves, stock. Add chicken and bring to simmer; reduce heat to medium-low. Cover pot and simmer chicken 20 minutes. Using tongs, turn chicken over. Cover and simmer until tender, about 10 minutes longer.",
            "Melt butter in heavy large skillet over medium heat. Add mushrooms and saute until tender, for about 8 minutes. Transfer mushrooms to plate.",
            "Melt butter in the same skillet. Add onions and saute until beginning to brown, about 3 minutes. Transfer onions to plate alongside mushrooms.",
            "Using tongs, transfer chicken to plate. Strain sauce from pot into reserved skillet, pressing on solids in strainer to extract all sauce; discard solids. Bring sauce to simmer, scraping up browned bits. Return sauce to pot.",
            "Add mushrooms and bacon. Simmer uncovered until sauce is slightly reduced, about 8 minutes. Tilt pot and spoon off excess fat from top of sauce. Season sauce with salt and pepper. Return chicken to sauce.",
            "Cook for another 2 minutes and arrange chicken on plate and sprinkle with parsley. Serve hot."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Lobster Thermidor",
        "ingredients": [
            "2 live lobsters (500gms each)",
            "150 gms unsalted butter",
            "100 gms mushrooms, trimmed and thinly sliced",
            "2 tsp Dijon mustard",
            "Salt to taste",
            "Black pepper to taste",
            "80 ml brandy",
            "250 ml heavy cream, scalded",
            "2 large egg yolks"
        ],
        "instructions": [
            "Plunge lobsters headfirst into a pot of boiling salted water. Loosely cover pot and cook lobsters over moderately high heat for 9 minutes from the time they enter water. Then transfer with tongs to sink to cool.",
            "When lobsters are cool enough to handle, twist off claws and crack them, then remove meat. ",
            "Halve lobsters lengthwise with kitchen knife, beginning from tail end, then remove tail meat, reserving shells. Cut all lobster meat into 2.5cm pieces. Discard lobster innards, then rinse and dry shells.",
            "Heat butter in a heavy saucepan over moderate heat , then cook mushrooms, stirring, until liquid that mushrooms give off is evaporated and they begin to brown, about 5 minutes. ",
            "Add lobster meat, mustard, salt, and pepper and reduce heat to low. Add 50ml brandy and half the amount of  cream and simmer 5 minutes.",
            "Whisk together yolks and remaining brandy in a small bowl. Slowly pour remaining cream into yolks, whisking constantly, and transfer to a small heavy saucepan. ",
            "Cook the mixture over very low heat, whisking constantly, until it is slightly thickened now add the same to lobster mixture, stirring gently.",
            "Arrange lobster shells, cut sides up, in a plate and spoon lobster with some of sauce into shells. Heat  under salamander until golden brown, for about 4 to 5 minutes. Serve remaining sauce on the side."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Beetroot and Avocado Tartare",
        "ingredients": [
            "Ingredients:",
            "120gm beetroot",
            "Seasonings, as per taste",
            "20ml sunflower oil ",
            "60gm avocado",
            "30gm cucumber",
            "For the marination",
            "10ml lemon juice",
            "1 Tbsp sugar",
            "10ml water ",
            "1 tsp sesame seed paste",
            "1 tsp soya sauce",
            "For the Avocado Marination with Spicy Mayo",
            "30gm egg-less Mayonnaise (ready to use)",
            "5gm chilli garlic paste ",
            "For the Garnish5 tsp roasted poppy seeds",
            "3 gm blanched edamame pods/ green peas",
            "5 gm Kimchi dressing (ready to use)"
        ],
        "instructions": [
            "Wash and peel the beetroots. Season them with salt and pepper, and rub with oil. Wrap them in silver foil and roast in the oven for about 15-20 minutes at 140 degree Celsius until they are cooked. Cool, and cut into small dices.",
            "Peel the avocado and cut into small dices.",
            "Slice cucumber into rounds and arrange on a plate in concentric circles.",
            "To make the marinade, mix together all the ingredients, and add beetroot and avocado to the it. Keep it aside for 5 minutes.",
            "Take a round mould, and neatly layer the beetroot at the base, followed by a layer of avocado. Finish with a layer of beetroot on top, sprinkling some poppy seeds between each layer.",
            "Garnish with blanched edamame / green peas, and serve with kimchi."
        ],
        "cook_time": "45 minutes",
        "cuisine": "french"
    },
    {
        "name": "Coq Au Vin",
        "ingredients": [
            "900 gm chicken leg w/o skin               ",
            "900 gm chicken breast w/o skin        ",
            "200 gm flour                                 ",
            "1/2 cup vegetable oil                 ",
            "75 gm garlic cloves caramelized         ",
            "200 gm pearl onions peeled                        ",
            "200 gm button mushrooms                 ",
            "150 gm bacon lardons               ",
            "20 gm thyme sprigs                   ",
            "2 cups red wine",
            "2 cups brown sauce / demi glace                   ",
            "80 gm butter for sauce                          ",
            "800 gm potatoes tournee            ",
            "30 gm parsley chopped               ",
            "80 gm butter for potatoes   ",
            "10 portions bread",
            "Salt and pepper - to taste"
        ],
        "instructions": [
            "Season the chicken leg and breast with salt and pepper.",
            "Dredge in flour and saute in the vegetable oil. ",
            "Remove the oil and add the bacon, mushrooms,garlic, pearl onions and thyme sprig. ",
            "De-glaze with the red wine and reduce by half. ",
            "Add the demi glace to the chicken and cook till the chicken is cooked fully through.                  Heat the butter in the pan and saute the potatoes until hot but still white.",
            "Add the parsley.",
            ""
        ],
        "cook_time": "45 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Algerienne Fish",
        "ingredients": [
            "1/2 kg fish fillet ",
            "1 lemon, juice",
            "6-8 parsley stalks ",
            "1 green capsicum - sliced and blanched ",
            "1 red capsicum - sliced ",
            "1 Tbsp butter ",
            "1 onion - chopped ",
            "1 tsp garlic paste ",
            "1/2 kg peeled, seeded tomatoes ",
            "1 Tbsp chopped parsley",
            "Salt and pepper "
        ],
        "instructions": [
            "Season the fish and squeeze lemon juice. Add parsley stalks. ",
            "Cover with foil and bake at 180 degrees for about 15 minutes. ",
            "While the fish bakes, fry onions in butter until soft. Add capsicums. ",
            "Season well and add garlic. Stir in tomatoes and paprika. ",
            "Cook well.",
            "Spoon over this mix over the fish and garnish with parsley. "
        ],
        "cook_time": "25 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Poisson Provencale",
        "ingredients": [
            "Red tuna fish ",
            "For marination:",
            "Lemon ",
            "Salt ",
            "Black pepper ",
            "Mixed herbs (rosemary, thyme, and marjoram) ",
            "For main preparation:",
            "1 Tbsp refined oil ",
            "4 Tbsp chopped onions ",
            "3 tsp roasted, peeled and de-seeded capsicum ",
            "4 tsp chopped tomatoes ",
            "1 tsp chopped garlic ",
            "1 tsp chopped parsley ",
            "1 pinch of mixed herbs ",
            "Marinated fish ",
            "25 ml white wine ",
            "1/2 cup of water ",
            "Salt to taste ",
            "pepper to taste "
        ],
        "instructions": [
            "Marinate the fish with lemon, salt, black pepper powder and herbs for 1 hour. ",
            "Heat oil in pan. ",
            "Add chopped onions and saute till translucent. ",
            "Now add the roasted, peeled and de-seeded capsicum, tomatoes, garlic, chopped parsley, herbs and the marinated fish.",
            "Add white wine, water, salt and pepper. ",
            "Cover the pan and cook the preparation for 20 minutes on low flame.",
            "Serve poisson provencale with rice."
        ],
        "cook_time": "25 Minutes + Marination time(1hr)",
        "cuisine": "french"
    },
    {
        "name": "Le Turinois (Chocolate Chestnut Cake)",
        "ingredients": [
            "1 kg chestnut ",
            "Water to cover    ",
            "350 ml milk    ",
            "1 tsp toasted fennel \nseeds    ",
            "125 gm butter    ",
            "125 gm castor sugar    ",
            "250 gm chopped bitter \nchocolate    ",
            "1/2 tsp vanilla essence    ",
            "1-2 Tbsp rum"
        ],
        "instructions": [
            "Put chestnuts in a pan. Cover with cold water and milk.   Simmer until \ntender and drain. ",
            "Peel and mash chestnuts. ",
            "Mix cream, butter and sugar with melted chocolate in 75 ml water. ",
            "Once it's cool add it to the butter \nmixture and chestnuts.   Flavor with vanilla and rum. Mix well. ",
            "Pour \ninto an oiled and lined tin. Chill overnight. Turn out and serve with \ncream."
        ],
        "cook_time": "1 Hour",
        "cuisine": "french"
    },
    {
        "name": "Hollandaise Sauce",
        "ingredients": [
            "2 Tbsp white-wine or tarragon vinegar  ",
            "Lemon juice ",
            "4 Tbsp boiling water ",
            "3 large egg yolks ",
            "1/2 cup unsalted butter ",
            "1/4 tsp cayenne ",
            "1/2 tsp salt"
        ],
        "instructions": [
            "Melt the butter and keep it warm. ",
            "Heat the vinegar or lemon juice until warm. ",
            "Meanwhile keep a small saucepan with boiling water and a measuring Tbsp ready. ",
            "Place the top of a double boiler over (not in) hot water. (This means the bottom of the top of the double boiler sound not make contact with the water heating in the bottom half of the double boiler.) ",
            "Place the egg yolks in the top of a double boiler and whisk until they begin to thicken. ",
            "Now add 1 Tbsp of the boiling water. ",
            "Continue to beat the sauce until it begins to thicken. ",
            "Repeat with the remaining water, one Tbsp at a time, beating the mixture after each addition. ",
            "Now add the warmed vinegar or lemon juice. Remove the double boiler from the heat. ",
            "Beat the sauce briskly with a wire whisk. Continue to beat the mixture as you slowly pour in the melted butter. ",
            "Add the salt and cayenne and beat the sauce until it is thick. Serve immediately."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Profiteroles",
        "ingredients": [
            "For choux pastry:",
            "125 ml water    ",
            "50 gm butter ",
            "60 gm flour    ",
            "2 large eggs ",
            "For chocolate filling:",
            "125 gm chopped chocolate ",
            "60 ml cream    ",
            "50 gm butter    ",
            "2 egg yolks    ",
            "Rum to taste      ",
            "For cream filling:",
            "Chocolate sauce 275 ml water ",
            "275 gm sugar    ",
            "1 heaped Tbsp cocoa    ",
            "75 gm chopped chocolate    ",
            "125 ml cream    ",
            "2 Tbsp butter"
        ],
        "instructions": [
            "To make the pastry:",
            "Boil water and butter together. ",
            "Put in flour; stir until mixture leaves the sides of the pan. Beat in the eggs a little at a time. ",
            "Pipe out small domes on a damp baking sheet.   ",
            "Bake at 200 degrees C for 20 minutes or until risen and golden in color. ",
            "After baking, pierce each profiterole to allow steam to escape. ",
            "Return pastry to a low oven to dry out.     ",
            "8. For the filling:",
            "Melt chocolate with the cream and butter. ",
            "Stir in yolks.  Flavor with rum. Pipe into profiteroles along with the whipped cream.     ",
            "11. For the sauce:",
            "Prepare sugar syrup with water, sugar, cocoa and cream. ",
            "Boil it for 5 minutes. Stir in chocolate and butter. Serve with dessert."
        ],
        "cook_time": "1 Hour 30 Minutes",
        "cuisine": "french"
    },
    {
        "name": "French Pea Soup",
        "ingredients": [
            "500 gm shelled peas ",
            "1 onion, finely chopped ",
            "2 1/2 cup vegetable or chicken stock ",
            "1 Tbsp olive oil ",
            "2 tsp fresh cream ",
            "Salt and pepper to taste"
        ],
        "instructions": [
            "Heat oil in a pan.  Add the onion and saute till white. ",
            "Now add the peas and saute for about 5 minutes. ",
            "Add seasoning and vegetable stock. ",
            "Give it a boil and simmer till the peas are cooked. ",
            "Puree in a grinder. Heat again and serve hot topped with fresh cream."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Crêpe Suzette",
        "ingredients": [
            "200 gm orange juice  ",
            "Lemon ",
            "1 star anise ",
            "2 eggs",
            "2 Tbsp fine sugar ",
            "3 Tbsp refined flour ",
            "100 gm milk",
            "1 Tbsp butter ",
            "Cinnamon powder"
        ],
        "instructions": [
            "Pour orange juice, lemon juice and a star anise in a pan and boil it. ",
            "Reduce the heat and let the orange juice simmer. Add the 1 Tbsp fine sugar to it.",
            "Break eggs in a bowl, add flour, 1 Tbsp sugar and milk to it. Whisk it. This is the batter.",
            "In a pan heat some butter and wait till it melts. Add the butter to the batter above.",
            "Then keep it in the refrigerator for 15-20 minutes (till the batter prepares)",
            "Put butter in a pan and pour the batter into the pan and cook it until it turns light brown. ",
            "Flip the crepe. ",
            "Fold the crepe quarterly and spread butter on top. Pour reduced orange juice over the crepe and sprinkle some cinnamon powder."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Mixed Vegetable Gratin",
        "ingredients": [
            "18-19 par-boiled baby potatoes",
            "500 gm par-boiled pumpkin",
            "1 Par boiled cauliflower",
            "2 cobs of parboiled sweet corn",
            "Salt & pepper",
            "1 tsp chilli flakes",
            "3 tsp cumin",
            "2 tsp coriander seeds",
            "2 Tbsp butter",
            "Sprigs of Thyme",
            "Béchamel sauce",
            "100 gm Cheddar cheese",
            "50 gm Processed cheese ",
            "For the Bechamel sauce:",
            "3 Tbsp butter",
            "500ml milk",
            "Sprigs of fresh thyme",
            "5 Tbsp flour",
            "Salt and pepper",
            "1/2 tsp nutmeg"
        ],
        "instructions": [
            "Pre-heat the oven at 180 degrees.",
            "Halve par boiled baby potatoes. ",
            "Heat the pan and then add 2 Tbsp of butter.",
            "Add a handful of par boiled baby potatoes and par boiled pumpkin chopped.",
            "Add 1 bowl of frozen sweet corn and par boiled cauliflower cut into florets. ",
            "Then add salt & pepper, 1/2 tsp of chili flakes, 3 tsp of cumin seeds, 2 tsp of coriander seeds and some sprigs of thyme.",
            "Cook till the vegetables are soft. After some time toss and turn off the heat.",
            "Transfer the cooked vegetables to a baking dish and pour the Bechamel sauce on top.",
            "Layer it with some grated processed and cheddar cheese.",
            "Add fresh thyme, 1/2 tsp of chili flakes and pepper on top.",
            "Put the gratin into the pre-heated oven for 10-15 minutes and serve. ",
            "For Bechamel sauce:",
            "Heat 3 Tbsp butter in a pan.",
            "Add some sprigs of fresh thyme and mix.",
            "Then add 5 Tbsp of flour.",
            "Whisk till it turns into a thick paste.",
            "Then add 500 ml milk and continue to whisk till it gets into a smooth consistency.",
            "Season it with pepper, salt and nutmeg to taste."
        ],
        "cook_time": "1 Hour",
        "cuisine": "french"
    },
    {
        "name": "Chocolate Cake in a Pressure Cooker",
        "ingredients": [
            "1 cup flour  ",
            "1/4 cup cocoa powder  ",
            "1 1/4 tsp baking powder",
            "1/4 cup butter",
            "3/4 cup caster sugar",
            "1/4 cup water  ",
            "2 eggs  ",
            "1/2 tsp vanilla essence",
            "1/8 tsp salt  ",
            "6 inch round greased baking tin"
        ],
        "instructions": [
            "In a mixing bowl, sift the flour, cocoa powder and baking powder. ",
            "Add in the butter, sugar, salt, water and vanilla, and beat the ingredients using a whisk.     ",
            "Add the eggs and beat the batter until smooth. ",
            "Transfer into the baking tin.    ",
            "Heat the pressure cooker, covered with the lid but without the pressure, for 3-4 minutes on high heat, then place the cake tin in the empty cooker (do not add water in the cooker).     ",
            "Close the lid (without the pressure), lower the flame and let it cook until done (about 30 minutes)."
        ],
        "cook_time": "1 Hour",
        "cuisine": "french"
    },
    {
        "name": "Honey Chilli Potatoes",
        "ingredients": [
            "For the potatoes:",
            "2 potatoes, peeled and sliced",
            "3-4 Tbsp cornflour or maida",
            "Salt to taste",
            "1 tsp red chilli powder",
            "Oil, for deep frying",
            "For the base:",
            "1 tsp oil",
            "2 spring onions (with stalk), sliced",
            "1 Tbsp garlic paste",
            "1 capsicum, sliced",
            "2 Tbsp honey",
            "Salt, to taste",
            "1/4 tsp soya sauce",
            "3 tsp white sesame seeds",
            "2 tsp chilli sauce"
        ],
        "instructions": [
            "For the potatoes:",
            "In a bowl, add cornflour or maida, salt and red chilli powder.",
            "Add the sliced potatoes and mix well until the potatoes are coated.",
            "Heat oil in a wok and deep fry the potatoes until golden. Keep aside.",
            "For the Base:",
            "In a wok, add oil, garlic paste and spring onions. Saute on high heat for 1 minute.",
            "Add capsicum, honey, salt, soya sauce, chilli sauce. Saute for 2-3 minutes.",
            "Add the deep-fried potatoes and sesame seeds. Mix well and serve hot."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Vegetable Momos",
        "ingredients": [
            "For Dough:",
            "2 cups maida",
            "1/2 tsp salt ",
            "1/2 tsp baking powder   ",
            "For Filling: ",
            "1 cup carrots - grated ",
            "1 cup cabbage - grated ",
            "1 Tbsp oil ",
            "1/2 cup onion - finely chopped ",
            "1 tsp garlic - chopped  ",
            "1 tsp Soya sauce ",
            "Salt ",
            "1/4 tsp vinegar ",
            "1/4 tsp black pepper"
        ],
        "instructions": [
            "Mix the maida, salt and baking powder and knead to a stiff dough with water. ",
            "Heat oil and add the onion and garlic. ",
            "Saute over high heat and add the carrot and cabbage. Turn around over high heat till glossy. ",
            "Take it off the heat and mix in the Soya sauce, salt, vinegar and black pepper. ",
            "Roll the dough thin (translucent) and cut into 4\"-5\" rounds. ",
            "Take a round, wet edges and place some filling in the center. ",
            "Bring edges together to cover the filling. Twist to seal and fill the rest in the same way. ",
            "Steam for about 10 minutes and serve with soya sauce and chilli sauce."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Chole Bhature",
        "ingredients": [
            "For chole:",
            "2 cup chickpeas (channas)",
            "2 tsp oil",
            "1 bay leaf (tej patta)",
            "1 stick cinnamon (dalchini)",
            "3-4 cloves (laung)",
            "1 tsp whole pepper corns (sabut kali mirch)",
            "3 green cardamom  (choti elaichi)",
            "2 black cardamom (badi elaichi)",
            "1 tsp turmeric powder (haldi)",
            "1 tsp chili powder (lal mirch powder)",
            "1 tsp coriander powder (dhaniya powder)",
            "1 tsp cumin powder (zeera powder)",
            "1 tsp cumin seeds (zeera)",
            "1/2 tsp asafoetida (heeng)",
            "Salt to taste",
            "1 cup onions (chopped)",
            "1 cup tomatoes (chopped)",
            "1 tsp ginger (chopped)",
            "1 tsp garlic (chopped)",
            "1 tsp ajwain",
            "1 tsp lime juice",
            "1 green chili (chopped)                      1 tea bag                                                1 Tbsp butter",
            "For the bhaturas:",
            "2 cups maida (refined flour)",
            "1/2 tsp yeast, dissolved for 10 minutes in luke warm water",
            "1/2 cup whole wheat flour",
            "A pinch of salt",
            "Water to knead",
            "Oil for frying"
        ],
        "instructions": [
            "For chole:",
            "In a pan add oil, bay leaf, cinnamon, cumin seeds, cloves, whole pepper corns, green and black cardamom.",
            "After it gets brown add chopped onions and saute it.",
            "After sauteing add chopped ginger and garlic.",
            "Then add turmeric, chili powder, coriander powder, cumin powder, asafoetida, salt and fry well.",
            "For de glazing the pan add little water.",
            "Now add the chole (soaked overnight and pressure cooked) to the masala.",
            "After stirring well add tomatoes, little sugar and salt to the chole (chickpeas)",
            "Now add ajwain, chopped green chilies and water for the base.",
            "To get the color in the chole, add a tea bag to the masala.",
            "Simmer the chole gently for an hour and cover it.",
            "Add lime juice and a dollop of butter to it.",
            "Garnish the chole with coriander and butter.",
            "Serve the chole hot with bhaturas.",
            "For the bhaturas:",
            "Knead the whole wheat flour, maida and salt together with adequate amount of water.",
            "Sprinkle the yeast on top. Leave it for 2-3 hours for the yeast to work.",
            "Divide it into equal portions. Roll out in an oval or round shape.",
            "Deep fry till golden brown, like a puri.",
            "Serve. "
        ],
        "cook_time": "1 Hour",
        "cuisine": "french"
    },
    {
        "name": "Quick Chicken Curry",
        "ingredients": [
            "1 kg chicken",
            "3 large onions, paste",
            "2 large tomatoes, pureed",
            "1 Tbsp garlic paste",
            "1 Tbsp ginger paste",
            "2 tsp coriander powder",
            "2 tsp cumin powder",
            "1/2 tsp turmeric powder",
            "1/2 tsp red chilli powder",
            "1 tsp garam masala powder",
            "2 Tbsp oil",
            "Salt to taste",
            "Chopped coriander for garnish"
        ],
        "instructions": [
            "Heat oil in a pan and sauté the onion paste, garlic & ginger paste till golden brown.",
            "Add tomato puree. When the tomato puree dries up, add coriander powder, cumin powder, garam masala, red chilli powder, turmeric powder and salt. Let the spices cook.",
            "Add chicken pieces into the masala. Stir well and cook till they are golden brown.",
            "Add 1/2 cup of water and stir. Cover with a lid and let it simmer till the chicken is cooked.",
            "Garnish with chopped coriander and serve."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Butter Chicken",
        "ingredients": [
            "700 gm raw chicken  ",
            "For theMarinade:",
            "1 tsp red chilli powder ",
            "1 tsp ginger and garlic paste ",
            "Salt to taste ",
            "1/2 kg curd  ",
            "For theGravy:",
            "175 gm white butter ",
            "1/2 tsp black cumin seeds ",
            "1/2 kg tomato, pureed ",
            "1/2 tsp sugar ",
            "1 tsp red chilli powder ",
            "Salt to taste ",
            "100 gm fresh cream ",
            "4 green chillies, sliced",
            "1/2 tsp fenugreek leaves, crushed"
        ],
        "instructions": [
            "For marinating the chicken",
            "In a mixing bowl, mix red chilli powder, ginger garlic paste, salt and curd.  ",
            "Add the raw chicken pieces to the marinade and mix well. Keep it in the refrigerator overnight or minimum 6 hours.  ",
            "Roast the marinated chicken in a tandoor or an oven for about 10-12 minutes until it is three-fourth done.  ",
            "For the chicken gravy",
            "Heat half the quantity of white butter in pan. ",
            "Pour in the tomato puree, and saute for 2-3 minutes. Add cumin seeds, sugar, red chilli powder and salt. Mix well.  ",
            "Add the prepared chicken, white butter, fresh cream, sliced green chillies and crushed fenugreek leaves.  Saute for 3-4 minutes and let the chicken cook.",
            "Cook till chicken is done. Serve hot with rice or naan."
        ],
        "cook_time": "30 Minutes + Marination time (overnight)",
        "cuisine": "french"
    },
    {
        "name": "Pommes Gratin",
        "ingredients": [
            "2 tsp + 2 tsp butter",
            "1 cup cream",
            "1 tsp thyme",
            "2 cloves garlic, bashed",
            "Salt, to taste",
            "Pepper, to taste",
            "Nutmeg powder, a pinch",
            "3 potatoes, peeled and sliced thinly",
            "5 Tbsp grated cheese (Cheddar or Gruyere)"
        ],
        "instructions": [
            "In a pan add 2 tsp butter with 1 cup cream.",
            "Add thyme, garlic, salt, pepper and nutmeg. Let the cream reduce a little.",
            "Add the sliced potatoes and 3 Tbsp cheese. Let the cream reduce further. (Reduce till thick and coats the potatoes completely)",
            "Transfer the creamy potatoes in a greased baking dish/ ramekin. Top with the rest of the cheese and butter.",
            "Bake till the cheese melts and is golden brown.",
            "Serve. ",
            ""
        ],
        "cook_time": "25 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Chocolate Oat Fondant",
        "ingredients": [
            "For the fondant:",
            "Melted butter for brushing the ramekins",
            "Cocoa powder for dusting",
            "200 gms good-quality dark chocolate, chopped into small pieces (70 %)",
            "150 gms butter, cut in small bits",
            "3/4 cup demerara sugar (ground)",
            "4 whole eggs",
            "4 yolks ",
            "3/4 cup flour",
            "3/4 cup oats (ground)",
            "1 tsp baking soda",
            "1 Tbsp of cocoa",
            "1/2 cup milk to loosen batter (optional)",
            "For the strawberry compote:",
            "1 cup freshly cut strawberries",
            "1 tsp lemon juice",
            "1 Tbsp brown sugar",
            "1/2 tsp balsamic vinegar"
        ],
        "instructions": [
            "For the fondant:",
            "Brush butter on the insides of your ramekins, and dust with cocoa powder. Put them in the freezer to set.",
            "Take a pan of simmering water, and place another bowl that fits snugly over it, without touching the water. Slowly melt the chocolate and butter together. Remove the bowl from the heat and allow it to cool for 5 minutes. ",
            "In a separate bowl whisk the eggs and yolks together with the sugar until the whisk leaves a trail. Now add the flour, oats and baking soda into the eggs and beat it well. ",
            "Pour the melted chocolate into this batter bit by bit, beating well in between each addition. Add a little milk to loosen the batter.",
            "Take the ramekins out of the fridge and pour this batter in equal quantities into the ramekins. ",
            "Put these back in the freezer, and take them out just before you're ready to bake them.",
            "Bake in a preheated oven at 190 degrees till the fondant rises and flowers out of the ramekin.",
            "For the strawberry compote:",
            "In a pan add butter, strawberries and sugar.",
            "Add the lemon juice and vinegar.",
            "Let the strawberries leave a little juice.",
            "Your compote is ready."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Hot Cointreau Souffle",
        "ingredients": [
            "4 eggs, separated",
            "1/2 cup granulated sugar",
            "1 tsp vanilla essence",
            "1/2 cup Cointreau",
            "Pinch of salt",
            "Butter, to coat the souffle dish"
        ],
        "instructions": [
            "Pre-heat the oven.",
            "Butter the souffle dish.",
            "Begin by beating 1/4 cup sugar with the yolks till light and fluffy. It should leave a trail. Add the vanilla essence and Cointreau and keep aside.",
            "Then whisk the egg whites with a pinch of salt till soft peaks form. Gradually add the remaining sugar. (Like you would for a meringue).",
            "Fold in the whites to the yolk mixture, lightly and quickly.",
            "Place in a hot oven till well risen.",
            "Eat immediately!"
        ],
        "cook_time": "40 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Croque Madame",
        "ingredients": [
            "3 pieces white bread",
            "2 slices ham",
            "Mustard sauce",
            "2 Tbsp Gruyere cheese, grated",
            "2 tsp butter (To pan fry sandwich) + 1/2 tsp butter (To cook egg)",
            "1 egg"
        ],
        "instructions": [
            "Spread mustard sauce on one side of all breads slices.",
            "Place ham on 2 slices. Sprinkle some cheese over these.",
            "Place the ham-cheese bread slices over one another, cover with the third slice.",
            "Pan fry the sandwich with some butter.",
            "In another pan add butter. Break an egg. Fry the egg.",
            "Place the 'sunny side up' egg on the ham and cheese sandwich.",
            "Serve."
        ],
        "cook_time": "15 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Croque Monsieur",
        "ingredients": [
            "3 pieces white bread",
            "2 slices ham",
            "Mustard sauce",
            "2 Tbsp Gruyere cheese, grated",
            "2 tsp butter"
        ],
        "instructions": [
            "Spread mustard sauce on one side of all breads slices.",
            "Place ham on 2 slices. Sprinkle some cheese over these.",
            "Place the ham-cheese bread slices over one another, cover with the third slice.",
            "Pan fry the sandwich with some butter.",
            "Serve."
        ],
        "cook_time": "10 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Potato and Leek Soup",
        "ingredients": [
            "1 Tbsp butter",
            "1 white onion, sliced",
            "2 leeks (Only white part to be used)",
            "2-3 small sized potatoes, peeled and chopped",
            "Salt, to taste",
            "1 liter vegetable stock",
            "Pepper, to taste",
            "1 cup milk",
            "2 Tbsp cream",
            "Chives, chopped, to garnish",
            "Parsley, chopped, to garnish"
        ],
        "instructions": [
            "In a pan saute leeks and onions in butter till pink.",
            "Add the potatoes and saute. Saute for 2-3 minutes.",
            "Add the vegetable stock, salt, pepper and let it simmer for 5-6 minutes.",
            "Add the milk and let it cook for a few more minutes.",
            "Blenderize the soup. Add the cream.",
            "Pour in soup bowls.",
            "Garnish with chopped chives and parsley.",
            "Serve this soup cold or hot."
        ],
        "cook_time": "45 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Chocolate and Banana Crepes",
        "ingredients": [
            "1 cup maida(all purpose flour)",
            "2 eggs",
            "1/2 cup milk",
            "1 Tbsp butter",
            "1/4 cup water",
            "Butter to coat the pan",
            "For the topping you can use:",
            "Chocolate/ Nutella",
            "1 banana, round slices",
            "Oranges, peeled and chopped",
            "A pinch of cinnamon"
        ],
        "instructions": [
            "Mix eggs, milk and butter together.",
            "Add the flour little by little depending on the consistency of the batter.",
            "Add a little water to make it runny.",
            "Always remember the batter for crepes has to be absolutely free flowing, it should not be thick because you want the crepe to be thin. ",
            "Heat some butter in a pan and pour the batter.",
            "Let it cook slightly then add the toppings, chocolate/nutella and bananas in one, another could have some chopped oranges and a pinch of cinnamon.",
            "You could also use some lime juice and incing sugar a s a topping. ",
            "Top it with whatever you like."
        ],
        "cook_time": "20 Minutes",
        "cuisine": "french"
    },
    {
        "name": "French Onion Soup with  Mozzarella Cheese",
        "ingredients": [
            "3-4 Tbsp olive oil",
            "6 onions, finely sliced",
            "1 tsp sugar",
            "A dash of balsamic vinegar",
            "4 cups chicken stock",
            "3 cloves garlic, chopped",
            "Salt, to taste",
            "Pepper, to taste",
            "1 cup dry white wine",
            "3-4 Tbsp mozerella cheese, grated",
            "1 Tbsp taleggio cheese",
            "Roundels of French loaf, to top the soup bowl"
        ],
        "instructions": [
            "In a pan add olive oil and onions. Once pink add sugar and balsamic vinegar. Cook the onions till dark brown.",
            "Add chicken stock, garlic, salt and pepper. Simmer for a few minutes.",
            "Add dry white wine and simmer for 10 minutes.",
            "Pour in individual soup bowls (oven proof).",
            "Cover the surface with French loaf roundels. Sprinkle mozzarella cheese generously. Top with some taleggio cheese.",
            "Bake at 200 degrees C for 10 minutes or till the cheese melts",
            "Serve hot."
        ],
        "cook_time": "1 Hour",
        "cuisine": "french"
    },
    {
        "name": "Duck a Lorange",
        "ingredients": [
            "For the stock / sauce:",
            "5 Tbsp olive oil",
            "7-8 duck bones",
            "1 cup chopped onions",
            "1 cup chopped carrots",
            "Water",
            "1 tsp fresh parsley",
            "1/4 tsp oregano",
            "1/4 tsp thyme",
            "For the potato balls:",
            "2 potatoes, boiled and mashed",
            "2 eggs, beaten",
            "Oil to cook onions and bacon",
            "1 cup chopped onions",
            "1/2 cup chopped bacon",
            "Salt to taste",
            "Oil for frying",
            "For the duck:",
            "A 300 gm duck breast",
            "Salt",
            "Oil",
            "15 ml dry white wine",
            "For garnishing:",
            "Kafir Lime leaves, rolled and julienne",
            "1 tsp orange zest"
        ],
        "instructions": [
            "For the stock/ sauce:",
            "In a pan add 3 tbsp oil and brown the duck bones in it. Let them sizzle.",
            "In another pan add 2 Tbsp olive oil, 1 cup chopped carrots, onions. Saute them till brown.",
            "Add this to the pan with duck bones. Add water to it to make stock.",
            "To this add fresh parsley, oregano and thyme.",
            "Let it boil.",
            "Once concentrated, strain and keep the concentrate aside.",
            "For the potato balls:",
            "In another pan add oil, chopped onions, chopped bacon and saute. Drain excess oil.",
            "Add this to mashed potatoes and make small round balls from it.",
            "Dip it in beaten egg, roll it in Japanese bread crumbs.",
            "Deep fry them till light brown. Drain on absorbent paper.",
            "For the duck breast:",
            "Sprinkle and rub some salt on the duck breast.",
            "In a pan add some oil and cook the duck breast till light brown on one side.",
            "Flip the meat and add dry white wine to it.",
            "Let it cook.",
            "Take it out on an absorbent paper and let it rest for a few minutes.",
            "Cut into thick slices.",
            "Plating up:",
            "In a plate place the sliced duck breast. Alongside place the fried potato balls.",
            "Pour over the sauce, sprinkle the orange zest and the kafir lime.",
            "Serve."
        ],
        "cook_time": "1 Hour",
        "cuisine": "french"
    },
    {
        "name": "French Onion Soup",
        "ingredients": [
            "4 Tbsp light olive oil",
            "3 onions, thinly sliced",
            "1/2 level Tbsp flour",
            "2 1/2 liters homemade stock",
            "4 Tbsp good brandy",
            "1 tsp sugar"
        ],
        "instructions": [
            "Set a heavy bottom saucepan over medium heat and add the oil.",
            "When the oil is hot, add the onions. Cover the pan and cook the onion slowly until they are tender and translucent. This will take about ten minutes.",
            "Remove the lid, raise the hit to medium high, and stir in the sugar.",
            "Continue to cook the onion, stirring frequently, until they take on a dark walnut brown color. This will take about 20 to 25 minutes.",
            "Sprinkle in the flour and continue ton cook the onions while stirring for an additional 2 minutes.",
            "Remove the onion from the heat and set them aside to cool a little.",
            "While the onions are cooling, heat the stock to a slow simmer.",
            "Stir about 3 cups of hot stock into the onion along with the brandy.",
            "Return this mixer to the stove over medium high heat and bring it to a simmer.",
            "Cook this mixture gently stirring for about 3 minutes.",
            "Add the remaining stock, loosely over high heat and bring it to a simmer the soup for about one and a half hours.",
            "Adjust seasoning with salt and freshly ground black pepper before serving.",
            "Serve the soup with a large mixed green salad and crusty bread."
        ],
        "cook_time": "1 Hour 30 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Boozy Pears in Spiced Red Wine",
        "ingredients": [
            "1 Vanilla pod",
            "1 bottle of good red wine",
            "100 grams sugar",
            "A small cinnamon stick",
            "3 pears, peeled and base removed",
            "100 grams butter",
            "Zest of 1 lemon"
        ],
        "instructions": [
            "To make the spiced wine mixture, add the vanilla seeds and pod, sugar, cinnamon stick, lemon zest, lemon juice and wine into heat proof pan over medium heat.",
            "Constantly stir so that the sugar does not stick to the pan.",
            "Bring the syrup to boil and turn to a gentle simmer.",
            "Add in your pears. Make sure that the pears snugly fit into the pan. Leave them on for 10-12 minutes. ",
            "Remove the wine coated pears from the pan and foil them to keep the heat intact.",
            "Put the wine mixture on medium-low heat and reduce the juices in the pan to half. Turn off the heat and mix in the butter.",
            "Pour the spiced wine mixture over the pears and serve with cream or ice cream."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Bacon and Tomato Casserole",
        "ingredients": [
            "200 gm macaroni ",
            "1 clove garlic- chopped ",
            "30 gm butter ",
            "6 rashers bacon ",
            "8 large tomatoes-ripe ",
            "1 tsp corn flour ",
            "Salt and pepper ",
            "1 medium onion ",
            "Pinch of sugar ",
            "50 gm grated cheese ",
            "1 bouquet garni- mixed herbs"
        ],
        "instructions": [
            "Cook the macaroni.  Keep aside.",
            "Cut the tomatoes and crush them with a wooden spoon in a thick saucepan. ",
            "Add the finely sliced onion, garlic and the bouquet garni.   ",
            "Simmer gently for a few minutes until it turns soft. ",
            "Sieve this puree.  ",
            "Mix the corn flour with the melted butter and add to the puree; return to the saucepan and simmer for 15 minutes. ",
            "Season with salt, pepper and a pinch of sugar.   ",
            "Now fry the diced bacon until just crisp. ",
            "Mix together the sauce, fried bacon and cooked macaroni and place in a casserole. ",
            "Sprinkle grated cheese on top and heat through in the oven for 5-10 minutes."
        ],
        "cook_time": "35 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Croissants",
        "ingredients": [
            "Oven temp: 190 C- 375 F",
            "4 cups flour (maida) ",
            "1 tsp salt ",
            "1 Tbsp sugar ",
            "2 tsp yeast - powdered ",
            "1 cup milk - luke warm ",
            "1 egg-slightly beaten ",
            "1 cup butter-beaten to a soft consistency (like the dough)"
        ],
        "instructions": [
            "Mix sugar into the milk and sprinkle yeast over it. ",
            "Leave in a draught free place to froth.   (Till it doubles, for about 20 minutes)",
            "Mix flour and salt. ",
            "Add the milk and egg and knead to a smooth dough.   ",
            "Roll out the dough into 1 inch thickness. ",
            "Spread small pieces of butter on 2/3 of dough.   ",
            "Fold together into three layers like folding a napkin, first the part without butter. ",
            "Roll out and fold again. ",
            "Repeat three or four times. ",
            "Leave in a cold place for 1/2 hour between each rolling.  ",
            "Roll and cut into square pieces, spread filling of your choice and roll from one corner, diagonally towards the opposite corner. "
        ],
        "cook_time": "3-4 Hours",
        "cuisine": "french"
    },
    {
        "name": "Creole Crevette (Prawns in Coconut Milk)",
        "ingredients": [
            "200 gm prawns",
            "4 Tbsp coconut oil",
            "4 Tbsp onions, chopped",
            "1 tsp garlic",
            "1 tsp green chillies, chopped",
            "2 tomatoes, chopped",
            "1 tsp turmeric powder",
            "Salt to taste",
            "A few curry leaves",
            "2 Tbsp yogurt",
            "1/2 cup coconut milk "
        ],
        "instructions": [
            "Marinate prawns with salt and turmeric powder. ",
            "Now lightly fry the prawns in a pan and keep them aside.   ",
            "Heat coconut oil in pan. ",
            "Add chopped onions, garlic, green chillies, tomatoes, and turmeric powder, salt, curry leaves and yoghurt. Mix it well. ",
            "Add the fried prawns and the coconut milk.   Bring the preparation to a boil and garnish with coriander leaves and serve with rice."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Low fat French Onion Soup",
        "ingredients": [
            "4 onions, sliced",
            "1/2 tsp butter",
            "A little olive oil or canola spray",
            "3 tablespoons white wine",
            "A sprig or two of fresh or dry thyme",
            "4 large cups chicken stock (i made this with the stock cube)",
            "Salt and pepper",
            "A piece of wholewheat toast baked in oven with grated gouda cheese till it browns slightly.",
            "1 tsp finely chopped garlic/ 1 tsp garlic paste"
        ],
        "instructions": [
            "Take a heavy bottomed pan.",
            "Add butter and olive oil or spray.",
            "When warm, add onions and garlic.",
            "Now the idea is to keep cooking these onions on a slow flame.they should caramelize in about 20 minutes.",
            "After adding these onions,cook on low for 10 minutes. Now add wine.",
            "Once the onions are nicely caramelized, add the stock add let it come to a boil.",
            "Taste and season with salt and pepper.",
            "Put wholewheat bread in toaster and toast.now add grated cheese and let it melt till slightly brown in oven.",
            "Add soup to soup bowl with a good amount of onions. Top with toast and serve."
        ],
        "cook_time": "45 minutes",
        "cuisine": "french"
    },
    {
        "name": "Lentil Salad",
        "ingredients": [
            "150 g lentils",
            "1 garlic clove, peeled",
            "1 red onion, peeled",
            "1/2 apple, granny smith, cut into 1-2mm cubes",
            "2 celery stalks, cut into 1-2mm cubes",
            "A few cherry tomatoes halved and slightly crushed",
            "Dressing:",
            "3 Tbsp olive oil",
            "1 lemon, juice",
            "Salt and pepper"
        ],
        "instructions": [
            "Put the lentils in a saucepan and cover with 450 ml water. Add the garlic clove and 1/2 of the onion.",
            "Bring to boil and cover with a lid. Let simmer for 20-25 min until the lentils are cooked but still have a slight bite to them. You do not want to end up with a lentil mush.",
            "Prepare the celery and apple now. Finely chop the other half of the onion too. Once you have chopped the apple, put it in a bowl with water and lemon juice, otherwise the apple will start turning brown.",
            "Drain the lentils and cool down under cold, running water.",
            "Put them in a bowl, add the apples, tomatoes, onion, celery and chopped mint. Drizzle with olive oil and lemon juice to taste. Season with salt and pepper."
        ],
        "cook_time": "30 minutes",
        "cuisine": "french"
    },
    {
        "name": "Broccoli and Cheddar Crepes",
        "ingredients": [
            "1 head broccoli blanched and chopped",
            "For the crepes:",
            "1 ½ cup flour",
            "1 pinch salt",
            "1 pinch zataar spice",
            "½ cap olive oil",
            "1 tsp white wine vinegar ",
            "1 pinch soda bicarbonate",
            "Few leaves chopped parsley",
            "10 ml milk ",
            "Pinch of cracked black pepper",
            "2 stalks spring onions ",
            "½ roasted red bell pepper",
            "150 gms corn kernels",
            "2 garlic cloves",
            "1 tsp white wine",
            "120 ml cream",
            "80 gms cheddar cheese grated",
            "Few sprigs oregano",
            "2 tbsp olive oil"
        ],
        "instructions": [
            "Blanch the broccoli.For the crepe batter:",
            "In a bowl add flour, zataar spice, salt, olive oil, milk, red wine vinegar and soda bicarbonate; give it a nice whisk.",
            "Chop the broccoli, spring onions and a big clove of garlic.",
            "Sauté the spring onions in olive oil along with the garlic, roasted red bell pepper and corn. ",
            "Add the broccoli and deglaze with white wine.",
            "Add salt to season.",
            "Add ½ a cup of cream and reduce. ",
            "Add the grated cheese, few leaves of oregano and season to taste with salt and pepper.",
            "Reduce the cream along with the rest of cheese to make a thick sauce of a coating consistency. ",
            "Cool down the mixture. ",
            "For the crepes:",
            "Put a spoon full of the batter on a non stick pan to make thin crepes.",
            "Grease a baking dish and lay the crepes in one layer.",
            "Spoon the sauce over the crepes and layer with another crepe, do this for a few layers.",
            "Sprinkle grated cheese, bread crumbs and a little melted butter on the top and bake for 20 minutes at 180 degree C."
        ],
        "cook_time": "1 hour 30 mins",
        "cuisine": "french"
    },
    {
        "name": "Gratin of Potatoes with Garlic Cream",
        "ingredients": [
            "3-4 potatoes",
            "1/2 tsp salt",
            "Pepper to taste",
            "Pinch of nutmeg",
            "1 clove garlic",
            "2 sprigs thyme",
            "1 sprig rosemary ",
            "20 ml cream",
            "10 gm gruyere cheese",
            "15 gm cheddar cheese",
            "10 gm parmesan cheese",
            "10 gm butter"
        ],
        "instructions": [
            "Wash and peel the potatoes and cut into thin slices. ",
            "Keep them covered with water.",
            "Reduce the cream along with the garlic, a pinch of rosemary and thyme to about half.",
            "Grate the cheeses and set aside.",
            "Drain the potatoes and season with salt, pepper and nutmeg.",
            "In a well greased baking dish, layer the potatoes neatly.",
            "Sprinkle the cheeses and some of the reduced cream. ",
            "Top with another layer of potatoes followed by the cheeses and cream until it is almost full. ",
            "Dot with butter and bake for 25 minutes at 180°C or until the potatoes are cooked and the surface is a beautiful golden brown."
        ],
        "cook_time": "1 Hour",
        "cuisine": "french"
    },
    {
        "name": "Chocolate Cake in a Pressure Cooker",
        "ingredients": [
            "1 cup flour  ",
            "1/4 cup cocoa powder  ",
            "1 1/4 tsp baking powder",
            "1/4 cup butter",
            "3/4 cup caster sugar",
            "1/4 cup water  ",
            "2 eggs  ",
            "1/2 tsp vanilla essence",
            "1/8 tsp salt  ",
            "6 inch round greased baking tin"
        ],
        "instructions": [
            "In a mixing bowl, sift the flour, cocoa powder and baking powder. ",
            "Add in the butter, sugar, salt, water and vanilla, and beat the ingredients using a whisk.     ",
            "Add the eggs and beat the batter until smooth. ",
            "Transfer into the baking tin.    ",
            "Heat the pressure cooker, covered with the lid but without the pressure, for 3-4 minutes on high heat, then place the cake tin in the empty cooker (do not add water in the cooker).     ",
            "Close the lid (without the pressure), lower the flame and let it cook until done (about 30 minutes)."
        ],
        "cook_time": "1 Hour",
        "cuisine": "french"
    },
    {
        "name": "Honey Chilli Potatoes",
        "ingredients": [
            "For the potatoes:",
            "2 potatoes, peeled and sliced",
            "3-4 Tbsp cornflour or maida",
            "Salt to taste",
            "1 tsp red chilli powder",
            "Oil, for deep frying",
            "For the base:",
            "1 tsp oil",
            "2 spring onions (with stalk), sliced",
            "1 Tbsp garlic paste",
            "1 capsicum, sliced",
            "2 Tbsp honey",
            "Salt, to taste",
            "1/4 tsp soya sauce",
            "3 tsp white sesame seeds",
            "2 tsp chilli sauce"
        ],
        "instructions": [
            "For the potatoes:",
            "In a bowl, add cornflour or maida, salt and red chilli powder.",
            "Add the sliced potatoes and mix well until the potatoes are coated.",
            "Heat oil in a wok and deep fry the potatoes until golden. Keep aside.",
            "For the Base:",
            "In a wok, add oil, garlic paste and spring onions. Saute on high heat for 1 minute.",
            "Add capsicum, honey, salt, soya sauce, chilli sauce. Saute for 2-3 minutes.",
            "Add the deep-fried potatoes and sesame seeds. Mix well and serve hot."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Vegetable Momos",
        "ingredients": [
            "For Dough:",
            "2 cups maida",
            "1/2 tsp salt ",
            "1/2 tsp baking powder   ",
            "For Filling: ",
            "1 cup carrots - grated ",
            "1 cup cabbage - grated ",
            "1 Tbsp oil ",
            "1/2 cup onion - finely chopped ",
            "1 tsp garlic - chopped  ",
            "1 tsp Soya sauce ",
            "Salt ",
            "1/4 tsp vinegar ",
            "1/4 tsp black pepper"
        ],
        "instructions": [
            "Mix the maida, salt and baking powder and knead to a stiff dough with water. ",
            "Heat oil and add the onion and garlic. ",
            "Saute over high heat and add the carrot and cabbage. Turn around over high heat till glossy. ",
            "Take it off the heat and mix in the Soya sauce, salt, vinegar and black pepper. ",
            "Roll the dough thin (translucent) and cut into 4\"-5\" rounds. ",
            "Take a round, wet edges and place some filling in the center. ",
            "Bring edges together to cover the filling. Twist to seal and fill the rest in the same way. ",
            "Steam for about 10 minutes and serve with soya sauce and chilli sauce."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Chole Bhature",
        "ingredients": [
            "For chole:",
            "2 cup chickpeas (channas)",
            "2 tsp oil",
            "1 bay leaf (tej patta)",
            "1 stick cinnamon (dalchini)",
            "3-4 cloves (laung)",
            "1 tsp whole pepper corns (sabut kali mirch)",
            "3 green cardamom  (choti elaichi)",
            "2 black cardamom (badi elaichi)",
            "1 tsp turmeric powder (haldi)",
            "1 tsp chili powder (lal mirch powder)",
            "1 tsp coriander powder (dhaniya powder)",
            "1 tsp cumin powder (zeera powder)",
            "1 tsp cumin seeds (zeera)",
            "1/2 tsp asafoetida (heeng)",
            "Salt to taste",
            "1 cup onions (chopped)",
            "1 cup tomatoes (chopped)",
            "1 tsp ginger (chopped)",
            "1 tsp garlic (chopped)",
            "1 tsp ajwain",
            "1 tsp lime juice",
            "1 green chili (chopped)                      1 tea bag                                                1 Tbsp butter",
            "For the bhaturas:",
            "2 cups maida (refined flour)",
            "1/2 tsp yeast, dissolved for 10 minutes in luke warm water",
            "1/2 cup whole wheat flour",
            "A pinch of salt",
            "Water to knead",
            "Oil for frying"
        ],
        "instructions": [
            "For chole:",
            "In a pan add oil, bay leaf, cinnamon, cumin seeds, cloves, whole pepper corns, green and black cardamom.",
            "After it gets brown add chopped onions and saute it.",
            "After sauteing add chopped ginger and garlic.",
            "Then add turmeric, chili powder, coriander powder, cumin powder, asafoetida, salt and fry well.",
            "For de glazing the pan add little water.",
            "Now add the chole (soaked overnight and pressure cooked) to the masala.",
            "After stirring well add tomatoes, little sugar and salt to the chole (chickpeas)",
            "Now add ajwain, chopped green chilies and water for the base.",
            "To get the color in the chole, add a tea bag to the masala.",
            "Simmer the chole gently for an hour and cover it.",
            "Add lime juice and a dollop of butter to it.",
            "Garnish the chole with coriander and butter.",
            "Serve the chole hot with bhaturas.",
            "For the bhaturas:",
            "Knead the whole wheat flour, maida and salt together with adequate amount of water.",
            "Sprinkle the yeast on top. Leave it for 2-3 hours for the yeast to work.",
            "Divide it into equal portions. Roll out in an oval or round shape.",
            "Deep fry till golden brown, like a puri.",
            "Serve. "
        ],
        "cook_time": "1 Hour",
        "cuisine": "french"
    },
    {
        "name": "Quick Chicken Curry",
        "ingredients": [
            "1 kg chicken",
            "3 large onions, paste",
            "2 large tomatoes, pureed",
            "1 Tbsp garlic paste",
            "1 Tbsp ginger paste",
            "2 tsp coriander powder",
            "2 tsp cumin powder",
            "1/2 tsp turmeric powder",
            "1/2 tsp red chilli powder",
            "1 tsp garam masala powder",
            "2 Tbsp oil",
            "Salt to taste",
            "Chopped coriander for garnish"
        ],
        "instructions": [
            "Heat oil in a pan and sauté the onion paste, garlic & ginger paste till golden brown.",
            "Add tomato puree. When the tomato puree dries up, add coriander powder, cumin powder, garam masala, red chilli powder, turmeric powder and salt. Let the spices cook.",
            "Add chicken pieces into the masala. Stir well and cook till they are golden brown.",
            "Add 1/2 cup of water and stir. Cover with a lid and let it simmer till the chicken is cooked.",
            "Garnish with chopped coriander and serve."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Butter Chicken",
        "ingredients": [
            "700 gm raw chicken  ",
            "For theMarinade:",
            "1 tsp red chilli powder ",
            "1 tsp ginger and garlic paste ",
            "Salt to taste ",
            "1/2 kg curd  ",
            "For theGravy:",
            "175 gm white butter ",
            "1/2 tsp black cumin seeds ",
            "1/2 kg tomato, pureed ",
            "1/2 tsp sugar ",
            "1 tsp red chilli powder ",
            "Salt to taste ",
            "100 gm fresh cream ",
            "4 green chillies, sliced",
            "1/2 tsp fenugreek leaves, crushed"
        ],
        "instructions": [
            "For marinating the chicken",
            "In a mixing bowl, mix red chilli powder, ginger garlic paste, salt and curd.  ",
            "Add the raw chicken pieces to the marinade and mix well. Keep it in the refrigerator overnight or minimum 6 hours.  ",
            "Roast the marinated chicken in a tandoor or an oven for about 10-12 minutes until it is three-fourth done.  ",
            "For the chicken gravy",
            "Heat half the quantity of white butter in pan. ",
            "Pour in the tomato puree, and saute for 2-3 minutes. Add cumin seeds, sugar, red chilli powder and salt. Mix well.  ",
            "Add the prepared chicken, white butter, fresh cream, sliced green chillies and crushed fenugreek leaves.  Saute for 3-4 minutes and let the chicken cook.",
            "Cook till chicken is done. Serve hot with rice or naan."
        ],
        "cook_time": "30 Minutes + Marination time (overnight)",
        "cuisine": "french"
    },
    {
        "name": "Lobster Thermidor",
        "ingredients": [
            "For Bechamel sauce: ",
            "Butter ",
            "Milk ",
            "White flour: all to taste  ",
            "For main preparation: ",
            "200 gm lobster meat ",
            "1 tsp refined oil ",
            "1 tsp butter ",
            "2 tsp chopped onions ",
            "1 tsp chopped garlic ",
            "1 cup Bechamel Sauce ",
            "2 tsp mushroom ",
            "1/2 tsp salt ",
            "Pinch of tarragon (an aromatic culinary herb)",
            "Pinch of chervil (a herb similar yo parsley)",
            "1/2 tsp mustard powder ",
            "1 tsp white pepper powder ",
            "2 tsp white wine ",
            "2 tsp cream"
        ],
        "instructions": [
            "Cut the lobster into two horizontally and remove the lobster meat from the shell. ",
            "For the bechamel sauce:",
            "Add butter, milk and white flour and mix it well. Bechamel sauce is ready.  ",
            "For the main preparation:",
            "Heat oil in pan. Add butter, onion, garlic and saute till onion turn light brown.",
            "Then add bechamel sauce, mushrooms, lobster meat, salt, tarragon, chervil, mustard, white pepper powder, wine and cream. ",
            "Mix well.  Spread the preparation on the lobster shell and garnish with shredded cheese. ",
            "Serve hot."
        ],
        "cook_time": "1 Hour",
        "cuisine": "french"
    },
    {
        "name": "Coq Au Vin",
        "ingredients": [
            "1 jointed chicken with the skin    ",
            "2 Tbsp butter    ",
            "100 gm bacon - cut into 1/2 \" strips    ",
            "3 Tbsp cognac (optional)    ",
            "Salt and pepper    ",
            "350 ml red wine    ",
            "250 ml chicken stock    ",
            "1 tsp thick tomato paste    ",
            "2 tsp garlic paste    ",
            "1 bay leaf    ",
            "1/4 tsp thyme    ",
            "1 tsp butter    ",
            "1 tsp flour    ",
            "100 gm button onions- browned in butter    ",
            "250 gm quartered mushrooms - browned in butter    ",
            "Chopped parsley to garnish"
        ],
        "instructions": [
            "Brown chicken in hot butter.   Remove from pan and add bacon strips and saute until golden",
            "Replace chicken in pan and flambe with Cognac. ",
            "Pour in wine and stock.   ",
            "Add tomato and garlic paste, bay leaf and thyme. ",
            "Cover pan and simmer for 25 minutes till chicken is tender.  Remove chicken pieces. ",
            "Let  sauce and thicken with 1 tea spoon of butter mixed with flour. ",
            "Add onions and mushrooms to the pan. Allow to heat and spoon over the chicken.   ",
            "Serve with parsley potatoes and buttered peas."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Poulet A La Moutarde",
        "ingredients": [
            "Bechamel sauce butter milk refined flour: all to taste  Chicken preparation thin chicken breasts 2 tbsp mustard sauce 2 tsp oil 1 tsp butter  Main preparation 1 tsp oil 2 tsp chopped shallots 1 tsp garlic 1 tsp salt 4 tbsp bechamel sauce  Chicken preparation 1/4 pepper powder 4 tbsp fresh cream"
        ],
        "instructions": [
            "For the Bechamel Sauce, add butter, milk and refined flour in a pan and mix it well. The bechamel sauce is ready.  ",
            "For the chicken preparation, mix mustard and chicken in a bowl and keep aside.   Then heat oil in pan. ",
            "Add butter, chicken breasts and toast the chicken for about thirty seconds. ",
            "Remove the chicken from the pan and keep it aside.  ",
            "For the main preparation, heat oil in pan. Add shallots, garlic, Bechamel sauce, chicken, pepper, salt and cream.   ",
            "Cook the preparation for five to six minutes on low flame.  ",
            "Poulet a la Moutarde is ready.  Serve hot with grilled tomatoes and fried potatoes."
        ],
        "cook_time": "25 mins",
        "cuisine": "french"
    },
    {
        "name": "Pate Maison",
        "ingredients": [
            "250 gm chicken liver ",
            "1 chopped onion    ",
            "1/2 tsp garlic paste    ",
            "1 bay leaf    ",
            "100 gm butter    ",
            "Salt and pepper to taste    ",
            "1 Tbsp chopped garden herbs"
        ],
        "instructions": [
            "Soften onion and garlic in 25 gm butter for 5 minutes. ",
            "Add bay leaf and chicken liver into the pan and saute for 5 minutes. ",
            "Remove the bay leaf and puree the liver.   ",
            "Sieve through a wire strainer. ",
            "Add the remaining butter and herbs. ",
            "Serve hot with melba toast.       ",
            "For the melba toast:",
            "Roll out the bread slices with a rolling pin until flat. ",
            "Cut into two halves and bake in a slow oven until crisp."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Chicken Lyonnaise",
        "ingredients": [
            "200 gm chicken julienne ",
            "100 gm butter ",
            "50 gm onions ",
            "10 gm garlic ",
            "60 gm capsicum ",
            "60 gm tomatoes ",
            "3-4 black olives ",
            "Spinach-boiled and sauteed ",
            "Potato-boiled and sauteed ",
            "Carrots-boiled and sauteed ",
            "Beans-boiled and sauteed ",
            "60 ml white wine ",
            "Salt and pepper-to taste"
        ],
        "instructions": [
            "Heat butter and saute onions and garlic for about a minute. ",
            "Add chicken and quick fry on high heat until chicken gets a brown texture on the outside.  ",
            "Add capsicum and tomatoes and saute for a minute. ",
            "Then add the white wine and season with salt and pepper.  ",
            "Add the black olives and serve with vegetables."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Ratatouille of Vegetables",
        "ingredients": [
            "2 Tbsp olive oil",
            "1/2 red bell pepper, diced",
            "1/2 yellow bell pepper, diced",
            "1/2 green capsicum, diced",
            "1/2 yellow squash, diced",
            "1/2 zucchini, diced",
            "1/2 onion, diced",
            "2 baby eggplants, diced",
            "1 tomato, diced",
            "2-3 Tbsp tomato puree",
            "1/2 cup tomato juice",
            "Salt, to taste",
            "Black pepper, to taste",
            "Parsley, a few sprigs chopped",
            "Thyme, a few sprigs chopped",
            "Rosemary, a few sprigs chopped",
            "3-4 basil leaves"
        ],
        "instructions": [
            "In a pan add olive oil. Add the diced vegetables. Saute them for 4-5 minutes.",
            "Add tomato puree and juice. Le it simmer for 1-2 minutes.",
            "Add salt and pepper.",
            "Add all the parsley, thyme, basil and rosemary. Saute.",
            "Close the stove. Let the ratatouille rest in its juices for a few minutes before serving."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Baked Banana Suzette",
        "ingredients": [
            "4-5 bananas 150 gm sugar200 ml orange juice50 gm butter1 Tbsp roasted cinnamon 1 Tbsp cardamon",
            "For Garnishing:Orange zest RaisinsPistachio Brown sugar "
        ],
        "instructions": [
            "Peel the bananas and set aside in a dish. ",
            " Melt 150 gm sugar on a pan till its color changes to brown and add orange juice, butter, roasted cinnamon and cardamon and bring to a boil.",
            "  Then simply pour it over the peeled bananas.",
            "  Top it up with some orange zest, raisins, pistachios and brown sugar and bake it at    170 C  for 15 -20mins and serve hot."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Vichyssoise Soup",
        "ingredients": [
            "30 gm butter ",
            "200 gm onions   ",
            "200 gm potatoes   ",
            "200 gm leeks   ",
            "2-3 cups vegetable stock   ",
            "4-5 Tbsp cream  ",
            "Salt - to taste  ",
            "Pepper - to taste   ",
            "Bacon - for garnishing"
        ],
        "instructions": [
            "Heat the butter in a deep saucepan and saute the onions till soft.     ",
            "Add the potatoes and stir for a few minutes.",
            "Then add the leeks and salt. ",
            "Continue to stir till soft.     ",
            "Pour in the vegetable stock and some pepper, bring it to a boil and simmer till the potatoes are cooked.     ",
            "Now puree it in a mixie, add the cream and let it cool in a fridge.     ",
            "Cut the bacon into small pieces and fry in a pan till crisp. ",
            "Sprinkle over the soup as garnish and serve hot."
        ],
        "cook_time": "45 Minutes",
        "cuisine": "french"
    },
    {
        "name": "French Onion Soup with Cheese Souffle",
        "ingredients": [
            "For the soup:",
            "3 Tbsp olive oil   ",
            "20 gm butter   ",
            "1/2 tsp castor sugar   ",
            "1/2 kg onions - sliced  ",
            "5 cups vegetable stock   ",
            "4-6 rounds of buttered toast      ",
            "For the souffle:",
            "20 gm butter   ",
            "1 1/2 Tbsp flour   ",
            "2/3 cups warm milk   ",
            "1/2 tsp French mustard   ",
            "Salt - to taste  ",
            "Pepper - to taste   ",
            "2 egg yolks   ",
            "4 Tbsp grated cheese   ",
            "3 egg whites   ",
            "1 tsp bread crumbs"
        ],
        "instructions": [
            "For the soup:",
            "Heat butter in a deep vessel and add olive oil and castor sugar. ",
            "Add onions and cook on low heat till they turn golden brown in colour.     ",
            "Pour in the stock and bring to boil. ",
            "Cover and simmer for about one hour. The soup should reduce to four cups.      Keep aside.       ",
            "For the souffle:",
            "Heat butter in a saucepan. ",
            "Add the flour and stir over low heat for some time to make a paste.",
            "Pour in the milk, continue stirring and bring to boil making a smooth thick sauce.     ",
            "Mix in the mustard, pepper and salt. ",
            "Switch off the gas and stir in the cheese.     ",
            "Let the sauce cool and the beaten egg yolks gradually with a wooden spoon.     ",
            "In another bowl, whisk the egg whites with a pinch of salt until stiff but not dry.     ",
            "Fold it into the cheese sauce with a light hand. ",
            "Now pour the soup into a baking dish and place the toasts on top.     Pour the souffle mixture over the toasts. Sprinkle the bread crumbs, cheese and butter on top.     ",
            "Heat the oven to 230 degrees and bake for about 20 minutes or until the souffle is well risen and golden in colour.     Serve immediately."
        ],
        "cook_time": "1 Hour 30 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Millefeuille of Aubergine",
        "ingredients": [
            "1/2 kg eggplant 1 cup chopped onion 1/4 cup chopped garlic 1 tbsp chopped green chillies 4 tbsp basil oil 1 cup balsamic vinegar 1 cup extra virgin olive oil 1 cup chopped tomatoes 3 tbsp lemon juice salt to taste Balsamic reduction tomato vinaigrette basil leaf - to garnish"
        ],
        "instructions": [
            "Cut eggplant into thin slices and grill it. In a bowl, mix onions, garlic, green chillies, basil oil, balsamic vinegar, extra virgin olive oil, chopped tomatoes, lemon juice and salt. Take a separate bowl and line its base with the eggplant slices. Pour over the salad mixture and then add another layer of eggplant slices on top, this time the other way round. Seal it with a cling film and refrigerate for 2 days. Now, cut the refrigerated layers into square pieces and sprinkle some basil oil, tomato vinaigrette and balsamic reduction. Garnish with basil leaf and serve."
        ],
        "cook_time": "30 mins + chilling time",
        "cuisine": "french"
    },
    {
        "name": "Vegetable Crepe",
        "ingredients": [
            "For the Crepe",
            "50 gm whole wheat flour ",
            "50 gm refined flour ",
            "150 ml milk ",
            "1 egg ",
            "a pinch of salt and sugar   ",
            "For the filling",
            "3 Tbsp sliced onions ",
            "1/4 cup sliced mushrooms  ",
            "2 Tbsp chopped and blanched asparagus  ",
            "2 Tbsp juliennes of peppers ",
            "1/4 cup sliced zucchini ",
            "1 Tbsp grated cheese ",
            "3 Tbsp steamed corn ",
            "2 tsp jalapeno peppers or green chillies ",
            "3 tsp olive oil ",
            "salt and pepper to taste"
        ],
        "instructions": [
            "For the crepes, in a bowl sift in the whole wheat flour, refined flour and salt. Mix well. ",
            "In a separate bowl, mix the eggs, milk and sugar. ",
            "Fold the flour mixture into the egg mixture. Strain to remove any lumps. ",
            "Ladle the mixture onto a non-stick pan to make thin pancakes. Keep aside. ",
            "To prepare the filling, heat olive oil in a pan and add all the vegetables. Season and cook over high heat till they turn crunchy.",
            "Warm crepes one at a time. Sprinkle the grated cheese on top. ",
            "Place the sauteed vegetables down the center of each crepe and fold the ends in to overlap.",
            "Place them on a plate, sprinkle with parsley and serve with tomato salsa or any other sauce."
        ],
        "cook_time": "1 Hour",
        "cuisine": "french"
    },
    {
        "name": "Crispy French Loaf",
        "ingredients": [
            "Oven temp: 400 F-204 C 2 cups refined flour ",
            "1 tsp dry yeast ",
            "1 tsp sugar ",
            "1 tbsp olive oil ",
            "1 tsp salt ",
            "lukewarm water to knead the dough ",
            "a greased baking tray"
        ],
        "instructions": [
            "Dissolve sugar in 1/2 cup lukewarm water and sprinkle yeast over it. ",
            "Leave in a draught-free place till it froths a little. ",
            "Mix the sugar, oil, and salt into the flour and then knead into a soft dough. ",
            "Cover with a wet cloth and leave to rise in a draught-free place. ",
            "When it doubles, punch it and leave to rise again. ",
            "Roll dough flat, to 1/8\" thick. Roll like a swiss roll and shape into a long roll. ",
            "Place on the greased tray and leave to rise for 15-20 minutes. ",
            "Brush with some salted water and bake in a pre-heated oven for about 20 minutes."
        ],
        "cook_time": "3 hours",
        "cuisine": "french"
    },
    {
        "name": "Red Onion Galettes",
        "ingredients": [
            "5 Tbsp olive oil ",
            "500 gm red onions-sliced ",
            "2 Tbsp mixed herbs-chopped ",
            "1 garlic clove-crushed ",
            "1 Tbsp sun dried tomato paste ",
            "225 gm ready made puff pastry ",
            "Freshly ground black pepper ",
            "Thyme sprigs to garnish"
        ],
        "instructions": [
            "Heat 2 table spoon oil in a frying pan and add the onions and the garlic. ",
            "Cover and cook for approximately 20 minutes till they turn soft.  Stir in the herbs. ",
            "Preheat the oven to 200 degree C.  ",
            "Divide the pastry into four and roll out each of them into a 15cm/6 inches round.  ",
            "Flute the edges and prick it all over with a fork and place on baking sheets.  ",
            "Chill the rounds on the baking sheets in the fridge for about 10 minutes.  ",
            "Mix in the remainder of the olive oil with the tomato paste and spread over the pastry rounds.  ",
            "Spread the onion mixture over the pastry and season with pepper.  ",
            "Drizzle over a little oil and then place them on the baking sheets in the preheated oven for 15 minutes, till they turn crisp.   ",
            "Serve garnished with thyme sprigs."
        ],
        "cook_time": "1 Hour",
        "cuisine": "french"
    },
    {
        "name": "Ratatouille Moulds with Saffron Sauce",
        "ingredients": [
            "250 gm diced aubergine    ",
            "Salt    to taste",
            "2 Tbsp oil    ",
            "1 large onion - diced    ",
            "1 tsp garlic paste    ",
            "350 gm sliced courgettes    ",
            "1 diced green capsicum    ",
            "2 tomatoes - peeled, de-seeded and chopped    ",
            "3 Tbsp thick tomato paste    ",
            "Pepper    to taste",
            "2 Tbsp chopped herbs     ",
            "For the saffron sauce:    ",
            "1/2 Tbsp butter    ",
            "1/2 Tbsp flour    ",
            "200 ml vegetable stock    ",
            "1/2 tsp saffron strands ",
            "Soaked in 1 Tbsp water"
        ],
        "instructions": [
            "Sprinkle aubergine with salt. Set aside and rinse. ",
            "Heat oil in a pan. Fry onions and garlic until onions soften. ",
            "Add aubergine, courgette and capsicum. Stir until soft. Season. ",
            "Add remaining ingredients. Cover and simmer on a low flame for 20 minutes.     ",
            "Spoon into oiled/lined moulds and press down firmly. Turn onto plates and serve with sauce.     ",
            "For the Sauce:",
            "Melt butter in a pan. Stir in flour. Cook for 1 minute. ",
            "Pour in stock. Bring to a simmer. ",
            "Season well. ",
            "Add saffron and cream.   ",
            "Serve with the ratatouille moulds."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Vegetable Au Gratin",
        "ingredients": [
            "Oven Temp 160 C- 325 F",
            "65 gm French Beans-chopped and blanched  ",
            "125 gm cauliflower-diced ",
            "50 gm mushrooms-sliced thin ",
            "2 tsp oil ",
            "1 tsp cumin seeds ",
            "1/4cup onions-chopped fine ",
            "1 tsp salt or to taste ",
            "1/4 tsp pissi kali mirch",
            "3 tbsp maida-roasted a little ",
            "2 cups milk  ",
            "1 cup grated cheese"
        ],
        "instructions": [
            "Mix the milk into the flour gradually (to avoid lumps), bring to a boil and simmer for a minute. ",
            "Heat the oil, add the zeera. When it splutters, add the onions and stir-fry over high heat, till well covered with oil. ",
            "Add vegetables and mushrooms and continue to stir-fry over high heat, till the vegetables are half cooked. ",
            "Add the milk mixture, salt, kali mirch and mix well. ",
            "Transfer on to an oven-proof serving dish.",
            "Sprinkle the cheese and bake in a pre-heated oven for half an hour and serve hot."
        ],
        "cook_time": "1 Hour",
        "cuisine": "french"
    },
    {
        "name": "Simple Chicken Cordon Bleu",
        "ingredients": [
            "4 chicken breast - skinless and boneless  ",
            "4 slices cheese ",
            "4 thin slices of ham ",
            "1 cup all-purpose flour/maida",
            "1 egg - beaten ",
            "1 cup bread crumbs ",
            "A greased baking dish ",
            "4 Tbsp butter ",
            "1 cup chicken broth/stock ",
            "1 cup cream  ",
            "1/2 tsp garlic paste ",
            "Salt  ",
            "Black pepper powder ",
            "1/2 tsp dried oregano/2 tbsp fresh oregano"
        ],
        "instructions": [
            "Slit the chicken breasts, lenghtwise and pound to 1/8 inch thickness. ",
            "Sprinkle salt and pepper on both sides. ",
            "Keeping the smooth side down, place the a slice of ham over each chicken breast and then a slice of cheese. ",
            "Roll up each breast using toothpicks to secure if necessary. ",
            "Dredge each in flour, shake off excess, then roll again in egg and finally in bread-crumbs. ",
            "Place seam side down in the baking dish. Place one tbsp of butter on each piece of chicken. ",
            "Bake at 350 degrees for 35 minutes or till the juices run clear. ",
            "Meanwhile, in a saucepan, combine broth and whipping cream. ",
            "Season with salt, pepper, garlic and oregano. ",
            "Simmer on low and keep stirring till it becomes thick. ",
            "Pour it over the chicken and serve."
        ],
        "cook_time": "1 Hour",
        "cuisine": "french"
    },
    {
        "name": "Chocolate Cake in a Pressure Cooker",
        "ingredients": [
            "1 cup flour  ",
            "1/4 cup cocoa powder  ",
            "1 1/4 tsp baking powder",
            "1/4 cup butter",
            "3/4 cup caster sugar",
            "1/4 cup water  ",
            "2 eggs  ",
            "1/2 tsp vanilla essence",
            "1/8 tsp salt  ",
            "6 inch round greased baking tin"
        ],
        "instructions": [
            "In a mixing bowl, sift the flour, cocoa powder and baking powder. ",
            "Add in the butter, sugar, salt, water and vanilla, and beat the ingredients using a whisk.     ",
            "Add the eggs and beat the batter until smooth. ",
            "Transfer into the baking tin.    ",
            "Heat the pressure cooker, covered with the lid but without the pressure, for 3-4 minutes on high heat, then place the cake tin in the empty cooker (do not add water in the cooker).     ",
            "Close the lid (without the pressure), lower the flame and let it cook until done (about 30 minutes)."
        ],
        "cook_time": "1 Hour",
        "cuisine": "french"
    },
    {
        "name": "Honey Chilli Potatoes",
        "ingredients": [
            "For the potatoes:",
            "2 potatoes, peeled and sliced",
            "3-4 Tbsp cornflour or maida",
            "Salt to taste",
            "1 tsp red chilli powder",
            "Oil, for deep frying",
            "For the base:",
            "1 tsp oil",
            "2 spring onions (with stalk), sliced",
            "1 Tbsp garlic paste",
            "1 capsicum, sliced",
            "2 Tbsp honey",
            "Salt, to taste",
            "1/4 tsp soya sauce",
            "3 tsp white sesame seeds",
            "2 tsp chilli sauce"
        ],
        "instructions": [
            "For the potatoes:",
            "In a bowl, add cornflour or maida, salt and red chilli powder.",
            "Add the sliced potatoes and mix well until the potatoes are coated.",
            "Heat oil in a wok and deep fry the potatoes until golden. Keep aside.",
            "For the Base:",
            "In a wok, add oil, garlic paste and spring onions. Saute on high heat for 1 minute.",
            "Add capsicum, honey, salt, soya sauce, chilli sauce. Saute for 2-3 minutes.",
            "Add the deep-fried potatoes and sesame seeds. Mix well and serve hot."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Vegetable Momos",
        "ingredients": [
            "For Dough:",
            "2 cups maida",
            "1/2 tsp salt ",
            "1/2 tsp baking powder   ",
            "For Filling: ",
            "1 cup carrots - grated ",
            "1 cup cabbage - grated ",
            "1 Tbsp oil ",
            "1/2 cup onion - finely chopped ",
            "1 tsp garlic - chopped  ",
            "1 tsp Soya sauce ",
            "Salt ",
            "1/4 tsp vinegar ",
            "1/4 tsp black pepper"
        ],
        "instructions": [
            "Mix the maida, salt and baking powder and knead to a stiff dough with water. ",
            "Heat oil and add the onion and garlic. ",
            "Saute over high heat and add the carrot and cabbage. Turn around over high heat till glossy. ",
            "Take it off the heat and mix in the Soya sauce, salt, vinegar and black pepper. ",
            "Roll the dough thin (translucent) and cut into 4\"-5\" rounds. ",
            "Take a round, wet edges and place some filling in the center. ",
            "Bring edges together to cover the filling. Twist to seal and fill the rest in the same way. ",
            "Steam for about 10 minutes and serve with soya sauce and chilli sauce."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Chole Bhature",
        "ingredients": [
            "For chole:",
            "2 cup chickpeas (channas)",
            "2 tsp oil",
            "1 bay leaf (tej patta)",
            "1 stick cinnamon (dalchini)",
            "3-4 cloves (laung)",
            "1 tsp whole pepper corns (sabut kali mirch)",
            "3 green cardamom  (choti elaichi)",
            "2 black cardamom (badi elaichi)",
            "1 tsp turmeric powder (haldi)",
            "1 tsp chili powder (lal mirch powder)",
            "1 tsp coriander powder (dhaniya powder)",
            "1 tsp cumin powder (zeera powder)",
            "1 tsp cumin seeds (zeera)",
            "1/2 tsp asafoetida (heeng)",
            "Salt to taste",
            "1 cup onions (chopped)",
            "1 cup tomatoes (chopped)",
            "1 tsp ginger (chopped)",
            "1 tsp garlic (chopped)",
            "1 tsp ajwain",
            "1 tsp lime juice",
            "1 green chili (chopped)                      1 tea bag                                                1 Tbsp butter",
            "For the bhaturas:",
            "2 cups maida (refined flour)",
            "1/2 tsp yeast, dissolved for 10 minutes in luke warm water",
            "1/2 cup whole wheat flour",
            "A pinch of salt",
            "Water to knead",
            "Oil for frying"
        ],
        "instructions": [
            "For chole:",
            "In a pan add oil, bay leaf, cinnamon, cumin seeds, cloves, whole pepper corns, green and black cardamom.",
            "After it gets brown add chopped onions and saute it.",
            "After sauteing add chopped ginger and garlic.",
            "Then add turmeric, chili powder, coriander powder, cumin powder, asafoetida, salt and fry well.",
            "For de glazing the pan add little water.",
            "Now add the chole (soaked overnight and pressure cooked) to the masala.",
            "After stirring well add tomatoes, little sugar and salt to the chole (chickpeas)",
            "Now add ajwain, chopped green chilies and water for the base.",
            "To get the color in the chole, add a tea bag to the masala.",
            "Simmer the chole gently for an hour and cover it.",
            "Add lime juice and a dollop of butter to it.",
            "Garnish the chole with coriander and butter.",
            "Serve the chole hot with bhaturas.",
            "For the bhaturas:",
            "Knead the whole wheat flour, maida and salt together with adequate amount of water.",
            "Sprinkle the yeast on top. Leave it for 2-3 hours for the yeast to work.",
            "Divide it into equal portions. Roll out in an oval or round shape.",
            "Deep fry till golden brown, like a puri.",
            "Serve. "
        ],
        "cook_time": "1 Hour",
        "cuisine": "french"
    },
    {
        "name": "Quick Chicken Curry",
        "ingredients": [
            "1 kg chicken",
            "3 large onions, paste",
            "2 large tomatoes, pureed",
            "1 Tbsp garlic paste",
            "1 Tbsp ginger paste",
            "2 tsp coriander powder",
            "2 tsp cumin powder",
            "1/2 tsp turmeric powder",
            "1/2 tsp red chilli powder",
            "1 tsp garam masala powder",
            "2 Tbsp oil",
            "Salt to taste",
            "Chopped coriander for garnish"
        ],
        "instructions": [
            "Heat oil in a pan and sauté the onion paste, garlic & ginger paste till golden brown.",
            "Add tomato puree. When the tomato puree dries up, add coriander powder, cumin powder, garam masala, red chilli powder, turmeric powder and salt. Let the spices cook.",
            "Add chicken pieces into the masala. Stir well and cook till they are golden brown.",
            "Add 1/2 cup of water and stir. Cover with a lid and let it simmer till the chicken is cooked.",
            "Garnish with chopped coriander and serve."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "french"
    },
    {
        "name": "Butter Chicken",
        "ingredients": [
            "700 gm raw chicken  ",
            "For theMarinade:",
            "1 tsp red chilli powder ",
            "1 tsp ginger and garlic paste ",
            "Salt to taste ",
            "1/2 kg curd  ",
            "For theGravy:",
            "175 gm white butter ",
            "1/2 tsp black cumin seeds ",
            "1/2 kg tomato, pureed ",
            "1/2 tsp sugar ",
            "1 tsp red chilli powder ",
            "Salt to taste ",
            "100 gm fresh cream ",
            "4 green chillies, sliced",
            "1/2 tsp fenugreek leaves, crushed"
        ],
        "instructions": [
            "For marinating the chicken",
            "In a mixing bowl, mix red chilli powder, ginger garlic paste, salt and curd.  ",
            "Add the raw chicken pieces to the marinade and mix well. Keep it in the refrigerator overnight or minimum 6 hours.  ",
            "Roast the marinated chicken in a tandoor or an oven for about 10-12 minutes until it is three-fourth done.  ",
            "For the chicken gravy",
            "Heat half the quantity of white butter in pan. ",
            "Pour in the tomato puree, and saute for 2-3 minutes. Add cumin seeds, sugar, red chilli powder and salt. Mix well.  ",
            "Add the prepared chicken, white butter, fresh cream, sliced green chillies and crushed fenugreek leaves.  Saute for 3-4 minutes and let the chicken cook.",
            "Cook till chicken is done. Serve hot with rice or naan."
        ],
        "cook_time": "30 Minutes + Marination time (overnight)",
        "cuisine": "french"
    }
]