[
    {
        "name": "Cha Shu Broth",
        "ingredients": [
            "2kg pork bones from ribs",
            "2kg pork trotters",
            "2kg pork head (brain removed)",
            "650gm carrot",
            "500gm onion",
            "250gm leeks",
            "100gm garlic",
            "200gm ginger ",
            "1 stick kelp seaweed (konbu) ",
            "20ml soy sauce (light)",
            "15gm bonito flakes",
            "20 litres water"
        ],
        "instructions": [
            "Fill a large enough cooking pot with water and bring to boil.",
            "Switch off fire as soon as the water boils. Drop in the bones and let cool. This process will help you get rid of the blood and blood vessels easily.",
            "Drain the water off the bones in a large strainer and discard the water.",
            "Check and take off any blood or blood vessels from the bones and wash them under running water.",
            "Break all the bones in two with a hammer. Leave it to cool down for 30-40 minutes.",
            "Fill the pot again with clear water and place a wire mesh beneath and drop the bones inside. Bring to boil.",
            "Keep cooking over a strong fire and scoop out foam and unwanted matters coming up on the surface ",
            "As the bottom might get hotter than near the surface, stir with a large ladle from time to time.",
            "Continue to boil the broth for 24 hours, or until desired consistency and colour is reached, meat has completely separated and broken down in the broth. Add all vegetables one by one and further boil for 10 more hours. Optionally, you can stir every 1-2 hours just to check up on things and promote more churning. ",
            "Add water if the level gets too low. Once cooked to your liking, strain the broth, discarding the solids, and reserve broth by quickly chilling with ice.",
            "Retain the balance quantity by freezing it in food grade plastic bags and ones you wish to use again, simply cut open the plastic bag and dump the frozen stock lump in a cooking pot and place it over heat to melt/defrost .",
            "Flavour it with soy sauce and bonito flakes. "
        ],
        "cook_time": "1 hour ",
        "cuisine": "japanese"
    },
    {
        "name": "Japanese Soba Noodles",
        "ingredients": [
            "For the Noodles",
            "4/5 cup buckwheat flour",
            "1/5 cup wholewheat flour",
            "1/2 cup hot water",
            "A pinch of salt",
            "Starch or cornflour, for dusting",
            "For Stir-frying",
            "2 Tbsp teriyaki sauce",
            "2 onions, thinly sliced",
            "2 carrots, julienned",
            "2 Tbsp oil",
            "A few sprigs spring onions, chopped",
            "250 gm button mushrooms, roughly chopped",
            "Salt to taste"
        ],
        "instructions": [
            "For the Noodles",
            "Sift together the buckwheat, wheat flour and salt in a large mixing bowl. ",
            "Pour the water, a little at a time, and start rubbing the flours with your fingers. Work it well to bring it together to form a dough. Knead well, if it gets dry, add a little water and knead again.",
            "Cover with a moist kitchen towel and keep it in the refrigerator for 30 minutes.",
            "Take it out, and knead again. Divide into 4 balls, and dunk each ball in cornflour or starch before rolling it out. Use a big rolling pin, try to make the dough as thin as possible, but be careful as it may get a little crumbly and crack. A clever trick is to roll it as much as you can, then cut it into a rectangular sheet to remove the cracks. Keep sprinkling some corn flour to prevent it from sticking. ",
            "Layer all the rectangular sheets, making sure that you have sprinkled enough cornflour in between the layers. Using a large knife, carefully slice the dough to make thin strips.",
            "Bring a large saucepan of water to a boil and cook the noodles in small batches for 2 minutes. ",
            "Heat oil in a wok, and stir-fry the onions for 3-4 minutes until softened. Add the mushrooms and carrots and toss well.",
            "Add the noodles and teriyaki sauce and mix well. Let it cook for 2 minutes. ",
            "Season with salt and tip in the spring onions. Toss well and serve immediately."
        ],
        "cook_time": "1 Hour 30 minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Smoked Pumpkin Soup",
        "ingredients": [
            "1 kg yellow pumpkin",
            "Salt to taste",
            "20gm sugar",
            "20ml oil",
            "10gm smoke chips",
            "10gm butter (optional)",
            "20gm garlic (chopped)",
            "10gm pepper powder",
            "For the garnish",
            "20gm roasted pumpkin seeds",
            "A few sprigs water cress",
            ""
        ],
        "instructions": [
            "Peel and slice the pumpkin after washing it. Remove the seeds, and cut into cubes of even sizes. ",
            "Mix oil and garlic, and toss the pumpkin pieces in it to coat them well.",
            "In an oven tray, arrange the pumpkin pieces. Sprinkle the sugar and a little salt on top.",
            "Preheat the oven and bake the pumpkin at 160 degree Celsius till they are tender (depends on the size of the pumpkin, normally takes 10-15 minutes).",
            "Remove the tray from the oven and cool the pumpkin.",
            "For smoking the pumpkin ,arrange it in an inclosable chamber (may be a vessel  with loose fitting lid so that air can pass slightly).",
            "In a small metal bowl or dish, fire up some smoke chips. Put it in the above vessel and cover it with the lid. Leave it for 10 minutes so that the pumpkin can absorb the aroma.",
            "Remove the pumpkin pieces and puree them in a blender (add a bit of water if needed).",
            "Pour the pureed pumpkin in a pan and heat it on medium flame. Add butter and pepper powder. Adjust seasoning if required.",
            "Serve hot in individual soup bowl garnished with cress and pumpkin seeds."
        ],
        "cook_time": "45 minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Crispy Shrimp Tempura with Jalapeno and Onion Salsa",
        "ingredients": [
            "Half sheet size of nori wrapper",
            "2 medium size shrimp",
            "15 gm chopped Jalapeno ",
            "15 gm chopped onion",
            "10 gm iceberg lettuce",
            "100 gm sushi  rice",
            "10 gm flying fish roe"
        ],
        "instructions": [
            "In a sushi mat, place the nori wrapper and then spread the sushi rice until all the nori is covered with rice evenly. ",
            "Now arrange all the ingredients inside. ",
            "Roll and cut it to 6 pieces. ",
            "Then add flying fish roe on the top of each roll. ",
            "Serve with wasabi, pickled ginger and soya sauce.",
            ""
        ],
        "cook_time": "25 Minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Chicken Balls in Yakitori Sauce",
        "ingredients": [
            "For the chicken balls:",
            "1 kg chicken mince (chicken legs with skin)",
            "100 gm carrots, finely chopped",
            "20 mushrooms, finely chopped",
            "1 onion, chopped",
            "5 gm lemon rind, grated",
            "1 egg white",
            "100 ml soya",
            "50 ml mirin",
            "50 ml sake",
            "5 gm black sesame seeds",
            "Honduchi, pinch (optional)",
            "1/2 tsp oil, to grill the chicken balls",
            "For the yakitori sauce:900 ml soya sauce",
            "900 ml mirin",
            "450 ml cooking sake",
            "350 gm sugar, granulated",
            "75 gm ginger, peeled",
            "500 gm chicken bones",
            "1 green apple",
            "50 gm celery",
            "100 gm carrots",
            "20 gm cornflour",
            "You will need:",
            "Skewers soaked in water overnight"
        ],
        "instructions": [
            "For the chicken balls:",
            "In the chicken mince add chopped onions, carrots, mushrooms and lemon rind.",
            "Mix in the egg whites (mix with hands). Add soya, mirin, sake and sesame seeds.",
            "Press with hands and make small balls out of this mixture.",
            "Steam for eight minutes and skewer on to wooden bamboo sticks.",
            "Grill with 1/2 tsp oil.",
            "Dip in yakitori sauce and serve.",
            "For the sauce:",
            "Take a thick bottomed pan and boil the mirin. When boiling, flame it till all alcohol burns off.",
            "Mix soya, sugar, sake and add to the reduced mirin.",
            "Cut the ginger, carrots, apple, celery into 1 inch cubes and throw in sauce.",
            "Blanch the chicken bones in boiling water and add to sauce.",
            "Cook 1 hour and thicken with cornflour."
        ],
        "cook_time": "1 Hour 45 Minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Broccoli Soup with Wasabi",
        "ingredients": [
            "1 onion, chopped ",
            "Olive oil",
            "1/2 garlic, chopped fine",
            "1 bowl of broccoli, chopped",
            "1/2 tsp wasabi",
            "Some cheese (here the chef as used blue stilton cheese)",
            "1/2 cup cream",
            "1 potato, chopped into small cubes",
            "1 tsp butter",
            "1 apple, chopped",
            "Red chilly flakes"
        ],
        "instructions": [
            "Heat some olive oil in a pan and fry the onions. Now toss in the garlic.",
            "Throw in the broccoli now.",
            "Add some water to this which will help the broccoli cook.",
            "Halfway through add the wasabi and some cheese.",
            "Mix well. Now add the cream.",
            "Add this mixture to a blender and blend well. Keep aside.",
            "Now in another add some oilve oil and fry the potatoes till they become nice and brown.",
            "Once done, drain of all oil and seaon the potatoes with some salt. Keep aside",
            "Now for the apple compote, heat some butter in a pan, add the chopped apple and a pinch of sugar.",
            "Let it simmer till the apple becomes gooey and brown.",
            "Pour out the soup in a bowl garnish with the fried potatoes and red chilly flakes.",
            "Serve with the apple compote."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Candied Sweet Potatoes with Black Sesame",
        "ingredients": [
            "1 cup sweet potato, peeled and diced",
            "Oil to fry",
            "2 Tbsp black sesame seeds",
            "Fruit slices, to garnish",
            "For the sugar syrup / soy caramel:1 Tbsp soy",
            "3 Tbsp water",
            "1/3 cup sugar"
        ],
        "instructions": [
            "In a pan add oil and fry the sweet potato cubes till golden brown. Drain on absorbent paper.",
            "In a deep bottomed pan add soy sauce, water and sugar. Cook till sugar melts. Keep stirring continuously till the syrup is light brown in color (Resembles the color of caramel).",
            "Add the fried sweet potatoes. Cook till well coated.",
            "Add the black sesame seeds. Toss well.",
            "Garnish with some kiwi slices or any fruit of your choice. Serve."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Wasabi Aloo Tikki",
        "ingredients": [
            "For the aloo tikkis:",
            "Half aubergine, thinly sliced",
            "2 tomatoes",
            "5 potatoes, boiled",
            "Olive oil",
            "Salt and pepper",
            "1 tsp butter, melted",
            "2 tsp wasabi",
            "1 egg, beaten",
            "1 cup breadcrumbs (Here Japanese rice breadcrumbs have been used but you can use regular breadcrumbs too)",
            "For the sweet chilly sauce:",
            "2 Tbsp honey",
            "2 Tbsp fish sauce",
            "1 lemon juice",
            "2 chopped green chillies",
            "1 chopped red chilli"
        ],
        "instructions": [
            "Marinate the aubergine slices in some olive oil, salt pepper and bake in the oven for about 10 minutes at 140 degrees.",
            "Make a slight incision in both the tomatoes and place them in boiling water for only 15 seconds. Once done, place them in some ice cold water.",
            "Peel the skin of the tomatoes and slice them.",
            "Drizzle some olive oil, salt pepper over the tomatoes and bake for about 5-7 minutes at 140 degrees.",
            "Mash the potatoes. Add salt, pepper, butter and wasabi to it. Mix all together.",
            "Mix in the egg to the mashed potatoes. Reserve some of the beaten egg to caot the tikkis later.",
            "Make round tikkis (flattened round balls) with the potatoes. ",
            "Brush the tikkis with some egg (you reserved earlier) and then wrap these tikkis in the bread crumbs.",
            "Deep fry the tikkis in oil till golden brown.",
            "Once done wrap them with the baked aubergine slices and place the tomatoes over it.",
            "You can serve this with a sweet chilli sauce."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "japanese"
    },
    {
        "name": "California Sushi Rolls",
        "ingredients": [
            "1 sheet of nori (seaweed) cut into half",
            "110 gram cooked sushi rice",
            "2 slices avocado",
            "15 gram fresh crab meat or crab stick grated",
            "Tobiko (Japanese caviar) if you can get otherwise you can use black Japanese sesame seeds",
            "You will also need: ",
            "A sushi rolling mat",
            "A damp cotton napkin",
            "A sharp knife"
        ],
        "instructions": [
            "Prepare the damp napkin as in picture. Place 1/2 sheet of nori (Right: The pic only has a quarter).Please cut half shiny side down on the center of the damp napkin \n(horizontal lines on the sheet should face you.) Now spread the sushi \nrice on the sheet with damp fingers evenly.Spread the tobiko over the rice and flip the sheet so rice is on the other side and the sheet is facing you with its horiziontal lines.Place avocado in center and line with crab meat. Take the bottom edge of\n the sheet with both fingers on each side and roll over the top of crab \nand avocado leaving about 1 cm of nori protruding out.roll again so the \njoint is now at the bottom.Place the entire roll back on the center of the napkin and roll the napkin from the bottom edge over the roll.Place the top half of rolling mat over the napkin and roll. Using the \nthumb and middle finger, pinch sides of roll while applying even \npressure over the top of the roll with the index fingers.While \nlifting both the mat and napkin up by the corner, gently roll the roll \nthrough a 1/4 turn so it is lying on its next side, replace napkin and \nmat and repeat the pinching process as described earlier.Remove mat and unfold napkin and replace roll in center again. Cut roll \nin half with a slightly damp sharp knife with a sawing action.Line up two halves and cut again into three pieces of equal size leaving you with six equal size portions.  Serve the California roll with wasabi, soya and ginger. Enjoy.Tips:Never put the sushi rice in the fridge.You will ruin the consistency.Always try consuming sushi on the same day.Always wet you hands slightly while handling sushi rice or it will stick to your hand.As you get better,experiment with your own choice of interesting fillings.This sushi tastes great if topped with a small dollop of chilli mayo (1 tablespoon mayo mixed with 1.4 tsp of chilli garlic sauce)",
            "Prepare the damp napkin as in picture. ",
            "",
            "Place 1/2 sheet of nori (Right: The pic only has a quarter).",
            "",
            "Please cut half shiny side down on the center of the damp napkin \n(horizontal lines on the sheet should face you.) Now spread the sushi \nrice on the sheet with damp fingers evenly.",
            "",
            "Spread the tobiko over the rice and flip the sheet so rice is on the other side and the sheet is facing you with its horiziontal lines.",
            "",
            "Place avocado in center and line with crab meat. Take the bottom edge of\n the sheet with both fingers on each side and roll over the top of crab \nand avocado leaving about 1 cm of nori protruding out.roll again so the \njoint is now at the bottom.",
            "",
            "Place the entire roll back on the center of the napkin and roll the napkin from the bottom edge over the roll.",
            "",
            "",
            "Remove mat and unfold napkin and replace roll in center again. Cut roll \nin half with a slightly damp sharp knife with a sawing action.",
            "Line up two halves and cut again into three pieces of equal size leaving you with six equal size portions.  Serve the California roll with wasabi, soya and ginger. Enjoy.",
            "Tips:Never put the sushi rice in the fridge.You will ruin the consistency.",
            "Always try consuming sushi on the same day.",
            "Always wet you hands slightly while handling sushi rice or it will stick to your hand.",
            "As you get better,experiment with your own choice of interesting fillings.",
            "This sushi tastes great if topped with a small dollop of chilli mayo (1 tablespoon mayo mixed with 1.4 tsp of chilli garlic sauce)",
            ""
        ],
        "cook_time": "30 Minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Sushi Rice",
        "ingredients": [
            "180 gm of sushi rice",
            "2 tsp castor sugar",
            "1/2 teaspoon salt",
            "45 ml vinegar"
        ],
        "instructions": [
            "Wash 180 gm of rice at least 10 times to get the water to be clear.",
            "Now leave in pot of 20 mins. The rice will fluff up a bit.",
            "Put the rice along with equal amount of water eg 1 cup rice and 1 cup water (cold) in a deep pot with a transparent cover if possible. Turn on full heat. Put the lid on the pot and leave until the rice starts to boil.",
            "When it starts boiling, turn down the heat and simmer until water has boiled away.",
            "Now turn of the heat and let the rice steam for 15 to 20 mins.",
            "Put the rice in a deep bowl and mix with salt sugar and vinegar. Mix with a wooden spatula as if you are slicing the rice rather than mixing it in a circular motion. Keep fanning the rice if possible till cool.",
            "Tips:",
            "Never put the sushi rice in the fridge.you will ruin the consistency.",
            "Always try consuming sushi on the same day.",
            "Always wet you hands slightly while handling sushi rice or it will stick to your hand."
        ],
        "cook_time": "45 Minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Zen Soup",
        "ingredients": [
            "1 Tbsp sesame oil",
            "3-4 chopped or diced button mushrooms",
            "1/2 a medium bottle gourd, chopped",
            "1 small carrot, thinly sliced",
            "4 baby corn, sliced",
            "1/2 red and yellow bell peppers, chopped into cubes",
            "1/2 a bok choy, chopped",
            "2 shallots/madras onions, chopped",
            "2 small eggplants, sliced",
            "2-3 small onions, chopped",
            "3-4 shitake or oyster mushrooms, chopped",
            "1 Tbsp red curry paste",
            "1 tsp curry powder or according to taste",
            "1 Tbsp light soy sauce",
            "1 tsp dark soy sauce",
            "1 Tbsp brown sugar",
            "150 ml coconut milk",
            "1/2 cup water",
            "Juice of 1 lemon",
            "2 cups fresh Chinese wheat based noodles or about 3 oz dried thin wheat based noodles",
            "Toppings and garnishes:",
            "1 cup bean sprouts / chowli sprouts",
            "Chopped coriander leaves for garnish",
            "Chopped spring onion for garnish",
            "Crushed peanuts for garnish",
            ""
        ],
        "instructions": [
            "Heat a large wok with oil. Add button mushroom, eggplant, bell peppers, shallots bottle gourd, baby corn and carrot and cook on high for about 2 minutes. ",
            "Then add curry paste and curry powder. Toss to coat the vegetables. Add light soy sauce and cook about 30 seconds so the vegetables absorb the liquid. ",
            "Then add dark soy sauce, brown sugar, lime juice and coconut milk. Let the curry simmer for about 2 minutes. Add salt to taste.",
            "Add chopped coriander and mix all the ingredients well. Slowly pour the in the coconut milk and let it simmer for a few minutes. Do not boil.",
            "Lastly add the bok choy.",
            "Then pour in water and bring back to a simmer. Taste curry and adjust soy sauce, and sugar to taste. ",
            "Bring a large pot full of water to boil noodles. If using dried noodles, cook in boiling water till noodles are very al dente. No matter what noodles you use, make sure not to overcook them. ",
            "Drain well.",
            "Add cooked noodles and bean sprouts to the curry broth. ",
            "Serve the noodle soup with crushed peanuts, scallions, chopped coriander and bean sprouts."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Tonkatsu",
        "ingredients": [
            "4 pork chops",
            "1/2 tsp salt",
            "1/4 tsp pepper",
            "1/4 cup flour",
            "1 egg",
            "1/2 cup panko bread crumbs",
            "Vegetable oil - for frying"
        ],
        "instructions": [
            "Cut the edges of the pork chops. Sprinkle salt and pepper on the pork.",
            "Put flour lightly on the pork. Dip the pork in beaten egg. Put panko on the pork and pat them well.",
            "Deep fry the pork for a few min. Turn over the pork chops and fry for a few more minutes.",
            "Take out the pork and put them on a paper towel to drain the oil.",
            "Cut each tonkatsu into small pieces. Serve Hot."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Teriyaki Pineapple with Raw Mango Slaw",
        "ingredients": [
            "1 pineapple, whole",
            "100 gms of bok choy leaves",
            "1 1/2 Tbsp teriyaki sauce",
            "2 1/2 tsp light soya sauce",
            "1 tsp of sesame oil ",
            "6 tsp of vegetable oil",
            "30 - 35 gm of daikon (pickled radish), cut into thin long strips",
            "30 gm of raw mango, cut into strips",
            "100 gm of ripe papaya, diced",
            "1 tsp of Japanese Kobe mustard",
            "Juice of 1 lime",
            "1 tsp of butter",
            "1/2 tsp of brown sugar",
            "1/2 tsp of lime zest",
            "Salt and pepper to taste"
        ],
        "instructions": [
            "Peel and slice the pineapple into 2- 4 pieces.",
            "Marinate two slices of pineapple with teriyaki sauce, 1 teaspoon of soya sauce, 1 tsp of sesame oil and 1 tsp of vegetable oil and salt. Rest it for 10 minutes.",
            "Then put the marinated pineapple slices onto the grill.",
            "Keep turning the pineapples on the grill and baste them with a little vegetable oil.",
            "Once the pineapple slices have relatively softened and have dark brown grill marks, take them off the grill.",
            "For the Mango Slaw:",
            "Slice up the daikon radish and green mango into thin long strips and season them with salt and black pepper.",
            "To the seasoned daikons and green mangoes, add ½ a teaspoon of light soya sauce, chopped coriander leaves and 1 tsp of vegetable oil. Mix them altogether and refrigerate for about 15 mins. ",
            "In a mixer, add the diced papaya, Kobe mustard, 2 tsps of vegetable oil and lime juice. Blend it well to make a thick papaya sauce.",
            "For the Bok Choy:",
            "Heat 1 teaspoon of vegetable oil in a pan with butter.",
            "Add a pinch of brown sugar, bok choy, a touch of light soy, juice of ½ a lime and a little lime zest. Toss well till the bok choy  gets a nice glaze.",
            "Season with salt and stir well.",
            "For Plating:",
            "Transfer the grilled pineapple slices onto a serving plate. ",
            "Arrange sauteed Bok Choy over the slices along with the raw mango slaw.",
            "Spoon the luscious papaya and mustard puree.",
            "Serve Hot."
        ],
        "cook_time": "1 Hour",
        "cuisine": "japanese"
    },
    {
        "name": "Udon Noodles Salad",
        "ingredients": [
            "100 gms udon noodles ",
            "1/2 medium raddish",
            "1/2 zucchini",
            "1/2 yellow squash",
            "1/2 cucumber",
            "1/2 bell pepper",
            "3 soaked shitake mushrooms",
            "1/2 carrot",
            "1/2 medium spring onion or scallion",
            "1 tsp light soy sauce",
            "1 tsp rice vinegar",
            "1 tsp vegetarian oyster sauce",
            "1/2 tsp sushi vinegar",
            "2 Tbsp vegetable oil"
        ],
        "instructions": [
            "Cook udon noodles in boiling water for 5 minutes. ",
            "Drain out the water. ",
            "Rest the noodles in a bowl.",
            "Use a spaghetti peeler to peel cucumber, yellow squash, medium size radish, carrot, a scallion and shitake mushrooms, half a red bell pepper finely chopped; add all the veggies to the bowl. ",
            "Mix well.  ",
            "For the vinaigrette (oriental inspired vinaigrette): a tablespoon of sushi vinegar, 1 teaspoon of light soy sauce, 1 teaspoon of vegetarian oyster sauce, 2 tablespoons of vegetable oil, give it a mix. ",
            "Season with salt to taste. ",
            "Add the udon noodles to the veggies, and mix with the vinaigrette. ",
            "A few sprigs of coriander. ",
            "Mix with the veggies. ",
            "Serve on a flat plate."
        ],
        "cook_time": "20 Minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Teriyaki Vegetables",
        "ingredients": [
            "½ each bell peppers yellow, red and green",
            "1 cup mushrooms",
            "½ zucchini",
            "½ yellow squash",
            "2-3 garlic cloves",
            "2-3 pieces ginger",
            "1 onion",
            "½ tsp sesame oil",
            "1-2 tsp teriyaki sauce",
            "1 malta orange",
            "1 lemon",
            "1 tbsp orange juice",
            "1 chilly",
            "1 tsp light soya sauce"
        ],
        "instructions": [
            "Add teriyaki sauce, sesame oil, ginger, cracked black pepper, orange juice, lemon zest, season with salt, one chilli,1 teaspoon of light soya sauce, mix all in the grinder. ",
            "Pour the marinade into a glass bowl. ",
            "Marinate all the vegetables:  mushrooms, bell peppers, zucchini, and yellow squash, add some cracked black pepper on the top and mix well.  ",
            "Finally put the veggies on to the skewers. ",
            "Preheat the grill; place the skewers on to the grill. ",
            "For the basting of the skewers: after a while turn over the skewers, brush some marinade over the vegetables on the skewers and place on the grill."
        ],
        "cook_time": "1 hour",
        "cuisine": "japanese"
    },
    {
        "name": "Radish Soup with Tofu Miso Cream",
        "ingredients": [
            "2 medium radishes peeled",
            "1 stalk spring onion with greens",
            "1 Tbsp vegetable oil",
            "20 gm minced leeks",
            "20 gm minced celery",
            "1 tsp grated ginger",
            "1/2 liter stock",
            "Juice of 1/2 an orange",
            "1 big Tbsp miso paste",
            "1 bunch chopped spinach leaves",
            "1 tsp light soya sauce",
            "For the Cream:",
            "50 gm tofu",
            "1 tsp miso (A Japanese seasoning)",
            "1 Tbsp honey",
            "Juice of 1/2 an orange",
            "1 tsp orange zest",
            "1 big pinch togarashi pepper (A Japenese condiment, you can substitute with red chilli pepper)",
            "Garnish: ",
            "1 handful of bean sprouts"
        ],
        "instructions": [
            "Heat oil in a pan, sauté radishes, radish leaves, spring onion greens, and sauté.",
            "Add minced celery and leeks and give it a nice mix.",
            "Add the grated ginger.",
            "Deglaze with orange juice. ",
            "Add one big spoon of miso paste. ",
            "Give a nice stir, and then add the vegetable stock.",
            "Bring to a steady simmer.",
            "Enhance with orange zest.",
            "For the Tofu Miso Cream:",
            "In a mixer add tofu, orange juice, honey, 1 tbsp of the soup and blend till nice and luscious.",
            "Mix the tofu miso cream with the soup.",
            "Add spinach leaves, soya sauce, togarashi peppers, a pinch of salt and bring to a boil.",
            "Serve in a nice bowl.",
            "Garnish with bean sprouts."
        ],
        "cook_time": "1 Hour",
        "cuisine": "japanese"
    },
    {
        "name": "Negima",
        "ingredients": [
            "200 gm chicken breast ",
            "200 gm leeks or spring onions ",
            "2 tsp grated ginger   ",
            "1/2 tsp aasabi or white radish     ",
            "Ginger Soya Dip:",
            "1 tsp ginger juice ",
            "1 Tbsp Japanese Soya Sauce ",
            "1/2 tbsp Mirin ",
            "NOTE: (If Mirin is not available, use Sherry or any other dry white wine)"
        ],
        "instructions": [
            "Cut the chicken breast into small, bite size pieces. ",
            "Cut leeks/spring onion into 1\" long pieces.  ",
            "Marinate chicken and leeks with ginger, wasabi and salt for 15 minutes. ",
            "Skewer the chicken and leek together.  ",
            "For the Sauce:",
            "Mix all the ingredients, let the flavors blend for 15 minutes and strain.  ",
            "Grill the skewers on moderately hot charcoal fire.  Serve hot with Ginger Soya dip."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Ishi Yaki",
        "ingredients": [
            "1/2 cup short grain rice ",
            "1/4 cup spinach ",
            "1/4 cup daikons (Japanese horse radish) ",
            "1 carrot ",
            "1/4 cup seaweed ",
            "2 shitake mushrooms ",
            "1/4 cup soya sauce ",
            "2 Tbsp Mirin (a condiment used in japanese cuisine. A type of rice wine)",
            "2 Tbsp roasted sesame seeds"
        ],
        "instructions": [
            "Wash the rice and drain the cloudy water. Do this thrice then gently grind the rice against the palm of your hand. ",
            "Let the rice stand in a colander for thirty minutes. ",
            "Boil the rice and set aside. ",
            "Chop the spinach thin and fry until crisp. ",
            "Cut the Daikons lengthwise. If using dried Daikons soak in lukewarm water and squeeze. ",
            "Boil the carrot and then grate finely. ",
            "Soak the seaweed in lukewarm water and drain. ",
            "Cut the mushrooms into fine strips.",
            "Mix Soya, Mirin and sesame seeds to make a sauce. ",
            "Place rice in a bowl. Put spinach in a mountain over it. Then the Daikons, seaweed, mushroom and carrot. ",
            "Pour the sauce mixture over the rice around the vegetables. Serve hot."
        ],
        "cook_time": "1 Hour",
        "cuisine": "japanese"
    },
    {
        "name": "Chocolate Cake in a Pressure Cooker",
        "ingredients": [
            "1 cup flour  ",
            "1/4 cup cocoa powder  ",
            "1 1/4 tsp baking powder",
            "1/4 cup butter",
            "3/4 cup caster sugar",
            "1/4 cup water  ",
            "2 eggs  ",
            "1/2 tsp vanilla essence",
            "1/8 tsp salt  ",
            "6 inch round greased baking tin"
        ],
        "instructions": [
            "In a mixing bowl, sift the flour, cocoa powder and baking powder. ",
            "Add in the butter, sugar, salt, water and vanilla, and beat the ingredients using a whisk.     ",
            "Add the eggs and beat the batter until smooth. ",
            "Transfer into the baking tin.    ",
            "Heat the pressure cooker, covered with the lid but without the pressure, for 3-4 minutes on high heat, then place the cake tin in the empty cooker (do not add water in the cooker).     ",
            "Close the lid (without the pressure), lower the flame and let it cook until done (about 30 minutes)."
        ],
        "cook_time": "1 Hour",
        "cuisine": "japanese"
    },
    {
        "name": "Honey Chilli Potatoes",
        "ingredients": [
            "For the potatoes:",
            "2 potatoes, peeled and sliced",
            "3-4 Tbsp cornflour or maida",
            "Salt to taste",
            "1 tsp red chilli powder",
            "Oil, for deep frying",
            "For the base:",
            "1 tsp oil",
            "2 spring onions (with stalk), sliced",
            "1 Tbsp garlic paste",
            "1 capsicum, sliced",
            "2 Tbsp honey",
            "Salt, to taste",
            "1/4 tsp soya sauce",
            "3 tsp white sesame seeds",
            "2 tsp chilli sauce"
        ],
        "instructions": [
            "For the potatoes:",
            "In a bowl, add cornflour or maida, salt and red chilli powder.",
            "Add the sliced potatoes and mix well until the potatoes are coated.",
            "Heat oil in a wok and deep fry the potatoes until golden. Keep aside.",
            "For the Base:",
            "In a wok, add oil, garlic paste and spring onions. Saute on high heat for 1 minute.",
            "Add capsicum, honey, salt, soya sauce, chilli sauce. Saute for 2-3 minutes.",
            "Add the deep-fried potatoes and sesame seeds. Mix well and serve hot."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Vegetable Momos",
        "ingredients": [
            "For Dough:",
            "2 cups maida",
            "1/2 tsp salt ",
            "1/2 tsp baking powder   ",
            "For Filling: ",
            "1 cup carrots - grated ",
            "1 cup cabbage - grated ",
            "1 Tbsp oil ",
            "1/2 cup onion - finely chopped ",
            "1 tsp garlic - chopped  ",
            "1 tsp Soya sauce ",
            "Salt ",
            "1/4 tsp vinegar ",
            "1/4 tsp black pepper"
        ],
        "instructions": [
            "Mix the maida, salt and baking powder and knead to a stiff dough with water. ",
            "Heat oil and add the onion and garlic. ",
            "Saute over high heat and add the carrot and cabbage. Turn around over high heat till glossy. ",
            "Take it off the heat and mix in the Soya sauce, salt, vinegar and black pepper. ",
            "Roll the dough thin (translucent) and cut into 4\"-5\" rounds. ",
            "Take a round, wet edges and place some filling in the center. ",
            "Bring edges together to cover the filling. Twist to seal and fill the rest in the same way. ",
            "Steam for about 10 minutes and serve with soya sauce and chilli sauce."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Chole Bhature",
        "ingredients": [
            "For chole:",
            "2 cup chickpeas (channas)",
            "2 tsp oil",
            "1 bay leaf (tej patta)",
            "1 stick cinnamon (dalchini)",
            "3-4 cloves (laung)",
            "1 tsp whole pepper corns (sabut kali mirch)",
            "3 green cardamom  (choti elaichi)",
            "2 black cardamom (badi elaichi)",
            "1 tsp turmeric powder (haldi)",
            "1 tsp chili powder (lal mirch powder)",
            "1 tsp coriander powder (dhaniya powder)",
            "1 tsp cumin powder (zeera powder)",
            "1 tsp cumin seeds (zeera)",
            "1/2 tsp asafoetida (heeng)",
            "Salt to taste",
            "1 cup onions (chopped)",
            "1 cup tomatoes (chopped)",
            "1 tsp ginger (chopped)",
            "1 tsp garlic (chopped)",
            "1 tsp ajwain",
            "1 tsp lime juice",
            "1 green chili (chopped)                      1 tea bag                                                1 Tbsp butter",
            "For the bhaturas:",
            "2 cups maida (refined flour)",
            "1/2 tsp yeast, dissolved for 10 minutes in luke warm water",
            "1/2 cup whole wheat flour",
            "A pinch of salt",
            "Water to knead",
            "Oil for frying"
        ],
        "instructions": [
            "For chole:",
            "In a pan add oil, bay leaf, cinnamon, cumin seeds, cloves, whole pepper corns, green and black cardamom.",
            "After it gets brown add chopped onions and saute it.",
            "After sauteing add chopped ginger and garlic.",
            "Then add turmeric, chili powder, coriander powder, cumin powder, asafoetida, salt and fry well.",
            "For de glazing the pan add little water.",
            "Now add the chole (soaked overnight and pressure cooked) to the masala.",
            "After stirring well add tomatoes, little sugar and salt to the chole (chickpeas)",
            "Now add ajwain, chopped green chilies and water for the base.",
            "To get the color in the chole, add a tea bag to the masala.",
            "Simmer the chole gently for an hour and cover it.",
            "Add lime juice and a dollop of butter to it.",
            "Garnish the chole with coriander and butter.",
            "Serve the chole hot with bhaturas.",
            "For the bhaturas:",
            "Knead the whole wheat flour, maida and salt together with adequate amount of water.",
            "Sprinkle the yeast on top. Leave it for 2-3 hours for the yeast to work.",
            "Divide it into equal portions. Roll out in an oval or round shape.",
            "Deep fry till golden brown, like a puri.",
            "Serve. "
        ],
        "cook_time": "1 Hour",
        "cuisine": "japanese"
    },
    {
        "name": "Quick Chicken Curry",
        "ingredients": [
            "1 kg chicken",
            "3 large onions, paste",
            "2 large tomatoes, pureed",
            "1 Tbsp garlic paste",
            "1 Tbsp ginger paste",
            "2 tsp coriander powder",
            "2 tsp cumin powder",
            "1/2 tsp turmeric powder",
            "1/2 tsp red chilli powder",
            "1 tsp garam masala powder",
            "2 Tbsp oil",
            "Salt to taste",
            "Chopped coriander for garnish"
        ],
        "instructions": [
            "Heat oil in a pan and sauté the onion paste, garlic & ginger paste till golden brown.",
            "Add tomato puree. When the tomato puree dries up, add coriander powder, cumin powder, garam masala, red chilli powder, turmeric powder and salt. Let the spices cook.",
            "Add chicken pieces into the masala. Stir well and cook till they are golden brown.",
            "Add 1/2 cup of water and stir. Cover with a lid and let it simmer till the chicken is cooked.",
            "Garnish with chopped coriander and serve."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Butter Chicken",
        "ingredients": [
            "700 gm raw chicken  ",
            "For theMarinade:",
            "1 tsp red chilli powder ",
            "1 tsp ginger and garlic paste ",
            "Salt to taste ",
            "1/2 kg curd  ",
            "For theGravy:",
            "175 gm white butter ",
            "1/2 tsp black cumin seeds ",
            "1/2 kg tomato, pureed ",
            "1/2 tsp sugar ",
            "1 tsp red chilli powder ",
            "Salt to taste ",
            "100 gm fresh cream ",
            "4 green chillies, sliced",
            "1/2 tsp fenugreek leaves, crushed"
        ],
        "instructions": [
            "For marinating the chicken",
            "In a mixing bowl, mix red chilli powder, ginger garlic paste, salt and curd.  ",
            "Add the raw chicken pieces to the marinade and mix well. Keep it in the refrigerator overnight or minimum 6 hours.  ",
            "Roast the marinated chicken in a tandoor or an oven for about 10-12 minutes until it is three-fourth done.  ",
            "For the chicken gravy",
            "Heat half the quantity of white butter in pan. ",
            "Pour in the tomato puree, and saute for 2-3 minutes. Add cumin seeds, sugar, red chilli powder and salt. Mix well.  ",
            "Add the prepared chicken, white butter, fresh cream, sliced green chillies and crushed fenugreek leaves.  Saute for 3-4 minutes and let the chicken cook.",
            "Cook till chicken is done. Serve hot with rice or naan."
        ],
        "cook_time": "30 Minutes + Marination time (overnight)",
        "cuisine": "japanese"
    },
    {
        "name": "Cha Shu Broth",
        "ingredients": [
            "2kg pork bones from ribs",
            "2kg pork trotters",
            "2kg pork head (brain removed)",
            "650gm carrot",
            "500gm onion",
            "250gm leeks",
            "100gm garlic",
            "200gm ginger ",
            "1 stick kelp seaweed (konbu) ",
            "20ml soy sauce (light)",
            "15gm bonito flakes",
            "20 litres water"
        ],
        "instructions": [
            "Fill a large enough cooking pot with water and bring to boil.",
            "Switch off fire as soon as the water boils. Drop in the bones and let cool. This process will help you get rid of the blood and blood vessels easily.",
            "Drain the water off the bones in a large strainer and discard the water.",
            "Check and take off any blood or blood vessels from the bones and wash them under running water.",
            "Break all the bones in two with a hammer. Leave it to cool down for 30-40 minutes.",
            "Fill the pot again with clear water and place a wire mesh beneath and drop the bones inside. Bring to boil.",
            "Keep cooking over a strong fire and scoop out foam and unwanted matters coming up on the surface ",
            "As the bottom might get hotter than near the surface, stir with a large ladle from time to time.",
            "Continue to boil the broth for 24 hours, or until desired consistency and colour is reached, meat has completely separated and broken down in the broth. Add all vegetables one by one and further boil for 10 more hours. Optionally, you can stir every 1-2 hours just to check up on things and promote more churning. ",
            "Add water if the level gets too low. Once cooked to your liking, strain the broth, discarding the solids, and reserve broth by quickly chilling with ice.",
            "Retain the balance quantity by freezing it in food grade plastic bags and ones you wish to use again, simply cut open the plastic bag and dump the frozen stock lump in a cooking pot and place it over heat to melt/defrost .",
            "Flavour it with soy sauce and bonito flakes. "
        ],
        "cook_time": "1 hour ",
        "cuisine": "japanese"
    },
    {
        "name": "Japanese Soba Noodles",
        "ingredients": [
            "For the Noodles",
            "4/5 cup buckwheat flour",
            "1/5 cup wholewheat flour",
            "1/2 cup hot water",
            "A pinch of salt",
            "Starch or cornflour, for dusting",
            "For Stir-frying",
            "2 Tbsp teriyaki sauce",
            "2 onions, thinly sliced",
            "2 carrots, julienned",
            "2 Tbsp oil",
            "A few sprigs spring onions, chopped",
            "250 gm button mushrooms, roughly chopped",
            "Salt to taste"
        ],
        "instructions": [
            "For the Noodles",
            "Sift together the buckwheat, wheat flour and salt in a large mixing bowl. ",
            "Pour the water, a little at a time, and start rubbing the flours with your fingers. Work it well to bring it together to form a dough. Knead well, if it gets dry, add a little water and knead again.",
            "Cover with a moist kitchen towel and keep it in the refrigerator for 30 minutes.",
            "Take it out, and knead again. Divide into 4 balls, and dunk each ball in cornflour or starch before rolling it out. Use a big rolling pin, try to make the dough as thin as possible, but be careful as it may get a little crumbly and crack. A clever trick is to roll it as much as you can, then cut it into a rectangular sheet to remove the cracks. Keep sprinkling some corn flour to prevent it from sticking. ",
            "Layer all the rectangular sheets, making sure that you have sprinkled enough cornflour in between the layers. Using a large knife, carefully slice the dough to make thin strips.",
            "Bring a large saucepan of water to a boil and cook the noodles in small batches for 2 minutes. ",
            "Heat oil in a wok, and stir-fry the onions for 3-4 minutes until softened. Add the mushrooms and carrots and toss well.",
            "Add the noodles and teriyaki sauce and mix well. Let it cook for 2 minutes. ",
            "Season with salt and tip in the spring onions. Toss well and serve immediately."
        ],
        "cook_time": "1 Hour 30 minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Smoked Pumpkin Soup",
        "ingredients": [
            "1 kg yellow pumpkin",
            "Salt to taste",
            "20gm sugar",
            "20ml oil",
            "10gm smoke chips",
            "10gm butter (optional)",
            "20gm garlic (chopped)",
            "10gm pepper powder",
            "For the garnish",
            "20gm roasted pumpkin seeds",
            "A few sprigs water cress",
            ""
        ],
        "instructions": [
            "Peel and slice the pumpkin after washing it. Remove the seeds, and cut into cubes of even sizes. ",
            "Mix oil and garlic, and toss the pumpkin pieces in it to coat them well.",
            "In an oven tray, arrange the pumpkin pieces. Sprinkle the sugar and a little salt on top.",
            "Preheat the oven and bake the pumpkin at 160 degree Celsius till they are tender (depends on the size of the pumpkin, normally takes 10-15 minutes).",
            "Remove the tray from the oven and cool the pumpkin.",
            "For smoking the pumpkin ,arrange it in an inclosable chamber (may be a vessel  with loose fitting lid so that air can pass slightly).",
            "In a small metal bowl or dish, fire up some smoke chips. Put it in the above vessel and cover it with the lid. Leave it for 10 minutes so that the pumpkin can absorb the aroma.",
            "Remove the pumpkin pieces and puree them in a blender (add a bit of water if needed).",
            "Pour the pureed pumpkin in a pan and heat it on medium flame. Add butter and pepper powder. Adjust seasoning if required.",
            "Serve hot in individual soup bowl garnished with cress and pumpkin seeds."
        ],
        "cook_time": "45 minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Crispy Shrimp Tempura with Jalapeno and Onion Salsa",
        "ingredients": [
            "Half sheet size of nori wrapper",
            "2 medium size shrimp",
            "15 gm chopped Jalapeno ",
            "15 gm chopped onion",
            "10 gm iceberg lettuce",
            "100 gm sushi  rice",
            "10 gm flying fish roe"
        ],
        "instructions": [
            "In a sushi mat, place the nori wrapper and then spread the sushi rice until all the nori is covered with rice evenly. ",
            "Now arrange all the ingredients inside. ",
            "Roll and cut it to 6 pieces. ",
            "Then add flying fish roe on the top of each roll. ",
            "Serve with wasabi, pickled ginger and soya sauce.",
            ""
        ],
        "cook_time": "25 Minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Chicken Balls in Yakitori Sauce",
        "ingredients": [
            "For the chicken balls:",
            "1 kg chicken mince (chicken legs with skin)",
            "100 gm carrots, finely chopped",
            "20 mushrooms, finely chopped",
            "1 onion, chopped",
            "5 gm lemon rind, grated",
            "1 egg white",
            "100 ml soya",
            "50 ml mirin",
            "50 ml sake",
            "5 gm black sesame seeds",
            "Honduchi, pinch (optional)",
            "1/2 tsp oil, to grill the chicken balls",
            "For the yakitori sauce:900 ml soya sauce",
            "900 ml mirin",
            "450 ml cooking sake",
            "350 gm sugar, granulated",
            "75 gm ginger, peeled",
            "500 gm chicken bones",
            "1 green apple",
            "50 gm celery",
            "100 gm carrots",
            "20 gm cornflour",
            "You will need:",
            "Skewers soaked in water overnight"
        ],
        "instructions": [
            "For the chicken balls:",
            "In the chicken mince add chopped onions, carrots, mushrooms and lemon rind.",
            "Mix in the egg whites (mix with hands). Add soya, mirin, sake and sesame seeds.",
            "Press with hands and make small balls out of this mixture.",
            "Steam for eight minutes and skewer on to wooden bamboo sticks.",
            "Grill with 1/2 tsp oil.",
            "Dip in yakitori sauce and serve.",
            "For the sauce:",
            "Take a thick bottomed pan and boil the mirin. When boiling, flame it till all alcohol burns off.",
            "Mix soya, sugar, sake and add to the reduced mirin.",
            "Cut the ginger, carrots, apple, celery into 1 inch cubes and throw in sauce.",
            "Blanch the chicken bones in boiling water and add to sauce.",
            "Cook 1 hour and thicken with cornflour."
        ],
        "cook_time": "1 Hour 45 Minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Broccoli Soup with Wasabi",
        "ingredients": [
            "1 onion, chopped ",
            "Olive oil",
            "1/2 garlic, chopped fine",
            "1 bowl of broccoli, chopped",
            "1/2 tsp wasabi",
            "Some cheese (here the chef as used blue stilton cheese)",
            "1/2 cup cream",
            "1 potato, chopped into small cubes",
            "1 tsp butter",
            "1 apple, chopped",
            "Red chilly flakes"
        ],
        "instructions": [
            "Heat some olive oil in a pan and fry the onions. Now toss in the garlic.",
            "Throw in the broccoli now.",
            "Add some water to this which will help the broccoli cook.",
            "Halfway through add the wasabi and some cheese.",
            "Mix well. Now add the cream.",
            "Add this mixture to a blender and blend well. Keep aside.",
            "Now in another add some oilve oil and fry the potatoes till they become nice and brown.",
            "Once done, drain of all oil and seaon the potatoes with some salt. Keep aside",
            "Now for the apple compote, heat some butter in a pan, add the chopped apple and a pinch of sugar.",
            "Let it simmer till the apple becomes gooey and brown.",
            "Pour out the soup in a bowl garnish with the fried potatoes and red chilly flakes.",
            "Serve with the apple compote."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Candied Sweet Potatoes with Black Sesame",
        "ingredients": [
            "1 cup sweet potato, peeled and diced",
            "Oil to fry",
            "2 Tbsp black sesame seeds",
            "Fruit slices, to garnish",
            "For the sugar syrup / soy caramel:1 Tbsp soy",
            "3 Tbsp water",
            "1/3 cup sugar"
        ],
        "instructions": [
            "In a pan add oil and fry the sweet potato cubes till golden brown. Drain on absorbent paper.",
            "In a deep bottomed pan add soy sauce, water and sugar. Cook till sugar melts. Keep stirring continuously till the syrup is light brown in color (Resembles the color of caramel).",
            "Add the fried sweet potatoes. Cook till well coated.",
            "Add the black sesame seeds. Toss well.",
            "Garnish with some kiwi slices or any fruit of your choice. Serve."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Wasabi Aloo Tikki",
        "ingredients": [
            "For the aloo tikkis:",
            "Half aubergine, thinly sliced",
            "2 tomatoes",
            "5 potatoes, boiled",
            "Olive oil",
            "Salt and pepper",
            "1 tsp butter, melted",
            "2 tsp wasabi",
            "1 egg, beaten",
            "1 cup breadcrumbs (Here Japanese rice breadcrumbs have been used but you can use regular breadcrumbs too)",
            "For the sweet chilly sauce:",
            "2 Tbsp honey",
            "2 Tbsp fish sauce",
            "1 lemon juice",
            "2 chopped green chillies",
            "1 chopped red chilli"
        ],
        "instructions": [
            "Marinate the aubergine slices in some olive oil, salt pepper and bake in the oven for about 10 minutes at 140 degrees.",
            "Make a slight incision in both the tomatoes and place them in boiling water for only 15 seconds. Once done, place them in some ice cold water.",
            "Peel the skin of the tomatoes and slice them.",
            "Drizzle some olive oil, salt pepper over the tomatoes and bake for about 5-7 minutes at 140 degrees.",
            "Mash the potatoes. Add salt, pepper, butter and wasabi to it. Mix all together.",
            "Mix in the egg to the mashed potatoes. Reserve some of the beaten egg to caot the tikkis later.",
            "Make round tikkis (flattened round balls) with the potatoes. ",
            "Brush the tikkis with some egg (you reserved earlier) and then wrap these tikkis in the bread crumbs.",
            "Deep fry the tikkis in oil till golden brown.",
            "Once done wrap them with the baked aubergine slices and place the tomatoes over it.",
            "You can serve this with a sweet chilli sauce."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "japanese"
    },
    {
        "name": "California Sushi Rolls",
        "ingredients": [
            "1 sheet of nori (seaweed) cut into half",
            "110 gram cooked sushi rice",
            "2 slices avocado",
            "15 gram fresh crab meat or crab stick grated",
            "Tobiko (Japanese caviar) if you can get otherwise you can use black Japanese sesame seeds",
            "You will also need: ",
            "A sushi rolling mat",
            "A damp cotton napkin",
            "A sharp knife"
        ],
        "instructions": [
            "Prepare the damp napkin as in picture. Place 1/2 sheet of nori (Right: The pic only has a quarter).Please cut half shiny side down on the center of the damp napkin \n(horizontal lines on the sheet should face you.) Now spread the sushi \nrice on the sheet with damp fingers evenly.Spread the tobiko over the rice and flip the sheet so rice is on the other side and the sheet is facing you with its horiziontal lines.Place avocado in center and line with crab meat. Take the bottom edge of\n the sheet with both fingers on each side and roll over the top of crab \nand avocado leaving about 1 cm of nori protruding out.roll again so the \njoint is now at the bottom.Place the entire roll back on the center of the napkin and roll the napkin from the bottom edge over the roll.Place the top half of rolling mat over the napkin and roll. Using the \nthumb and middle finger, pinch sides of roll while applying even \npressure over the top of the roll with the index fingers.While \nlifting both the mat and napkin up by the corner, gently roll the roll \nthrough a 1/4 turn so it is lying on its next side, replace napkin and \nmat and repeat the pinching process as described earlier.Remove mat and unfold napkin and replace roll in center again. Cut roll \nin half with a slightly damp sharp knife with a sawing action.Line up two halves and cut again into three pieces of equal size leaving you with six equal size portions.  Serve the California roll with wasabi, soya and ginger. Enjoy.Tips:Never put the sushi rice in the fridge.You will ruin the consistency.Always try consuming sushi on the same day.Always wet you hands slightly while handling sushi rice or it will stick to your hand.As you get better,experiment with your own choice of interesting fillings.This sushi tastes great if topped with a small dollop of chilli mayo (1 tablespoon mayo mixed with 1.4 tsp of chilli garlic sauce)",
            "Prepare the damp napkin as in picture. ",
            "",
            "Place 1/2 sheet of nori (Right: The pic only has a quarter).",
            "",
            "Please cut half shiny side down on the center of the damp napkin \n(horizontal lines on the sheet should face you.) Now spread the sushi \nrice on the sheet with damp fingers evenly.",
            "",
            "Spread the tobiko over the rice and flip the sheet so rice is on the other side and the sheet is facing you with its horiziontal lines.",
            "",
            "Place avocado in center and line with crab meat. Take the bottom edge of\n the sheet with both fingers on each side and roll over the top of crab \nand avocado leaving about 1 cm of nori protruding out.roll again so the \njoint is now at the bottom.",
            "",
            "Place the entire roll back on the center of the napkin and roll the napkin from the bottom edge over the roll.",
            "",
            "",
            "Remove mat and unfold napkin and replace roll in center again. Cut roll \nin half with a slightly damp sharp knife with a sawing action.",
            "Line up two halves and cut again into three pieces of equal size leaving you with six equal size portions.  Serve the California roll with wasabi, soya and ginger. Enjoy.",
            "Tips:Never put the sushi rice in the fridge.You will ruin the consistency.",
            "Always try consuming sushi on the same day.",
            "Always wet you hands slightly while handling sushi rice or it will stick to your hand.",
            "As you get better,experiment with your own choice of interesting fillings.",
            "This sushi tastes great if topped with a small dollop of chilli mayo (1 tablespoon mayo mixed with 1.4 tsp of chilli garlic sauce)",
            ""
        ],
        "cook_time": "30 Minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Sushi Rice",
        "ingredients": [
            "180 gm of sushi rice",
            "2 tsp castor sugar",
            "1/2 teaspoon salt",
            "45 ml vinegar"
        ],
        "instructions": [
            "Wash 180 gm of rice at least 10 times to get the water to be clear.",
            "Now leave in pot of 20 mins. The rice will fluff up a bit.",
            "Put the rice along with equal amount of water eg 1 cup rice and 1 cup water (cold) in a deep pot with a transparent cover if possible. Turn on full heat. Put the lid on the pot and leave until the rice starts to boil.",
            "When it starts boiling, turn down the heat and simmer until water has boiled away.",
            "Now turn of the heat and let the rice steam for 15 to 20 mins.",
            "Put the rice in a deep bowl and mix with salt sugar and vinegar. Mix with a wooden spatula as if you are slicing the rice rather than mixing it in a circular motion. Keep fanning the rice if possible till cool.",
            "Tips:",
            "Never put the sushi rice in the fridge.you will ruin the consistency.",
            "Always try consuming sushi on the same day.",
            "Always wet you hands slightly while handling sushi rice or it will stick to your hand."
        ],
        "cook_time": "45 Minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Zen Soup",
        "ingredients": [
            "1 Tbsp sesame oil",
            "3-4 chopped or diced button mushrooms",
            "1/2 a medium bottle gourd, chopped",
            "1 small carrot, thinly sliced",
            "4 baby corn, sliced",
            "1/2 red and yellow bell peppers, chopped into cubes",
            "1/2 a bok choy, chopped",
            "2 shallots/madras onions, chopped",
            "2 small eggplants, sliced",
            "2-3 small onions, chopped",
            "3-4 shitake or oyster mushrooms, chopped",
            "1 Tbsp red curry paste",
            "1 tsp curry powder or according to taste",
            "1 Tbsp light soy sauce",
            "1 tsp dark soy sauce",
            "1 Tbsp brown sugar",
            "150 ml coconut milk",
            "1/2 cup water",
            "Juice of 1 lemon",
            "2 cups fresh Chinese wheat based noodles or about 3 oz dried thin wheat based noodles",
            "Toppings and garnishes:",
            "1 cup bean sprouts / chowli sprouts",
            "Chopped coriander leaves for garnish",
            "Chopped spring onion for garnish",
            "Crushed peanuts for garnish",
            ""
        ],
        "instructions": [
            "Heat a large wok with oil. Add button mushroom, eggplant, bell peppers, shallots bottle gourd, baby corn and carrot and cook on high for about 2 minutes. ",
            "Then add curry paste and curry powder. Toss to coat the vegetables. Add light soy sauce and cook about 30 seconds so the vegetables absorb the liquid. ",
            "Then add dark soy sauce, brown sugar, lime juice and coconut milk. Let the curry simmer for about 2 minutes. Add salt to taste.",
            "Add chopped coriander and mix all the ingredients well. Slowly pour the in the coconut milk and let it simmer for a few minutes. Do not boil.",
            "Lastly add the bok choy.",
            "Then pour in water and bring back to a simmer. Taste curry and adjust soy sauce, and sugar to taste. ",
            "Bring a large pot full of water to boil noodles. If using dried noodles, cook in boiling water till noodles are very al dente. No matter what noodles you use, make sure not to overcook them. ",
            "Drain well.",
            "Add cooked noodles and bean sprouts to the curry broth. ",
            "Serve the noodle soup with crushed peanuts, scallions, chopped coriander and bean sprouts."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Tonkatsu",
        "ingredients": [
            "4 pork chops",
            "1/2 tsp salt",
            "1/4 tsp pepper",
            "1/4 cup flour",
            "1 egg",
            "1/2 cup panko bread crumbs",
            "Vegetable oil - for frying"
        ],
        "instructions": [
            "Cut the edges of the pork chops. Sprinkle salt and pepper on the pork.",
            "Put flour lightly on the pork. Dip the pork in beaten egg. Put panko on the pork and pat them well.",
            "Deep fry the pork for a few min. Turn over the pork chops and fry for a few more minutes.",
            "Take out the pork and put them on a paper towel to drain the oil.",
            "Cut each tonkatsu into small pieces. Serve Hot."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Teriyaki Pineapple with Raw Mango Slaw",
        "ingredients": [
            "1 pineapple, whole",
            "100 gms of bok choy leaves",
            "1 1/2 Tbsp teriyaki sauce",
            "2 1/2 tsp light soya sauce",
            "1 tsp of sesame oil ",
            "6 tsp of vegetable oil",
            "30 - 35 gm of daikon (pickled radish), cut into thin long strips",
            "30 gm of raw mango, cut into strips",
            "100 gm of ripe papaya, diced",
            "1 tsp of Japanese Kobe mustard",
            "Juice of 1 lime",
            "1 tsp of butter",
            "1/2 tsp of brown sugar",
            "1/2 tsp of lime zest",
            "Salt and pepper to taste"
        ],
        "instructions": [
            "Peel and slice the pineapple into 2- 4 pieces.",
            "Marinate two slices of pineapple with teriyaki sauce, 1 teaspoon of soya sauce, 1 tsp of sesame oil and 1 tsp of vegetable oil and salt. Rest it for 10 minutes.",
            "Then put the marinated pineapple slices onto the grill.",
            "Keep turning the pineapples on the grill and baste them with a little vegetable oil.",
            "Once the pineapple slices have relatively softened and have dark brown grill marks, take them off the grill.",
            "For the Mango Slaw:",
            "Slice up the daikon radish and green mango into thin long strips and season them with salt and black pepper.",
            "To the seasoned daikons and green mangoes, add ½ a teaspoon of light soya sauce, chopped coriander leaves and 1 tsp of vegetable oil. Mix them altogether and refrigerate for about 15 mins. ",
            "In a mixer, add the diced papaya, Kobe mustard, 2 tsps of vegetable oil and lime juice. Blend it well to make a thick papaya sauce.",
            "For the Bok Choy:",
            "Heat 1 teaspoon of vegetable oil in a pan with butter.",
            "Add a pinch of brown sugar, bok choy, a touch of light soy, juice of ½ a lime and a little lime zest. Toss well till the bok choy  gets a nice glaze.",
            "Season with salt and stir well.",
            "For Plating:",
            "Transfer the grilled pineapple slices onto a serving plate. ",
            "Arrange sauteed Bok Choy over the slices along with the raw mango slaw.",
            "Spoon the luscious papaya and mustard puree.",
            "Serve Hot."
        ],
        "cook_time": "1 Hour",
        "cuisine": "japanese"
    },
    {
        "name": "Udon Noodles Salad",
        "ingredients": [
            "100 gms udon noodles ",
            "1/2 medium raddish",
            "1/2 zucchini",
            "1/2 yellow squash",
            "1/2 cucumber",
            "1/2 bell pepper",
            "3 soaked shitake mushrooms",
            "1/2 carrot",
            "1/2 medium spring onion or scallion",
            "1 tsp light soy sauce",
            "1 tsp rice vinegar",
            "1 tsp vegetarian oyster sauce",
            "1/2 tsp sushi vinegar",
            "2 Tbsp vegetable oil"
        ],
        "instructions": [
            "Cook udon noodles in boiling water for 5 minutes. ",
            "Drain out the water. ",
            "Rest the noodles in a bowl.",
            "Use a spaghetti peeler to peel cucumber, yellow squash, medium size radish, carrot, a scallion and shitake mushrooms, half a red bell pepper finely chopped; add all the veggies to the bowl. ",
            "Mix well.  ",
            "For the vinaigrette (oriental inspired vinaigrette): a tablespoon of sushi vinegar, 1 teaspoon of light soy sauce, 1 teaspoon of vegetarian oyster sauce, 2 tablespoons of vegetable oil, give it a mix. ",
            "Season with salt to taste. ",
            "Add the udon noodles to the veggies, and mix with the vinaigrette. ",
            "A few sprigs of coriander. ",
            "Mix with the veggies. ",
            "Serve on a flat plate."
        ],
        "cook_time": "20 Minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Teriyaki Vegetables",
        "ingredients": [
            "½ each bell peppers yellow, red and green",
            "1 cup mushrooms",
            "½ zucchini",
            "½ yellow squash",
            "2-3 garlic cloves",
            "2-3 pieces ginger",
            "1 onion",
            "½ tsp sesame oil",
            "1-2 tsp teriyaki sauce",
            "1 malta orange",
            "1 lemon",
            "1 tbsp orange juice",
            "1 chilly",
            "1 tsp light soya sauce"
        ],
        "instructions": [
            "Add teriyaki sauce, sesame oil, ginger, cracked black pepper, orange juice, lemon zest, season with salt, one chilli,1 teaspoon of light soya sauce, mix all in the grinder. ",
            "Pour the marinade into a glass bowl. ",
            "Marinate all the vegetables:  mushrooms, bell peppers, zucchini, and yellow squash, add some cracked black pepper on the top and mix well.  ",
            "Finally put the veggies on to the skewers. ",
            "Preheat the grill; place the skewers on to the grill. ",
            "For the basting of the skewers: after a while turn over the skewers, brush some marinade over the vegetables on the skewers and place on the grill."
        ],
        "cook_time": "1 hour",
        "cuisine": "japanese"
    },
    {
        "name": "Radish Soup with Tofu Miso Cream",
        "ingredients": [
            "2 medium radishes peeled",
            "1 stalk spring onion with greens",
            "1 Tbsp vegetable oil",
            "20 gm minced leeks",
            "20 gm minced celery",
            "1 tsp grated ginger",
            "1/2 liter stock",
            "Juice of 1/2 an orange",
            "1 big Tbsp miso paste",
            "1 bunch chopped spinach leaves",
            "1 tsp light soya sauce",
            "For the Cream:",
            "50 gm tofu",
            "1 tsp miso (A Japanese seasoning)",
            "1 Tbsp honey",
            "Juice of 1/2 an orange",
            "1 tsp orange zest",
            "1 big pinch togarashi pepper (A Japenese condiment, you can substitute with red chilli pepper)",
            "Garnish: ",
            "1 handful of bean sprouts"
        ],
        "instructions": [
            "Heat oil in a pan, sauté radishes, radish leaves, spring onion greens, and sauté.",
            "Add minced celery and leeks and give it a nice mix.",
            "Add the grated ginger.",
            "Deglaze with orange juice. ",
            "Add one big spoon of miso paste. ",
            "Give a nice stir, and then add the vegetable stock.",
            "Bring to a steady simmer.",
            "Enhance with orange zest.",
            "For the Tofu Miso Cream:",
            "In a mixer add tofu, orange juice, honey, 1 tbsp of the soup and blend till nice and luscious.",
            "Mix the tofu miso cream with the soup.",
            "Add spinach leaves, soya sauce, togarashi peppers, a pinch of salt and bring to a boil.",
            "Serve in a nice bowl.",
            "Garnish with bean sprouts."
        ],
        "cook_time": "1 Hour",
        "cuisine": "japanese"
    },
    {
        "name": "Negima",
        "ingredients": [
            "200 gm chicken breast ",
            "200 gm leeks or spring onions ",
            "2 tsp grated ginger   ",
            "1/2 tsp aasabi or white radish     ",
            "Ginger Soya Dip:",
            "1 tsp ginger juice ",
            "1 Tbsp Japanese Soya Sauce ",
            "1/2 tbsp Mirin ",
            "NOTE: (If Mirin is not available, use Sherry or any other dry white wine)"
        ],
        "instructions": [
            "Cut the chicken breast into small, bite size pieces. ",
            "Cut leeks/spring onion into 1\" long pieces.  ",
            "Marinate chicken and leeks with ginger, wasabi and salt for 15 minutes. ",
            "Skewer the chicken and leek together.  ",
            "For the Sauce:",
            "Mix all the ingredients, let the flavors blend for 15 minutes and strain.  ",
            "Grill the skewers on moderately hot charcoal fire.  Serve hot with Ginger Soya dip."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Ishi Yaki",
        "ingredients": [
            "1/2 cup short grain rice ",
            "1/4 cup spinach ",
            "1/4 cup daikons (Japanese horse radish) ",
            "1 carrot ",
            "1/4 cup seaweed ",
            "2 shitake mushrooms ",
            "1/4 cup soya sauce ",
            "2 Tbsp Mirin (a condiment used in japanese cuisine. A type of rice wine)",
            "2 Tbsp roasted sesame seeds"
        ],
        "instructions": [
            "Wash the rice and drain the cloudy water. Do this thrice then gently grind the rice against the palm of your hand. ",
            "Let the rice stand in a colander for thirty minutes. ",
            "Boil the rice and set aside. ",
            "Chop the spinach thin and fry until crisp. ",
            "Cut the Daikons lengthwise. If using dried Daikons soak in lukewarm water and squeeze. ",
            "Boil the carrot and then grate finely. ",
            "Soak the seaweed in lukewarm water and drain. ",
            "Cut the mushrooms into fine strips.",
            "Mix Soya, Mirin and sesame seeds to make a sauce. ",
            "Place rice in a bowl. Put spinach in a mountain over it. Then the Daikons, seaweed, mushroom and carrot. ",
            "Pour the sauce mixture over the rice around the vegetables. Serve hot."
        ],
        "cook_time": "1 Hour",
        "cuisine": "japanese"
    },
    {
        "name": "Chocolate Cake in a Pressure Cooker",
        "ingredients": [
            "1 cup flour  ",
            "1/4 cup cocoa powder  ",
            "1 1/4 tsp baking powder",
            "1/4 cup butter",
            "3/4 cup caster sugar",
            "1/4 cup water  ",
            "2 eggs  ",
            "1/2 tsp vanilla essence",
            "1/8 tsp salt  ",
            "6 inch round greased baking tin"
        ],
        "instructions": [
            "In a mixing bowl, sift the flour, cocoa powder and baking powder. ",
            "Add in the butter, sugar, salt, water and vanilla, and beat the ingredients using a whisk.     ",
            "Add the eggs and beat the batter until smooth. ",
            "Transfer into the baking tin.    ",
            "Heat the pressure cooker, covered with the lid but without the pressure, for 3-4 minutes on high heat, then place the cake tin in the empty cooker (do not add water in the cooker).     ",
            "Close the lid (without the pressure), lower the flame and let it cook until done (about 30 minutes)."
        ],
        "cook_time": "1 Hour",
        "cuisine": "japanese"
    },
    {
        "name": "Honey Chilli Potatoes",
        "ingredients": [
            "For the potatoes:",
            "2 potatoes, peeled and sliced",
            "3-4 Tbsp cornflour or maida",
            "Salt to taste",
            "1 tsp red chilli powder",
            "Oil, for deep frying",
            "For the base:",
            "1 tsp oil",
            "2 spring onions (with stalk), sliced",
            "1 Tbsp garlic paste",
            "1 capsicum, sliced",
            "2 Tbsp honey",
            "Salt, to taste",
            "1/4 tsp soya sauce",
            "3 tsp white sesame seeds",
            "2 tsp chilli sauce"
        ],
        "instructions": [
            "For the potatoes:",
            "In a bowl, add cornflour or maida, salt and red chilli powder.",
            "Add the sliced potatoes and mix well until the potatoes are coated.",
            "Heat oil in a wok and deep fry the potatoes until golden. Keep aside.",
            "For the Base:",
            "In a wok, add oil, garlic paste and spring onions. Saute on high heat for 1 minute.",
            "Add capsicum, honey, salt, soya sauce, chilli sauce. Saute for 2-3 minutes.",
            "Add the deep-fried potatoes and sesame seeds. Mix well and serve hot."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Vegetable Momos",
        "ingredients": [
            "For Dough:",
            "2 cups maida",
            "1/2 tsp salt ",
            "1/2 tsp baking powder   ",
            "For Filling: ",
            "1 cup carrots - grated ",
            "1 cup cabbage - grated ",
            "1 Tbsp oil ",
            "1/2 cup onion - finely chopped ",
            "1 tsp garlic - chopped  ",
            "1 tsp Soya sauce ",
            "Salt ",
            "1/4 tsp vinegar ",
            "1/4 tsp black pepper"
        ],
        "instructions": [
            "Mix the maida, salt and baking powder and knead to a stiff dough with water. ",
            "Heat oil and add the onion and garlic. ",
            "Saute over high heat and add the carrot and cabbage. Turn around over high heat till glossy. ",
            "Take it off the heat and mix in the Soya sauce, salt, vinegar and black pepper. ",
            "Roll the dough thin (translucent) and cut into 4\"-5\" rounds. ",
            "Take a round, wet edges and place some filling in the center. ",
            "Bring edges together to cover the filling. Twist to seal and fill the rest in the same way. ",
            "Steam for about 10 minutes and serve with soya sauce and chilli sauce."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Chole Bhature",
        "ingredients": [
            "For chole:",
            "2 cup chickpeas (channas)",
            "2 tsp oil",
            "1 bay leaf (tej patta)",
            "1 stick cinnamon (dalchini)",
            "3-4 cloves (laung)",
            "1 tsp whole pepper corns (sabut kali mirch)",
            "3 green cardamom  (choti elaichi)",
            "2 black cardamom (badi elaichi)",
            "1 tsp turmeric powder (haldi)",
            "1 tsp chili powder (lal mirch powder)",
            "1 tsp coriander powder (dhaniya powder)",
            "1 tsp cumin powder (zeera powder)",
            "1 tsp cumin seeds (zeera)",
            "1/2 tsp asafoetida (heeng)",
            "Salt to taste",
            "1 cup onions (chopped)",
            "1 cup tomatoes (chopped)",
            "1 tsp ginger (chopped)",
            "1 tsp garlic (chopped)",
            "1 tsp ajwain",
            "1 tsp lime juice",
            "1 green chili (chopped)                      1 tea bag                                                1 Tbsp butter",
            "For the bhaturas:",
            "2 cups maida (refined flour)",
            "1/2 tsp yeast, dissolved for 10 minutes in luke warm water",
            "1/2 cup whole wheat flour",
            "A pinch of salt",
            "Water to knead",
            "Oil for frying"
        ],
        "instructions": [
            "For chole:",
            "In a pan add oil, bay leaf, cinnamon, cumin seeds, cloves, whole pepper corns, green and black cardamom.",
            "After it gets brown add chopped onions and saute it.",
            "After sauteing add chopped ginger and garlic.",
            "Then add turmeric, chili powder, coriander powder, cumin powder, asafoetida, salt and fry well.",
            "For de glazing the pan add little water.",
            "Now add the chole (soaked overnight and pressure cooked) to the masala.",
            "After stirring well add tomatoes, little sugar and salt to the chole (chickpeas)",
            "Now add ajwain, chopped green chilies and water for the base.",
            "To get the color in the chole, add a tea bag to the masala.",
            "Simmer the chole gently for an hour and cover it.",
            "Add lime juice and a dollop of butter to it.",
            "Garnish the chole with coriander and butter.",
            "Serve the chole hot with bhaturas.",
            "For the bhaturas:",
            "Knead the whole wheat flour, maida and salt together with adequate amount of water.",
            "Sprinkle the yeast on top. Leave it for 2-3 hours for the yeast to work.",
            "Divide it into equal portions. Roll out in an oval or round shape.",
            "Deep fry till golden brown, like a puri.",
            "Serve. "
        ],
        "cook_time": "1 Hour",
        "cuisine": "japanese"
    },
    {
        "name": "Quick Chicken Curry",
        "ingredients": [
            "1 kg chicken",
            "3 large onions, paste",
            "2 large tomatoes, pureed",
            "1 Tbsp garlic paste",
            "1 Tbsp ginger paste",
            "2 tsp coriander powder",
            "2 tsp cumin powder",
            "1/2 tsp turmeric powder",
            "1/2 tsp red chilli powder",
            "1 tsp garam masala powder",
            "2 Tbsp oil",
            "Salt to taste",
            "Chopped coriander for garnish"
        ],
        "instructions": [
            "Heat oil in a pan and sauté the onion paste, garlic & ginger paste till golden brown.",
            "Add tomato puree. When the tomato puree dries up, add coriander powder, cumin powder, garam masala, red chilli powder, turmeric powder and salt. Let the spices cook.",
            "Add chicken pieces into the masala. Stir well and cook till they are golden brown.",
            "Add 1/2 cup of water and stir. Cover with a lid and let it simmer till the chicken is cooked.",
            "Garnish with chopped coriander and serve."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Butter Chicken",
        "ingredients": [
            "700 gm raw chicken  ",
            "For theMarinade:",
            "1 tsp red chilli powder ",
            "1 tsp ginger and garlic paste ",
            "Salt to taste ",
            "1/2 kg curd  ",
            "For theGravy:",
            "175 gm white butter ",
            "1/2 tsp black cumin seeds ",
            "1/2 kg tomato, pureed ",
            "1/2 tsp sugar ",
            "1 tsp red chilli powder ",
            "Salt to taste ",
            "100 gm fresh cream ",
            "4 green chillies, sliced",
            "1/2 tsp fenugreek leaves, crushed"
        ],
        "instructions": [
            "For marinating the chicken",
            "In a mixing bowl, mix red chilli powder, ginger garlic paste, salt and curd.  ",
            "Add the raw chicken pieces to the marinade and mix well. Keep it in the refrigerator overnight or minimum 6 hours.  ",
            "Roast the marinated chicken in a tandoor or an oven for about 10-12 minutes until it is three-fourth done.  ",
            "For the chicken gravy",
            "Heat half the quantity of white butter in pan. ",
            "Pour in the tomato puree, and saute for 2-3 minutes. Add cumin seeds, sugar, red chilli powder and salt. Mix well.  ",
            "Add the prepared chicken, white butter, fresh cream, sliced green chillies and crushed fenugreek leaves.  Saute for 3-4 minutes and let the chicken cook.",
            "Cook till chicken is done. Serve hot with rice or naan."
        ],
        "cook_time": "30 Minutes + Marination time (overnight)",
        "cuisine": "japanese"
    },
    {
        "name": "Miso Soup",
        "ingredients": [
            "2 cups water",
            "1 vegetable stock cube",
            "2 Tbsp miso paste",
            "6 cubes of tofu",
            "A handful of seaweed (or spinach)"
        ],
        "instructions": [
            "Bring water to a boil and dissolve the stock cube in it.",
            "Add the miso and stir until dissolved.",
            "Put in tofu and seaweed.",
            "Boil for a few minutes until the seaweed expands.",
            "Serve."
        ],
        "cook_time": "20 Minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Spicy Maguro Maki",
        "ingredients": [
            "50 gm tuna-grilled and diced  ",
            "1 sheet of yaki-nori or roasted seaweeds  ",
            "1/4 cup short grain Japanese rice-cooked and mixed with vinegar, sugar and kombu seaweed  ",
            "1 tsp chopped spring onion  ",
            "1 tsp spicy sauce      ",
            "Condiments",
            "2 tsp marinated ginger  ",
            "1 tsp wasabi   ",
            "1 tsp soya sauce"
        ],
        "instructions": [
            "Place yaki-nori sheet on the bamboo mat and cover it with the rice. ",
            "Sprinkle the spring onion on top.     ",
            "Now, pick it by the corners and quickly turn it over, so as to place it upside down.  ",
            "Spread spicy sauce over it and then add tuna. ",
            "Lift the edges of the bamboo mat and roll it back and forth to seal the edges of yaki-nori.   ",
            "Finally, slice the prepared roll into equal sizes and serve with wasabi and soya sauce."
        ],
        "cook_time": "30 Mins",
        "cuisine": "japanese"
    },
    {
        "name": "Oriental Fish",
        "ingredients": [
            "750 gm piece of skinned, cleaned fish    ",
            "2 Tbsp spring onion paste    ",
            "2 tsp ginger paste    ",
            "2 tsp garlic paste    ",
            "Juice 2 lemons    ",
            "Salt     ",
            "Sauce",
            "1 Tbsp carrot strips    ",
            "1 Tbsp capsicum strips    ",
            "1 Tbsp onions shreds    ",
            "1 Tbsp cucumber strips    ",
            "1 Tbsp pineapple strips    ",
            "2 Tbsp soya sauce    ",
            "2 Tbsp malt vinegar    ",
            "2 Tbsp grated jaggery    ",
            "2 Tbsp tomato ketchup    ",
            "2 tsp corn flour - mixed with  1 tbsp water    ",
            "200 ml water/ fish stock    ",
            "1 tsp coarsely ground black pepper"
        ],
        "instructions": [
            "Score fish on both sides. ",
            "Marinate for 1 hour in a mixture of spring   onion, ginger and garlic paste, salt and lemon juice.   ",
            "Steam fish for 20 minutes over hot water. Set aside.     ",
            "Boil together all the liquid sauce ingredients for 2-3 minutes.  ",
            "Add vegetables and pineapple to the pan and allow it to heat through.     ",
            "Pour sauce over the fish and serve immediately."
        ],
        "cook_time": "1 Hour 30 Minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Chicken Teriyaki",
        "ingredients": [
            "120 gm boneless chicken breasts ",
            "1/2 tsp garlic paste ",
            "1/2 tsp ginger paste ",
            "2 tbsp Teriyaki sauce ",
            "1 tbsp oil ",
            "1/2 tsp sesame (white til) seeds-roasted"
        ],
        "instructions": [
            "Cut the chicken into desired sized cubes. ",
            "Marinate the chicken, garlic, ginger and teriyaki sauce together for an hour or so.   ",
            "Heat the oil and add the chicken. ",
            "Sauté over high heat, till chicken is opaque.   ",
            "Add 1-2 tbsp water and let it come to a boil, then simmer over low heat, till chicken is tender, stirring a few times.   ",
            "Serve hot garnished with the sesame seeds."
        ],
        "cook_time": "1 hour 20 mins",
        "cuisine": "japanese"
    },
    {
        "name": "Yaki Soba Noodles",
        "ingredients": [
            "5 prawns ",
            "Vegetables - optional ",
            "100 gm soba noodles ",
            "2 Tbsp oil ",
            "2 Tbsp onion ",
            "2 Tbsp chopped chillies ",
            "2 Tbsp garlic ",
            "2 Tbsp bean sprouts and shitake mushrooms ",
            "1 egg ",
            "3 Tbsp Soya sauce"
        ],
        "instructions": [
            "Heat oil in a pan. ",
            "Fry the prawns. ",
            "Saute the vegetables with the noodles and then add egg. ",
            "Season with salt and pepper and soya sauce. ",
            "Arrange the vegetables with the prawns and serve."
        ],
        "cook_time": "20 mins",
        "cuisine": "japanese"
    },
    {
        "name": "Tempura Prawns",
        "ingredients": [
            "5-6 prawns ",
            "asparagus/bell pepper - optional ",
            "1/2 a bowl of Tempura flour/rice flour ",
            "ice water for the batter ",
            "a plate of dry flour for coating ",
            "oil for deep frying   ",
            "For the Tempura Sauce",
            "1/2 cup Soya sauce ",
            "4 tsp sugar ",
            "2 tsp mirin (optional)"
        ],
        "instructions": [
            "Take a bowl and mix the flour with the ice water. ",
            "Whisk it slowly till it becomes a liquid batter. ",
            "Heat oil in a deep pan on high heat. ",
            "Dip the prawns first in the dry flour then in the batter and fry them till golden brown. ",
            "For the sauce, pour the Soya sauce in a pan, add the sugar and mirin. ",
            "Bring the sauce to a boil. ",
            "Serve the prawns with the sauce."
        ],
        "cook_time": "30 mins",
        "cuisine": "japanese"
    },
    {
        "name": "Yakitori Skewer",
        "ingredients": [
            "220 gm meat (chicken or lamb) ",
            "2 Tbsp Soya sauce ",
            "A pinch of sugar ",
            "2 red onions ",
            "Oil  ",
            "1 tsp sesame seeds  ",
            "Pepper to taste  ",
            "For the sauce:",
            "1/2 cup Soya sauce ",
            "4 tsp sugar ",
            "2 tsp mirin (optional) ",
            "2 tbsp roasted sesame seeds"
        ],
        "instructions": [
            "Take the lamb or chicken meat in a bowl, add the Soya sauce and the sugar. Marinate and refrigerate for an hour. ",
            "Thread the meat and the chopped onions onto the skewer. ",
            "Pour a few drops of oil on the lamb and grill till done. ",
            "For the sauce: ",
            "Pour the Soya sauce in a pan, add the sugar and mirin. ",
            "Stir and add the sesame seeds. ",
            "Bring the sauce to a boil. ",
            "Garnish the lamb with roasted sesame seeds and serve with the sauce."
        ],
        "cook_time": "1 Hour 30 Minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Chocolate Cake in a Pressure Cooker",
        "ingredients": [
            "1 cup flour  ",
            "1/4 cup cocoa powder  ",
            "1 1/4 tsp baking powder",
            "1/4 cup butter",
            "3/4 cup caster sugar",
            "1/4 cup water  ",
            "2 eggs  ",
            "1/2 tsp vanilla essence",
            "1/8 tsp salt  ",
            "6 inch round greased baking tin"
        ],
        "instructions": [
            "In a mixing bowl, sift the flour, cocoa powder and baking powder. ",
            "Add in the butter, sugar, salt, water and vanilla, and beat the ingredients using a whisk.     ",
            "Add the eggs and beat the batter until smooth. ",
            "Transfer into the baking tin.    ",
            "Heat the pressure cooker, covered with the lid but without the pressure, for 3-4 minutes on high heat, then place the cake tin in the empty cooker (do not add water in the cooker).     ",
            "Close the lid (without the pressure), lower the flame and let it cook until done (about 30 minutes)."
        ],
        "cook_time": "1 Hour",
        "cuisine": "japanese"
    },
    {
        "name": "Honey Chilli Potatoes",
        "ingredients": [
            "For the potatoes:",
            "2 potatoes, peeled and sliced",
            "3-4 Tbsp cornflour or maida",
            "Salt to taste",
            "1 tsp red chilli powder",
            "Oil, for deep frying",
            "For the base:",
            "1 tsp oil",
            "2 spring onions (with stalk), sliced",
            "1 Tbsp garlic paste",
            "1 capsicum, sliced",
            "2 Tbsp honey",
            "Salt, to taste",
            "1/4 tsp soya sauce",
            "3 tsp white sesame seeds",
            "2 tsp chilli sauce"
        ],
        "instructions": [
            "For the potatoes:",
            "In a bowl, add cornflour or maida, salt and red chilli powder.",
            "Add the sliced potatoes and mix well until the potatoes are coated.",
            "Heat oil in a wok and deep fry the potatoes until golden. Keep aside.",
            "For the Base:",
            "In a wok, add oil, garlic paste and spring onions. Saute on high heat for 1 minute.",
            "Add capsicum, honey, salt, soya sauce, chilli sauce. Saute for 2-3 minutes.",
            "Add the deep-fried potatoes and sesame seeds. Mix well and serve hot."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Vegetable Momos",
        "ingredients": [
            "For Dough:",
            "2 cups maida",
            "1/2 tsp salt ",
            "1/2 tsp baking powder   ",
            "For Filling: ",
            "1 cup carrots - grated ",
            "1 cup cabbage - grated ",
            "1 Tbsp oil ",
            "1/2 cup onion - finely chopped ",
            "1 tsp garlic - chopped  ",
            "1 tsp Soya sauce ",
            "Salt ",
            "1/4 tsp vinegar ",
            "1/4 tsp black pepper"
        ],
        "instructions": [
            "Mix the maida, salt and baking powder and knead to a stiff dough with water. ",
            "Heat oil and add the onion and garlic. ",
            "Saute over high heat and add the carrot and cabbage. Turn around over high heat till glossy. ",
            "Take it off the heat and mix in the Soya sauce, salt, vinegar and black pepper. ",
            "Roll the dough thin (translucent) and cut into 4\"-5\" rounds. ",
            "Take a round, wet edges and place some filling in the center. ",
            "Bring edges together to cover the filling. Twist to seal and fill the rest in the same way. ",
            "Steam for about 10 minutes and serve with soya sauce and chilli sauce."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Chole Bhature",
        "ingredients": [
            "For chole:",
            "2 cup chickpeas (channas)",
            "2 tsp oil",
            "1 bay leaf (tej patta)",
            "1 stick cinnamon (dalchini)",
            "3-4 cloves (laung)",
            "1 tsp whole pepper corns (sabut kali mirch)",
            "3 green cardamom  (choti elaichi)",
            "2 black cardamom (badi elaichi)",
            "1 tsp turmeric powder (haldi)",
            "1 tsp chili powder (lal mirch powder)",
            "1 tsp coriander powder (dhaniya powder)",
            "1 tsp cumin powder (zeera powder)",
            "1 tsp cumin seeds (zeera)",
            "1/2 tsp asafoetida (heeng)",
            "Salt to taste",
            "1 cup onions (chopped)",
            "1 cup tomatoes (chopped)",
            "1 tsp ginger (chopped)",
            "1 tsp garlic (chopped)",
            "1 tsp ajwain",
            "1 tsp lime juice",
            "1 green chili (chopped)                      1 tea bag                                                1 Tbsp butter",
            "For the bhaturas:",
            "2 cups maida (refined flour)",
            "1/2 tsp yeast, dissolved for 10 minutes in luke warm water",
            "1/2 cup whole wheat flour",
            "A pinch of salt",
            "Water to knead",
            "Oil for frying"
        ],
        "instructions": [
            "For chole:",
            "In a pan add oil, bay leaf, cinnamon, cumin seeds, cloves, whole pepper corns, green and black cardamom.",
            "After it gets brown add chopped onions and saute it.",
            "After sauteing add chopped ginger and garlic.",
            "Then add turmeric, chili powder, coriander powder, cumin powder, asafoetida, salt and fry well.",
            "For de glazing the pan add little water.",
            "Now add the chole (soaked overnight and pressure cooked) to the masala.",
            "After stirring well add tomatoes, little sugar and salt to the chole (chickpeas)",
            "Now add ajwain, chopped green chilies and water for the base.",
            "To get the color in the chole, add a tea bag to the masala.",
            "Simmer the chole gently for an hour and cover it.",
            "Add lime juice and a dollop of butter to it.",
            "Garnish the chole with coriander and butter.",
            "Serve the chole hot with bhaturas.",
            "For the bhaturas:",
            "Knead the whole wheat flour, maida and salt together with adequate amount of water.",
            "Sprinkle the yeast on top. Leave it for 2-3 hours for the yeast to work.",
            "Divide it into equal portions. Roll out in an oval or round shape.",
            "Deep fry till golden brown, like a puri.",
            "Serve. "
        ],
        "cook_time": "1 Hour",
        "cuisine": "japanese"
    },
    {
        "name": "Quick Chicken Curry",
        "ingredients": [
            "1 kg chicken",
            "3 large onions, paste",
            "2 large tomatoes, pureed",
            "1 Tbsp garlic paste",
            "1 Tbsp ginger paste",
            "2 tsp coriander powder",
            "2 tsp cumin powder",
            "1/2 tsp turmeric powder",
            "1/2 tsp red chilli powder",
            "1 tsp garam masala powder",
            "2 Tbsp oil",
            "Salt to taste",
            "Chopped coriander for garnish"
        ],
        "instructions": [
            "Heat oil in a pan and sauté the onion paste, garlic & ginger paste till golden brown.",
            "Add tomato puree. When the tomato puree dries up, add coriander powder, cumin powder, garam masala, red chilli powder, turmeric powder and salt. Let the spices cook.",
            "Add chicken pieces into the masala. Stir well and cook till they are golden brown.",
            "Add 1/2 cup of water and stir. Cover with a lid and let it simmer till the chicken is cooked.",
            "Garnish with chopped coriander and serve."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "japanese"
    },
    {
        "name": "Butter Chicken",
        "ingredients": [
            "700 gm raw chicken  ",
            "For theMarinade:",
            "1 tsp red chilli powder ",
            "1 tsp ginger and garlic paste ",
            "Salt to taste ",
            "1/2 kg curd  ",
            "For theGravy:",
            "175 gm white butter ",
            "1/2 tsp black cumin seeds ",
            "1/2 kg tomato, pureed ",
            "1/2 tsp sugar ",
            "1 tsp red chilli powder ",
            "Salt to taste ",
            "100 gm fresh cream ",
            "4 green chillies, sliced",
            "1/2 tsp fenugreek leaves, crushed"
        ],
        "instructions": [
            "For marinating the chicken",
            "In a mixing bowl, mix red chilli powder, ginger garlic paste, salt and curd.  ",
            "Add the raw chicken pieces to the marinade and mix well. Keep it in the refrigerator overnight or minimum 6 hours.  ",
            "Roast the marinated chicken in a tandoor or an oven for about 10-12 minutes until it is three-fourth done.  ",
            "For the chicken gravy",
            "Heat half the quantity of white butter in pan. ",
            "Pour in the tomato puree, and saute for 2-3 minutes. Add cumin seeds, sugar, red chilli powder and salt. Mix well.  ",
            "Add the prepared chicken, white butter, fresh cream, sliced green chillies and crushed fenugreek leaves.  Saute for 3-4 minutes and let the chicken cook.",
            "Cook till chicken is done. Serve hot with rice or naan."
        ],
        "cook_time": "30 Minutes + Marination time (overnight)",
        "cuisine": "japanese"
    }
]