[
    {
        "name": "Spanish Valencia Prawns",
        "ingredients": [
            "12 medium sized prawns",
            "20 ml refined sunflower oil",
            "20 ml dry red wine",
            "10 gms shrimp powder",
            "A pinch of saffron",
            "20 gms paprika",
            "20 ml lemon juice",
            "Salt to taste",
            "30 gms chopped onion - fried golden",
            "30 gms chopped garlic - fried golden"
        ],
        "instructions": [
            "In a round bowl, mix paprika powder, red wine, shrimp powder, saffron, salt and vegetable oil. Whisk well.",
            "Add fried onions and fried garlic. Check seasoning.",
            "Peel, de-vein and clean prawns.",
            "Add lemon juice. Marinate for 45 minutes.",
            "Grill over moderate charcoal fire and serve hot with a medium spice dip."
        ],
        "cook_time": "20 Minutes +  Marination Time (45 mins)",
        "cuisine": "spanish"
    },
    {
        "name": "Corn and Mushroom Tostada",
        "ingredients": [
            "1 sheet of corn tortilla",
            "50 gm mixed button & Shiitake mushrooms",
            "5 gm of thyme",
            "5 ml of olive oil",
            "20 gm of corn",
            "10 gm of green chili",
            "10 gm of coriander",
            "10 gm of onion",
            "5 gm of garlic",
            "20 gm of avocado",
            "1 portion of cheese dip",
            "Sour cream and salsa for garnishing"
        ],
        "instructions": [
            "Saute mushrooms and garlic in olive oil.",
            "Add onion, thyme, green chili, coriander and mix together. Add salt to taste. ",
            "Roll and fry a tortilla sheet into a bowl like shape.",
            "Put the above filling in this cup. Garnish with tomato salsa, avocado slices and sour cream.",
            "Serve with a side of cheese dip. "
        ],
        "cook_time": "25 Minutes",
        "cuisine": "spanish"
    },
    {
        "name": "Patatas Bravas",
        "ingredients": [
            "5 potato                 ",
            "1 litre sunflower oil               ",
            "5 fresh tomatoes             ",
            "1 fresh red chili             ",
            "1 egg                 ",
            "3 pieces garlic",
            "3 clove               ",
            "1 tsp lemon juice                ",
            "5 Tbsp  olive oil               ",
            "Salt to taste",
            "Black pepper powder to taste2 sprigs fresh parsley"
        ],
        "instructions": [
            "Cut the potatoes into exact halves. Scoop at the center with small scooper.",
            "In a tray put the potatoes & cover with sunflower oil. Cook in the oven at 150 degree for 45 minutes.",
            "For spicy tomato sauce:",
            "In a pan, heat olive oil, add crushed garlic cloves & saute.",
            "Add chopped fresh red chili, saute & add chopped tomatoes. Cook for about an 1 hour, over slow flame.",
            "Season the sauce & blend.",
            "For garlic aioli:",
            "In a bowl break whole egg, add chopped garlic, lemon juice & salt, mix well & start whipping it.",
            "Add olive oil slowly to form an emulsion; whip till mayonnaise / aioli is firm.",
            "Deep fry the potatoes, take out on a paper towel & sprinkle with salt.",
            "Fill the center with spicy tomato sauce & top with garlic aioli. ",
            "Garnish with fresh chopped parsley. "
        ],
        "cook_time": "1 Hour",
        "cuisine": "spanish"
    },
    {
        "name": "Chicken Paella",
        "ingredients": [
            "4 chicken pieces ",
            "4 Tbsp oil ",
            "Salt and pepper to taste",
            "2 Tbsp paprika powder",
            "Chilli flakes",
            "2 tsp garlic paste ",
            "1 cup onions ",
            "1 cup bell peppers",
            "1 cup rice",
            "1 cup vegetable stock ",
            "Saffron a pinch",
            "1 cup peas7-8 olives",
            "Parsley"
        ],
        "instructions": [
            "Heat oil in a pan. Shallow fry the chicken pieces and add diced onion to it, add bell peppers.",
            "Mix them well. Take out the chicken pieces and vegetables. In the same pan, cook rice and add vegetable stock. ",
            "Stir well. Add the bacon, chicken pieces and vegetables back into the pan. Add saffron mixed in white wine to the pan.",
            "Add salt and pepper. Let it cook for some time.",
            "Add green peas, olives and chopped parsley. Drizzle some olive oil on it and serve."
        ],
        "cook_time": "35 Minutes",
        "cuisine": "spanish"
    },
    {
        "name": "Creole Spiced Corn",
        "ingredients": [
            "4 corn on the cob ",
            "1-2 Tbsp butter ",
            "For the creole spice: ",
            "1 Tbsp paprika ",
            "2 Tbsp salt ",
            "4 tsp dried onion powder ",
            "4 Tbsp garlic powder ",
            "1 Tbsp ground black pepper ",
            "1/2 Tbsp chilli powder ",
            "1/2 Tbsp dried thyme ",
            "1/2 Tbsp dried oregano ",
            "For the beetroot chutney:",
            "2 Tbsp oil ",
            "1 Tbsp mustard seeds",
            "1 Tbsp white urad dal ",
            "Heeng, a pinch",
            "2 red/green chillies",
            "1 medium beetroot - boiled and grated ",
            "1-2 Tbsp tamarind paste ",
            "1 Tbsp chopped coriander",
            "Salt to taste"
        ],
        "instructions": [
            "Boil and roast the corn till tender.",
            "Melt the butter in a hot pan. Stir in spices.",
            "Use to coat the corn and serve immediately with chutney.",
            "4. For the chutney:",
            "Heat the oil and add mustard seeds, dal, hing and chillies.",
            "Fry until the dal colors.",
            "Add beetroot to the pan. Stir and fry for 4 minutes, before adding the tamarind paste.",
            "Add coriander and season well. ",
            "Grind to a paste. Serve with corns."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "spanish"
    },
    {
        "name": "Vickys Spanish Omelette",
        "ingredients": [
            "1 Tbsp olive oil",
            "1 tsp butter",
            "1 onion, sliced",
            "1 potato, sliced thinly",
            "5 eggs",
            "Pepper, to taste",
            "Salt, to taste",
            "2 tsp parsley, chopped + To garnish"
        ],
        "instructions": [
            "In a pan add olive oil and butter.",
            "Add onions, saute till pink.",
            "Add thinly sliced potatoes. Saute for 3-4 minutes.",
            "In a bowl whisk eggs with a little parsley, salt and pepper.",
            "Mix the onion-potato mixture into the eggs.",
            "Pour the omelette batter in the same saucepan and cook for 3-4 minutes.",
            "Flip and cook from the other side.",
            "Garnish with parsley. Serve."
        ],
        "cook_time": "15 Minutes",
        "cuisine": "spanish"
    },
    {
        "name": "Bread with Tomatoes and Olives",
        "ingredients": [
            "1/2 loaf french bread, cut diagonally",
            "2 tomatoes, blanched and grated",
            "1 Tbsp extra virgin olive oil + To drizzle",
            "Sea salt, a pinch",
            "Pepper, a pinch",
            "Parsley, chopped",
            "7-8 stuffed green olives, sliced"
        ],
        "instructions": [
            "Toast the bread diagonals at 180 degree C for 6.5 minutes.",
            "In a bowl mix together the grated tomatoes, olive oil, salt, pepper and parsley.",
            "Spread this sauce on the bread. Top with olives. Bake for 2-3 minutes.",
            "Drizzle with some extra virgin olive oil before serving."
        ],
        "cook_time": "15 Minutes",
        "cuisine": "spanish"
    },
    {
        "name": "Spanish Omelette",
        "ingredients": [
            "6 eggs",
            "3 green chillies, chopped",
            "2 potatoes, cut into fingers, rubbed with some salt",
            "4-5 Tbsp oil, to fry potatoes",
            "1 Tbsp coriander leaves, chopped",
            "2-3 Tbsp sauteed onions (onions boiled, chopped and sauteed in little butter)",
            "Black pepper powder, a pinch",
            "Salt, to taste",
            "1 cheese slice, torn into little pieces",
            "1 Tbsp oil, to cook the omelet"
        ],
        "instructions": [
            "Peel and cut the potatoes and rub them with some salt.",
            "In a pan add 4-5 tbsp oil and toss the potatoes till cooked.",
            "In a bowl break the eggs and whisk them till fluffy. Add chopped corriander leaves.",
            "Add 2-3 Tbsp sauteed onions, green chillies, black pepper and some salt and small bits of cheese slices. Whisk. Mix in the cooked potatoes.",
            "In a saucepan add a Tbsp of oil and pour the batter. Cook for a minute. Cover it with a lid and cook for another 2-4 minutes. Flip and cook from the other side.",
            "Cut and serve."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "spanish"
    },
    {
        "name": "Spanish Lentil Stew",
        "ingredients": [
            "250 g red lentils",
            "1 chicken sausage",
            "100 g chicken ham",
            "2 large carrots",
            "3 small potatoes",
            "1 bay leaf",
            "1 red pepper (optional)",
            "A sprig of chopped fresh parsley",
            "1/2 tsp salt",
            "A pinch of saffron",
            "2 cloves ",
            "250 ml red wine",
            "2 Tbsp olive oil",
            "1 large onion",
            "2 garlic cloves"
        ],
        "instructions": [
            "Soak the lentils in water for half an hour. Cut the sausage and ham into dice-shaped pieces.",
            "Peel and wash the carrots and potatoes. Slice the carrots and halve the potatoes (unless they are very small). Wash and slice a small red pepper, if using.",
            "Drain the lentils and put them in a saucepan. Add enough water to cover them and add the sausage, ham, carrots, potatoes, bay leaf, pepper, if using, parsley, salt, saffron, cloves and wine.",
            "Put the pan over a low heat and cover. Simmer for 7-8 minutes.",
            "Slice the onion and garlic. Heat the oil in a frying pan and fry the onion and garlic for 5 minutes. When soft, add to the other ingredients in the saucepan.",
            "Let the lentil stew simmer for at least 40 minutes. Boil off any excess liquid at the end. "
        ],
        "cook_time": "45 minutes",
        "cuisine": "spanish"
    },
    {
        "name": "Spanish Croquettes",
        "ingredients": [
            "2 Tbsp olive oil, plus extra oil for deep-frying",
            "4 Tbsp butter",
            "3 Tbsp flour or maida",
            "1 1/2 cups whole milk, heated",
            "80 gm chicken ham, finely chopped",
            "2 eggs, beaten or whisked",
            "2 Tbsp dried breadcrumbs",
            "Lightly oil a shallow 8-inch square dish."
        ],
        "instructions": [
            "In a saucepan, heat the 2 tbsp of oil and the butter over medium heat. When the butter has melted, add the flour and, using a wooden spoon or whisk, mix well.",
            "Continue to stir or whisk for about 2 minutes, or until the flour is well blended.",
            "Add 1/2 cup of the milk and increase the heat to medium-high. Bring the mixture to a boil and add the remaining cup of milk.",
            "Cook, stirring constantly with the spoon or whisk, for about 5 minutes, or until the mixture begins to thicken.",
            "Decrease the heat to medium and cook, stirring constantly to prevent lumps from forming, for about 10 minutes, or until thickened.",
            "Add the chicken ham and stir. Cook for 1 minute longer and then pour the contents of the pan into the prepared dish.",
            "Spread the mixture evenly. Let cool down for a bit and then cover and refrigerate for at least 2 hours, but preferably overnight to allow the mixture to set.",
            "Spread the breadcrumbs on a dinner plate. With 2 spoons, shape the ham mixture into walnut-sized or golf ball sized croquettes.",
            "Roll each croquette in the breadcrumbs, shaking off any excess crumbs, and then dip into the beaten egg.",
            "Lift each croquette from the egg and roll it again in the breadcrumbs, coating it evenly.",
            "Lay the croquettes in a single layer on a platter. Refrigerate for 30 minutes before frying.",
            "Pour the oil to a depth of about 2 inches into a wide, deep, heavy pot and heat over high heat.",
            "When the oil is almost smoking, slip 5 or 6 croquettes into the oil, pressing on them gently with a slotted spoon to submerge them, and fry, turning them gently, for about 2 minutes, or until they are golden on all sides.",
            "Using the slotted spoon, lift out the croquettes, holding them briefly over the pot to allow the excess oil to drain, and transfer to an oven proof platter lined with paper towels to drain further.",
            "Keep the croquettes warm in a low oven.",
            "Fry the rest of the croquettes in the same way. Always making sure the oil is very hot before adding more croquettes.",
            "When all the croquettes are fried, arrange on a platter and serve immediately."
        ],
        "cook_time": "1 Hour",
        "cuisine": "spanish"
    },
    {
        "name": "Chocolate Cake in a Pressure Cooker",
        "ingredients": [
            "1 cup flour  ",
            "1/4 cup cocoa powder  ",
            "1 1/4 tsp baking powder",
            "1/4 cup butter",
            "3/4 cup caster sugar",
            "1/4 cup water  ",
            "2 eggs  ",
            "1/2 tsp vanilla essence",
            "1/8 tsp salt  ",
            "6 inch round greased baking tin"
        ],
        "instructions": [
            "In a mixing bowl, sift the flour, cocoa powder and baking powder. ",
            "Add in the butter, sugar, salt, water and vanilla, and beat the ingredients using a whisk.     ",
            "Add the eggs and beat the batter until smooth. ",
            "Transfer into the baking tin.    ",
            "Heat the pressure cooker, covered with the lid but without the pressure, for 3-4 minutes on high heat, then place the cake tin in the empty cooker (do not add water in the cooker).     ",
            "Close the lid (without the pressure), lower the flame and let it cook until done (about 30 minutes)."
        ],
        "cook_time": "1 Hour",
        "cuisine": "spanish"
    },
    {
        "name": "Honey Chilli Potatoes",
        "ingredients": [
            "For the potatoes:",
            "2 potatoes, peeled and sliced",
            "3-4 Tbsp cornflour or maida",
            "Salt to taste",
            "1 tsp red chilli powder",
            "Oil, for deep frying",
            "For the base:",
            "1 tsp oil",
            "2 spring onions (with stalk), sliced",
            "1 Tbsp garlic paste",
            "1 capsicum, sliced",
            "2 Tbsp honey",
            "Salt, to taste",
            "1/4 tsp soya sauce",
            "3 tsp white sesame seeds",
            "2 tsp chilli sauce"
        ],
        "instructions": [
            "For the potatoes:",
            "In a bowl, add cornflour or maida, salt and red chilli powder.",
            "Add the sliced potatoes and mix well until the potatoes are coated.",
            "Heat oil in a wok and deep fry the potatoes until golden. Keep aside.",
            "For the Base:",
            "In a wok, add oil, garlic paste and spring onions. Saute on high heat for 1 minute.",
            "Add capsicum, honey, salt, soya sauce, chilli sauce. Saute for 2-3 minutes.",
            "Add the deep-fried potatoes and sesame seeds. Mix well and serve hot."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "spanish"
    },
    {
        "name": "Vegetable Momos",
        "ingredients": [
            "For Dough:",
            "2 cups maida",
            "1/2 tsp salt ",
            "1/2 tsp baking powder   ",
            "For Filling: ",
            "1 cup carrots - grated ",
            "1 cup cabbage - grated ",
            "1 Tbsp oil ",
            "1/2 cup onion - finely chopped ",
            "1 tsp garlic - chopped  ",
            "1 tsp Soya sauce ",
            "Salt ",
            "1/4 tsp vinegar ",
            "1/4 tsp black pepper"
        ],
        "instructions": [
            "Mix the maida, salt and baking powder and knead to a stiff dough with water. ",
            "Heat oil and add the onion and garlic. ",
            "Saute over high heat and add the carrot and cabbage. Turn around over high heat till glossy. ",
            "Take it off the heat and mix in the Soya sauce, salt, vinegar and black pepper. ",
            "Roll the dough thin (translucent) and cut into 4\"-5\" rounds. ",
            "Take a round, wet edges and place some filling in the center. ",
            "Bring edges together to cover the filling. Twist to seal and fill the rest in the same way. ",
            "Steam for about 10 minutes and serve with soya sauce and chilli sauce."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "spanish"
    },
    {
        "name": "Chole Bhature",
        "ingredients": [
            "For chole:",
            "2 cup chickpeas (channas)",
            "2 tsp oil",
            "1 bay leaf (tej patta)",
            "1 stick cinnamon (dalchini)",
            "3-4 cloves (laung)",
            "1 tsp whole pepper corns (sabut kali mirch)",
            "3 green cardamom  (choti elaichi)",
            "2 black cardamom (badi elaichi)",
            "1 tsp turmeric powder (haldi)",
            "1 tsp chili powder (lal mirch powder)",
            "1 tsp coriander powder (dhaniya powder)",
            "1 tsp cumin powder (zeera powder)",
            "1 tsp cumin seeds (zeera)",
            "1/2 tsp asafoetida (heeng)",
            "Salt to taste",
            "1 cup onions (chopped)",
            "1 cup tomatoes (chopped)",
            "1 tsp ginger (chopped)",
            "1 tsp garlic (chopped)",
            "1 tsp ajwain",
            "1 tsp lime juice",
            "1 green chili (chopped)                      1 tea bag                                                1 Tbsp butter",
            "For the bhaturas:",
            "2 cups maida (refined flour)",
            "1/2 tsp yeast, dissolved for 10 minutes in luke warm water",
            "1/2 cup whole wheat flour",
            "A pinch of salt",
            "Water to knead",
            "Oil for frying"
        ],
        "instructions": [
            "For chole:",
            "In a pan add oil, bay leaf, cinnamon, cumin seeds, cloves, whole pepper corns, green and black cardamom.",
            "After it gets brown add chopped onions and saute it.",
            "After sauteing add chopped ginger and garlic.",
            "Then add turmeric, chili powder, coriander powder, cumin powder, asafoetida, salt and fry well.",
            "For de glazing the pan add little water.",
            "Now add the chole (soaked overnight and pressure cooked) to the masala.",
            "After stirring well add tomatoes, little sugar and salt to the chole (chickpeas)",
            "Now add ajwain, chopped green chilies and water for the base.",
            "To get the color in the chole, add a tea bag to the masala.",
            "Simmer the chole gently for an hour and cover it.",
            "Add lime juice and a dollop of butter to it.",
            "Garnish the chole with coriander and butter.",
            "Serve the chole hot with bhaturas.",
            "For the bhaturas:",
            "Knead the whole wheat flour, maida and salt together with adequate amount of water.",
            "Sprinkle the yeast on top. Leave it for 2-3 hours for the yeast to work.",
            "Divide it into equal portions. Roll out in an oval or round shape.",
            "Deep fry till golden brown, like a puri.",
            "Serve. "
        ],
        "cook_time": "1 Hour",
        "cuisine": "spanish"
    },
    {
        "name": "Quick Chicken Curry",
        "ingredients": [
            "1 kg chicken",
            "3 large onions, paste",
            "2 large tomatoes, pureed",
            "1 Tbsp garlic paste",
            "1 Tbsp ginger paste",
            "2 tsp coriander powder",
            "2 tsp cumin powder",
            "1/2 tsp turmeric powder",
            "1/2 tsp red chilli powder",
            "1 tsp garam masala powder",
            "2 Tbsp oil",
            "Salt to taste",
            "Chopped coriander for garnish"
        ],
        "instructions": [
            "Heat oil in a pan and sauté the onion paste, garlic & ginger paste till golden brown.",
            "Add tomato puree. When the tomato puree dries up, add coriander powder, cumin powder, garam masala, red chilli powder, turmeric powder and salt. Let the spices cook.",
            "Add chicken pieces into the masala. Stir well and cook till they are golden brown.",
            "Add 1/2 cup of water and stir. Cover with a lid and let it simmer till the chicken is cooked.",
            "Garnish with chopped coriander and serve."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "spanish"
    },
    {
        "name": "Butter Chicken",
        "ingredients": [
            "700 gm raw chicken  ",
            "For theMarinade:",
            "1 tsp red chilli powder ",
            "1 tsp ginger and garlic paste ",
            "Salt to taste ",
            "1/2 kg curd  ",
            "For theGravy:",
            "175 gm white butter ",
            "1/2 tsp black cumin seeds ",
            "1/2 kg tomato, pureed ",
            "1/2 tsp sugar ",
            "1 tsp red chilli powder ",
            "Salt to taste ",
            "100 gm fresh cream ",
            "4 green chillies, sliced",
            "1/2 tsp fenugreek leaves, crushed"
        ],
        "instructions": [
            "For marinating the chicken",
            "In a mixing bowl, mix red chilli powder, ginger garlic paste, salt and curd.  ",
            "Add the raw chicken pieces to the marinade and mix well. Keep it in the refrigerator overnight or minimum 6 hours.  ",
            "Roast the marinated chicken in a tandoor or an oven for about 10-12 minutes until it is three-fourth done.  ",
            "For the chicken gravy",
            "Heat half the quantity of white butter in pan. ",
            "Pour in the tomato puree, and saute for 2-3 minutes. Add cumin seeds, sugar, red chilli powder and salt. Mix well.  ",
            "Add the prepared chicken, white butter, fresh cream, sliced green chillies and crushed fenugreek leaves.  Saute for 3-4 minutes and let the chicken cook.",
            "Cook till chicken is done. Serve hot with rice or naan."
        ],
        "cook_time": "30 Minutes + Marination time (overnight)",
        "cuisine": "spanish"
    },
    {
        "name": "Spanish Valencia Prawns",
        "ingredients": [
            "12 medium sized prawns",
            "20 ml refined sunflower oil",
            "20 ml dry red wine",
            "10 gms shrimp powder",
            "A pinch of saffron",
            "20 gms paprika",
            "20 ml lemon juice",
            "Salt to taste",
            "30 gms chopped onion - fried golden",
            "30 gms chopped garlic - fried golden"
        ],
        "instructions": [
            "In a round bowl, mix paprika powder, red wine, shrimp powder, saffron, salt and vegetable oil. Whisk well.",
            "Add fried onions and fried garlic. Check seasoning.",
            "Peel, de-vein and clean prawns.",
            "Add lemon juice. Marinate for 45 minutes.",
            "Grill over moderate charcoal fire and serve hot with a medium spice dip."
        ],
        "cook_time": "20 Minutes +  Marination Time (45 mins)",
        "cuisine": "spanish"
    },
    {
        "name": "Corn and Mushroom Tostada",
        "ingredients": [
            "1 sheet of corn tortilla",
            "50 gm mixed button & Shiitake mushrooms",
            "5 gm of thyme",
            "5 ml of olive oil",
            "20 gm of corn",
            "10 gm of green chili",
            "10 gm of coriander",
            "10 gm of onion",
            "5 gm of garlic",
            "20 gm of avocado",
            "1 portion of cheese dip",
            "Sour cream and salsa for garnishing"
        ],
        "instructions": [
            "Saute mushrooms and garlic in olive oil.",
            "Add onion, thyme, green chili, coriander and mix together. Add salt to taste. ",
            "Roll and fry a tortilla sheet into a bowl like shape.",
            "Put the above filling in this cup. Garnish with tomato salsa, avocado slices and sour cream.",
            "Serve with a side of cheese dip. "
        ],
        "cook_time": "25 Minutes",
        "cuisine": "spanish"
    },
    {
        "name": "Patatas Bravas",
        "ingredients": [
            "5 potato                 ",
            "1 litre sunflower oil               ",
            "5 fresh tomatoes             ",
            "1 fresh red chili             ",
            "1 egg                 ",
            "3 pieces garlic",
            "3 clove               ",
            "1 tsp lemon juice                ",
            "5 Tbsp  olive oil               ",
            "Salt to taste",
            "Black pepper powder to taste2 sprigs fresh parsley"
        ],
        "instructions": [
            "Cut the potatoes into exact halves. Scoop at the center with small scooper.",
            "In a tray put the potatoes & cover with sunflower oil. Cook in the oven at 150 degree for 45 minutes.",
            "For spicy tomato sauce:",
            "In a pan, heat olive oil, add crushed garlic cloves & saute.",
            "Add chopped fresh red chili, saute & add chopped tomatoes. Cook for about an 1 hour, over slow flame.",
            "Season the sauce & blend.",
            "For garlic aioli:",
            "In a bowl break whole egg, add chopped garlic, lemon juice & salt, mix well & start whipping it.",
            "Add olive oil slowly to form an emulsion; whip till mayonnaise / aioli is firm.",
            "Deep fry the potatoes, take out on a paper towel & sprinkle with salt.",
            "Fill the center with spicy tomato sauce & top with garlic aioli. ",
            "Garnish with fresh chopped parsley. "
        ],
        "cook_time": "1 Hour",
        "cuisine": "spanish"
    },
    {
        "name": "Chicken Paella",
        "ingredients": [
            "4 chicken pieces ",
            "4 Tbsp oil ",
            "Salt and pepper to taste",
            "2 Tbsp paprika powder",
            "Chilli flakes",
            "2 tsp garlic paste ",
            "1 cup onions ",
            "1 cup bell peppers",
            "1 cup rice",
            "1 cup vegetable stock ",
            "Saffron a pinch",
            "1 cup peas7-8 olives",
            "Parsley"
        ],
        "instructions": [
            "Heat oil in a pan. Shallow fry the chicken pieces and add diced onion to it, add bell peppers.",
            "Mix them well. Take out the chicken pieces and vegetables. In the same pan, cook rice and add vegetable stock. ",
            "Stir well. Add the bacon, chicken pieces and vegetables back into the pan. Add saffron mixed in white wine to the pan.",
            "Add salt and pepper. Let it cook for some time.",
            "Add green peas, olives and chopped parsley. Drizzle some olive oil on it and serve."
        ],
        "cook_time": "35 Minutes",
        "cuisine": "spanish"
    },
    {
        "name": "Creole Spiced Corn",
        "ingredients": [
            "4 corn on the cob ",
            "1-2 Tbsp butter ",
            "For the creole spice: ",
            "1 Tbsp paprika ",
            "2 Tbsp salt ",
            "4 tsp dried onion powder ",
            "4 Tbsp garlic powder ",
            "1 Tbsp ground black pepper ",
            "1/2 Tbsp chilli powder ",
            "1/2 Tbsp dried thyme ",
            "1/2 Tbsp dried oregano ",
            "For the beetroot chutney:",
            "2 Tbsp oil ",
            "1 Tbsp mustard seeds",
            "1 Tbsp white urad dal ",
            "Heeng, a pinch",
            "2 red/green chillies",
            "1 medium beetroot - boiled and grated ",
            "1-2 Tbsp tamarind paste ",
            "1 Tbsp chopped coriander",
            "Salt to taste"
        ],
        "instructions": [
            "Boil and roast the corn till tender.",
            "Melt the butter in a hot pan. Stir in spices.",
            "Use to coat the corn and serve immediately with chutney.",
            "4. For the chutney:",
            "Heat the oil and add mustard seeds, dal, hing and chillies.",
            "Fry until the dal colors.",
            "Add beetroot to the pan. Stir and fry for 4 minutes, before adding the tamarind paste.",
            "Add coriander and season well. ",
            "Grind to a paste. Serve with corns."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "spanish"
    },
    {
        "name": "Vickys Spanish Omelette",
        "ingredients": [
            "1 Tbsp olive oil",
            "1 tsp butter",
            "1 onion, sliced",
            "1 potato, sliced thinly",
            "5 eggs",
            "Pepper, to taste",
            "Salt, to taste",
            "2 tsp parsley, chopped + To garnish"
        ],
        "instructions": [
            "In a pan add olive oil and butter.",
            "Add onions, saute till pink.",
            "Add thinly sliced potatoes. Saute for 3-4 minutes.",
            "In a bowl whisk eggs with a little parsley, salt and pepper.",
            "Mix the onion-potato mixture into the eggs.",
            "Pour the omelette batter in the same saucepan and cook for 3-4 minutes.",
            "Flip and cook from the other side.",
            "Garnish with parsley. Serve."
        ],
        "cook_time": "15 Minutes",
        "cuisine": "spanish"
    },
    {
        "name": "Bread with Tomatoes and Olives",
        "ingredients": [
            "1/2 loaf french bread, cut diagonally",
            "2 tomatoes, blanched and grated",
            "1 Tbsp extra virgin olive oil + To drizzle",
            "Sea salt, a pinch",
            "Pepper, a pinch",
            "Parsley, chopped",
            "7-8 stuffed green olives, sliced"
        ],
        "instructions": [
            "Toast the bread diagonals at 180 degree C for 6.5 minutes.",
            "In a bowl mix together the grated tomatoes, olive oil, salt, pepper and parsley.",
            "Spread this sauce on the bread. Top with olives. Bake for 2-3 minutes.",
            "Drizzle with some extra virgin olive oil before serving."
        ],
        "cook_time": "15 Minutes",
        "cuisine": "spanish"
    },
    {
        "name": "Spanish Omelette",
        "ingredients": [
            "6 eggs",
            "3 green chillies, chopped",
            "2 potatoes, cut into fingers, rubbed with some salt",
            "4-5 Tbsp oil, to fry potatoes",
            "1 Tbsp coriander leaves, chopped",
            "2-3 Tbsp sauteed onions (onions boiled, chopped and sauteed in little butter)",
            "Black pepper powder, a pinch",
            "Salt, to taste",
            "1 cheese slice, torn into little pieces",
            "1 Tbsp oil, to cook the omelet"
        ],
        "instructions": [
            "Peel and cut the potatoes and rub them with some salt.",
            "In a pan add 4-5 tbsp oil and toss the potatoes till cooked.",
            "In a bowl break the eggs and whisk them till fluffy. Add chopped corriander leaves.",
            "Add 2-3 Tbsp sauteed onions, green chillies, black pepper and some salt and small bits of cheese slices. Whisk. Mix in the cooked potatoes.",
            "In a saucepan add a Tbsp of oil and pour the batter. Cook for a minute. Cover it with a lid and cook for another 2-4 minutes. Flip and cook from the other side.",
            "Cut and serve."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "spanish"
    },
    {
        "name": "Spanish Lentil Stew",
        "ingredients": [
            "250 g red lentils",
            "1 chicken sausage",
            "100 g chicken ham",
            "2 large carrots",
            "3 small potatoes",
            "1 bay leaf",
            "1 red pepper (optional)",
            "A sprig of chopped fresh parsley",
            "1/2 tsp salt",
            "A pinch of saffron",
            "2 cloves ",
            "250 ml red wine",
            "2 Tbsp olive oil",
            "1 large onion",
            "2 garlic cloves"
        ],
        "instructions": [
            "Soak the lentils in water for half an hour. Cut the sausage and ham into dice-shaped pieces.",
            "Peel and wash the carrots and potatoes. Slice the carrots and halve the potatoes (unless they are very small). Wash and slice a small red pepper, if using.",
            "Drain the lentils and put them in a saucepan. Add enough water to cover them and add the sausage, ham, carrots, potatoes, bay leaf, pepper, if using, parsley, salt, saffron, cloves and wine.",
            "Put the pan over a low heat and cover. Simmer for 7-8 minutes.",
            "Slice the onion and garlic. Heat the oil in a frying pan and fry the onion and garlic for 5 minutes. When soft, add to the other ingredients in the saucepan.",
            "Let the lentil stew simmer for at least 40 minutes. Boil off any excess liquid at the end. "
        ],
        "cook_time": "45 minutes",
        "cuisine": "spanish"
    },
    {
        "name": "Spanish Croquettes",
        "ingredients": [
            "2 Tbsp olive oil, plus extra oil for deep-frying",
            "4 Tbsp butter",
            "3 Tbsp flour or maida",
            "1 1/2 cups whole milk, heated",
            "80 gm chicken ham, finely chopped",
            "2 eggs, beaten or whisked",
            "2 Tbsp dried breadcrumbs",
            "Lightly oil a shallow 8-inch square dish."
        ],
        "instructions": [
            "In a saucepan, heat the 2 tbsp of oil and the butter over medium heat. When the butter has melted, add the flour and, using a wooden spoon or whisk, mix well.",
            "Continue to stir or whisk for about 2 minutes, or until the flour is well blended.",
            "Add 1/2 cup of the milk and increase the heat to medium-high. Bring the mixture to a boil and add the remaining cup of milk.",
            "Cook, stirring constantly with the spoon or whisk, for about 5 minutes, or until the mixture begins to thicken.",
            "Decrease the heat to medium and cook, stirring constantly to prevent lumps from forming, for about 10 minutes, or until thickened.",
            "Add the chicken ham and stir. Cook for 1 minute longer and then pour the contents of the pan into the prepared dish.",
            "Spread the mixture evenly. Let cool down for a bit and then cover and refrigerate for at least 2 hours, but preferably overnight to allow the mixture to set.",
            "Spread the breadcrumbs on a dinner plate. With 2 spoons, shape the ham mixture into walnut-sized or golf ball sized croquettes.",
            "Roll each croquette in the breadcrumbs, shaking off any excess crumbs, and then dip into the beaten egg.",
            "Lift each croquette from the egg and roll it again in the breadcrumbs, coating it evenly.",
            "Lay the croquettes in a single layer on a platter. Refrigerate for 30 minutes before frying.",
            "Pour the oil to a depth of about 2 inches into a wide, deep, heavy pot and heat over high heat.",
            "When the oil is almost smoking, slip 5 or 6 croquettes into the oil, pressing on them gently with a slotted spoon to submerge them, and fry, turning them gently, for about 2 minutes, or until they are golden on all sides.",
            "Using the slotted spoon, lift out the croquettes, holding them briefly over the pot to allow the excess oil to drain, and transfer to an oven proof platter lined with paper towels to drain further.",
            "Keep the croquettes warm in a low oven.",
            "Fry the rest of the croquettes in the same way. Always making sure the oil is very hot before adding more croquettes.",
            "When all the croquettes are fried, arrange on a platter and serve immediately."
        ],
        "cook_time": "1 Hour",
        "cuisine": "spanish"
    },
    {
        "name": "Chocolate Cake in a Pressure Cooker",
        "ingredients": [
            "1 cup flour  ",
            "1/4 cup cocoa powder  ",
            "1 1/4 tsp baking powder",
            "1/4 cup butter",
            "3/4 cup caster sugar",
            "1/4 cup water  ",
            "2 eggs  ",
            "1/2 tsp vanilla essence",
            "1/8 tsp salt  ",
            "6 inch round greased baking tin"
        ],
        "instructions": [
            "In a mixing bowl, sift the flour, cocoa powder and baking powder. ",
            "Add in the butter, sugar, salt, water and vanilla, and beat the ingredients using a whisk.     ",
            "Add the eggs and beat the batter until smooth. ",
            "Transfer into the baking tin.    ",
            "Heat the pressure cooker, covered with the lid but without the pressure, for 3-4 minutes on high heat, then place the cake tin in the empty cooker (do not add water in the cooker).     ",
            "Close the lid (without the pressure), lower the flame and let it cook until done (about 30 minutes)."
        ],
        "cook_time": "1 Hour",
        "cuisine": "spanish"
    },
    {
        "name": "Honey Chilli Potatoes",
        "ingredients": [
            "For the potatoes:",
            "2 potatoes, peeled and sliced",
            "3-4 Tbsp cornflour or maida",
            "Salt to taste",
            "1 tsp red chilli powder",
            "Oil, for deep frying",
            "For the base:",
            "1 tsp oil",
            "2 spring onions (with stalk), sliced",
            "1 Tbsp garlic paste",
            "1 capsicum, sliced",
            "2 Tbsp honey",
            "Salt, to taste",
            "1/4 tsp soya sauce",
            "3 tsp white sesame seeds",
            "2 tsp chilli sauce"
        ],
        "instructions": [
            "For the potatoes:",
            "In a bowl, add cornflour or maida, salt and red chilli powder.",
            "Add the sliced potatoes and mix well until the potatoes are coated.",
            "Heat oil in a wok and deep fry the potatoes until golden. Keep aside.",
            "For the Base:",
            "In a wok, add oil, garlic paste and spring onions. Saute on high heat for 1 minute.",
            "Add capsicum, honey, salt, soya sauce, chilli sauce. Saute for 2-3 minutes.",
            "Add the deep-fried potatoes and sesame seeds. Mix well and serve hot."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "spanish"
    },
    {
        "name": "Vegetable Momos",
        "ingredients": [
            "For Dough:",
            "2 cups maida",
            "1/2 tsp salt ",
            "1/2 tsp baking powder   ",
            "For Filling: ",
            "1 cup carrots - grated ",
            "1 cup cabbage - grated ",
            "1 Tbsp oil ",
            "1/2 cup onion - finely chopped ",
            "1 tsp garlic - chopped  ",
            "1 tsp Soya sauce ",
            "Salt ",
            "1/4 tsp vinegar ",
            "1/4 tsp black pepper"
        ],
        "instructions": [
            "Mix the maida, salt and baking powder and knead to a stiff dough with water. ",
            "Heat oil and add the onion and garlic. ",
            "Saute over high heat and add the carrot and cabbage. Turn around over high heat till glossy. ",
            "Take it off the heat and mix in the Soya sauce, salt, vinegar and black pepper. ",
            "Roll the dough thin (translucent) and cut into 4\"-5\" rounds. ",
            "Take a round, wet edges and place some filling in the center. ",
            "Bring edges together to cover the filling. Twist to seal and fill the rest in the same way. ",
            "Steam for about 10 minutes and serve with soya sauce and chilli sauce."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "spanish"
    },
    {
        "name": "Chole Bhature",
        "ingredients": [
            "For chole:",
            "2 cup chickpeas (channas)",
            "2 tsp oil",
            "1 bay leaf (tej patta)",
            "1 stick cinnamon (dalchini)",
            "3-4 cloves (laung)",
            "1 tsp whole pepper corns (sabut kali mirch)",
            "3 green cardamom  (choti elaichi)",
            "2 black cardamom (badi elaichi)",
            "1 tsp turmeric powder (haldi)",
            "1 tsp chili powder (lal mirch powder)",
            "1 tsp coriander powder (dhaniya powder)",
            "1 tsp cumin powder (zeera powder)",
            "1 tsp cumin seeds (zeera)",
            "1/2 tsp asafoetida (heeng)",
            "Salt to taste",
            "1 cup onions (chopped)",
            "1 cup tomatoes (chopped)",
            "1 tsp ginger (chopped)",
            "1 tsp garlic (chopped)",
            "1 tsp ajwain",
            "1 tsp lime juice",
            "1 green chili (chopped)                      1 tea bag                                                1 Tbsp butter",
            "For the bhaturas:",
            "2 cups maida (refined flour)",
            "1/2 tsp yeast, dissolved for 10 minutes in luke warm water",
            "1/2 cup whole wheat flour",
            "A pinch of salt",
            "Water to knead",
            "Oil for frying"
        ],
        "instructions": [
            "For chole:",
            "In a pan add oil, bay leaf, cinnamon, cumin seeds, cloves, whole pepper corns, green and black cardamom.",
            "After it gets brown add chopped onions and saute it.",
            "After sauteing add chopped ginger and garlic.",
            "Then add turmeric, chili powder, coriander powder, cumin powder, asafoetida, salt and fry well.",
            "For de glazing the pan add little water.",
            "Now add the chole (soaked overnight and pressure cooked) to the masala.",
            "After stirring well add tomatoes, little sugar and salt to the chole (chickpeas)",
            "Now add ajwain, chopped green chilies and water for the base.",
            "To get the color in the chole, add a tea bag to the masala.",
            "Simmer the chole gently for an hour and cover it.",
            "Add lime juice and a dollop of butter to it.",
            "Garnish the chole with coriander and butter.",
            "Serve the chole hot with bhaturas.",
            "For the bhaturas:",
            "Knead the whole wheat flour, maida and salt together with adequate amount of water.",
            "Sprinkle the yeast on top. Leave it for 2-3 hours for the yeast to work.",
            "Divide it into equal portions. Roll out in an oval or round shape.",
            "Deep fry till golden brown, like a puri.",
            "Serve. "
        ],
        "cook_time": "1 Hour",
        "cuisine": "spanish"
    },
    {
        "name": "Quick Chicken Curry",
        "ingredients": [
            "1 kg chicken",
            "3 large onions, paste",
            "2 large tomatoes, pureed",
            "1 Tbsp garlic paste",
            "1 Tbsp ginger paste",
            "2 tsp coriander powder",
            "2 tsp cumin powder",
            "1/2 tsp turmeric powder",
            "1/2 tsp red chilli powder",
            "1 tsp garam masala powder",
            "2 Tbsp oil",
            "Salt to taste",
            "Chopped coriander for garnish"
        ],
        "instructions": [
            "Heat oil in a pan and sauté the onion paste, garlic & ginger paste till golden brown.",
            "Add tomato puree. When the tomato puree dries up, add coriander powder, cumin powder, garam masala, red chilli powder, turmeric powder and salt. Let the spices cook.",
            "Add chicken pieces into the masala. Stir well and cook till they are golden brown.",
            "Add 1/2 cup of water and stir. Cover with a lid and let it simmer till the chicken is cooked.",
            "Garnish with chopped coriander and serve."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "spanish"
    },
    {
        "name": "Butter Chicken",
        "ingredients": [
            "700 gm raw chicken  ",
            "For theMarinade:",
            "1 tsp red chilli powder ",
            "1 tsp ginger and garlic paste ",
            "Salt to taste ",
            "1/2 kg curd  ",
            "For theGravy:",
            "175 gm white butter ",
            "1/2 tsp black cumin seeds ",
            "1/2 kg tomato, pureed ",
            "1/2 tsp sugar ",
            "1 tsp red chilli powder ",
            "Salt to taste ",
            "100 gm fresh cream ",
            "4 green chillies, sliced",
            "1/2 tsp fenugreek leaves, crushed"
        ],
        "instructions": [
            "For marinating the chicken",
            "In a mixing bowl, mix red chilli powder, ginger garlic paste, salt and curd.  ",
            "Add the raw chicken pieces to the marinade and mix well. Keep it in the refrigerator overnight or minimum 6 hours.  ",
            "Roast the marinated chicken in a tandoor or an oven for about 10-12 minutes until it is three-fourth done.  ",
            "For the chicken gravy",
            "Heat half the quantity of white butter in pan. ",
            "Pour in the tomato puree, and saute for 2-3 minutes. Add cumin seeds, sugar, red chilli powder and salt. Mix well.  ",
            "Add the prepared chicken, white butter, fresh cream, sliced green chillies and crushed fenugreek leaves.  Saute for 3-4 minutes and let the chicken cook.",
            "Cook till chicken is done. Serve hot with rice or naan."
        ],
        "cook_time": "30 Minutes + Marination time (overnight)",
        "cuisine": "spanish"
    },
    {
        "name": "Pisto Manchego",
        "ingredients": [
            "4 ripe tomatoes",
            "2 medium sized onions, sliced",
            "2 green peppers (simla mirch), sliced",
            "1 red pepper, sliced",
            " 2 courgettes (zucchini), sliced into 1cm thick rounds",
            "3 cloves garlic, chopped",
            "3 Tbsp olive oil",
            "1 tsp sugar",
            "1/4 tsp salt",
            "A pinch of black pepper"
        ],
        "instructions": [
            "Place the tomatoes in boiling water for a couple of minutes to loosen the skin.",
            "Take them out of the water and carefully peel them. Cut them into small pieces about 2 cm.",
            "Put the olive oil into a frying pan, and gently fry the garlic and onions for a couple of minutes.",
            "Add the peppers and turn up the heat a little. Cook for five minutes, stirring all the time.",
            "Add the courgettes, stir and cook for five more minutes and then add the tomatoes. Cover the pan, and leave to simmer for about 15 minutes.",
            "Tip in the sugar, salt and pepper. Turn up the heat and stir well.",
            "If the pisto has too much liquid, let it boil away but keep stirring so that none of the ingredients stick to the bottom.",
            "Serve with crusty bread. "
        ],
        "cook_time": "35 minutes",
        "cuisine": "spanish"
    },
    {
        "name": "Manju Malhis Spanish Omelette",
        "ingredients": [
            "3 Tbsp olive oil",
            "1 medium onion, chopped",
            "275 gm small potatoes, peeled and chopped into 1cm cubes",
            "5 large eggs, beaten in a large bowl",
            "Salt",
            "Freshly milled black pepper"
        ],
        "instructions": [
            "Heat a large frying and add the oil. Tip in the potatoes and cook until soft heat gently, add the diced potatoes and cook until soft.",
            "Then add the onions, salt and pepper and cook until all the vegetables are soft. Pour off any excess oil with a spoon.",
            "Add the potato and onion mixture to the bowl containing the eggs, stir thoroughly.",
            "Add some fresh oil to the frying pan, pour in the mixture and fry for about 10 minutes over a moderate heat, making sure that you shake the pan frequently to prevent the omelets from sticking.",
            "When the underneath is firm, turn the omelets over by placing a large plate over the frying pan and flipping over, then slip back into the pan, alternatively you can cook the other side by putting the frying pan under the grill.",
            "Continue cooking until the omelets is set all the way through.",
            "Allow the omelette to rest for a few minutes after removing from the pan.",
            "It can be eaten hot or cold and is delicious straight from the fridge and served with salad."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "spanish"
    },
    {
        "name": "Prawn and Chicken Jambalaya",
        "ingredients": [
            "250 gm large raw prawns",
            "200 gm boneless chicken, chopped into 2cm pieces",
            "1 onion, sliced",
            "1 green pepper, chopped",
            "4 garlic cloves, chopped",
            "1 piece root ginger, peeled and chopped",
            "1 chicken stock cube",
            "2 tomatoes, finely chopped",
            "150 gm Basmati rice, washed",
            "2-3 Tbsp vegetable oil",
            "2 bay leaves"
        ],
        "instructions": [
            "Bring a small pan of water to the boil and tip in the raw prawns. ",
            "Simmer for 3 minutes. Remove them with a slotted spoon and set aside.",
            "Then prepare the chicken stock by adding the stock cube to 400ml of hot water along with the chicken and stirring until the cube has dissolved.",
            "Remove the chicken pieces from the stock.",
            "In a frying pan or wok, heat the oil and tip in the onion. Fry for 5-7 minutes until the onion softens.",
            "Then add the green pepper. Stir-fry the onion and pepper until they start to develop browned edges.",
            "Add the garlic and ginger followed by the celery pieces and fry for 3 minutes. Tip in the washed rice - making sure that the rice gets thoroughly coated with the remaining ingredients in the pan. ",
            "When the rice is well stirred - add the stock liquid and turn up the flame until the pot reaches the boil. ",
            "Throw in the chopped tomato and bay leaves. Then put the lid on the pot - and cook on a low heat for 10-15 minutes until the rice is done.",
            "After 20 minutes, add the cooked chicken and prawns. Carefully stir them around in the rice mixture.",
            "Then put the lid back on - and let the rice rest for 5 minutes.",
            "Sprinkle the parsley and spring onion on top of the mixture in the pot - and stir gently.  "
        ],
        "cook_time": "45 Minutes",
        "cuisine": "spanish"
    },
    {
        "name": "Patatas Bravas",
        "ingredients": [
            "15 potatoes (boiled)",
            "1 medium onion",
            "4-5 cloves garlic ",
            "1/2 Tbsp paprika",
            "3-4 Tbsp tabasco ",
            "1/2 Tbsp red wine vinegar ",
            "1/2 cup tomato ketchup ",
            "Salt & pepper to taste",
            "1/2 mayonnaise"
        ],
        "instructions": [
            "For the Sauce:",
            "\nBlend onions and garlic in a blender.",
            "\nSaute the blended mixture on a pan in olive oil.",
            "\nWhen lightly sauteed add paprika, tabasco, red wine vinegar, tomato ketchup salt and pepper.",
            "\nBring to a light boil and transfer to a glass bowl and set in fridge to cool.",
            "For the Potato:",
            "\nIn another pan heat some oil and fry the potatoes.",
            "\nOnce they have turned a golden brown strain them and wait for the oil to drain completely.",
            "\nTake the sauce out of the fridge and add in half cup of mayonnaise.",
            "\nStir well and serve with potatoes."
        ],
        "cook_time": "30 minutes + time to set",
        "cuisine": "spanish"
    },
    {
        "name": "Spanish Fish Fry",
        "ingredients": [
            "Sole fish ",
            "\n1 cup sliced tomatoes ",
            "\n1 cup sliced onions ",
            "\n1/2 tbs lemon juice ",
            "\n1/2 cup olive oil ",
            "\n2 tsp ginger and garlic paste ",
            "\n2 bay leaves ",
            "\n2 cinnamon sticks",
            "\n3-4 chopped green chillies ",
            "\n2 tbs vinegar ",
            "\nSalt ",
            "\n1/2 cup water"
        ],
        "instructions": [
            "Dice onions and tomatoes into thin slices. ",
            "\nCut the sole fish into big pieces. Marinate it with salt and lemon juice for thirty minutes. ",
            "To Make the Curry:",
            "Heat some olive oil in a pan, add ginger paste and garlic paste and saute till the mixture turns brown.",
            "Add cinnamon, bay leaves, sliced onions and tomatoes. Add salt, green chillies and then water. Cover and simmer for sometime. ",
            "\nHeat olive oil in a pan, add vinegar, salt and water.",
            "As it boils add the fish pieces.Take them out in a dish and pour curry over it. Serve hot."
        ],
        "cook_time": "40 minutes",
        "cuisine": "spanish"
    },
    {
        "name": "Paella",
        "ingredients": [
            "3 Tbsp olive oil",
            "2 chicken breasts, chopped into bite-size pieces",
            "2 tomatoes, chopped",
            "1 red pepper, chopped",
            "4 garlic cloves, chopped",
            "2 cups basmati rice, washed",
            "1/2 lemon, lime juice",
            "1/2 tsp black pepper",
            "1 Tbsp chopped fresh parsley",
            "1 tsp dried mixed herbs",
            "1 tsp dried thyme",
            "1/2 tsp salt"
        ],
        "instructions": [
            "Heat the olive oil in a frying pan.",
            "Add the chicken and fry until the pieces are brown on the outside. Heat 500ml of water in another pan.",
            "Tip in the chicken, turn down the heat and let it simmer for about 30 minutes.",
            "In the frying pan add the pepper and fry for 3 minutes. Transfer to a bowl. ",
            "Add the tomatoes, pepper and garlic to the frying pan and fry them in the leftover oil for 5 minutes.",
            "Tip in the rice and stir in the grains gently.",
            "Place the chicken pieces along with the water to the rice mixture along with the lemon juice, black pepper, parsley, dried herbs, thyme and salt.",
            "Cover and simmer until the rice is cooked."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "spanish"
    },
    {
        "name": "Spanish Meat Balls",
        "ingredients": [
            "2 medium onions, crushed",
            "2 cloves garlic , crushed",
            "2 whole cloves",
            "1 small glass of white wine",
            "Little flour",
            "1/2 tsp salt",
            "1/2 tsp pepper",
            "1 bay leaf",
            "1/2 cup tomato puree",
            "Half a stock cube, dissolved in a cup of hot water",
            "400g minced chicken",
            "1 tsp minced fresh parsley",
            "3 tsp soy sauce",
            "1 tsp dried oregano or mixed herbs",
            "2 Tbsp bread crumbs",
            "5 Tbsp Olive oil",
            "2 small, ripe tomatoes, chopped",
            "A small cup of peas"
        ],
        "instructions": [
            "Grate one of the onion and crush one of the clove of garlic.",
            "Add the grated onion, chopped garlic, Soy sauce, oregano or mixed herbs and the bread crumbs to the meat, and mix all ingredients together.",
            "Make a small ball with the mixture about the size of a large marble.",
            "Coat them lightly in the flour and put all the balls on a large plate until you are ready to fry them.",
            "Now make the sauce. Finely chop the other onion and garlic clove.",
            "Place both of them in a non-stick pan with 3 tbsp olive oil, fresh parsley, salt and pepper.",
            "Fry gently until they are soft. Add the tomatoes and continue to cook.",
            "Pour in the white wine and the cloves, the stock cube dissolved in water, the peas, the bay leaf and the tomato puree.",
            "Put the remaining olive oil in a separate non-stick frying pan, enough to cover the bottom of the pan and fry the meatballs until they are brown all over.",
            "You will probably need to fry them in 2 or 3 batches, depending on the size of your fry pan.",
            "As each batch is ready, put the meat balls straight into the pan with the sauce. ",
            "When they are all done and in the pan, leave them to simmer in the sauce for about half an hour.",
            "You can serve the meatballs on their own as a tapes dish or as a main course accompanied by a green leafy salad or red pepper salad."
        ],
        "cook_time": "45 Minutes",
        "cuisine": "spanish"
    },
    {
        "name": "Champinones al ajillo (Garlic mushrooms)",
        "ingredients": [
            "500 grams white mushrooms, washed and chopped",
            "1 pod garlic, crushed",
            "3-4 birds eye dried red chillies, crushed",
            "Parsley",
            "Lemon juice",
            "Salt",
            "A pinch of paprika powder"
        ],
        "instructions": [
            "Heat about 10 tablespoons of Spanish olive oil in a pan. When heated, add the crushed birds eye red chillies and garlic.",
            "Saute till garlic begins to change color, (please do not burn garlic) and then add your mushrooms, stir fry on high heat. When mushrooms have reduced in size means they are done. ",
            "Turn off the fire. Add salt, parsley, lemon juice and paprika powder.",
            "Serve with french baguette. You have to dip the bread in the garlic parsley infused oil. "
        ],
        "cook_time": "15 minutes",
        "cuisine": "spanish"
    },
    {
        "name": "Spanish Fried Chicken",
        "ingredients": [
            "1 chicken - cut into curry sized pieces    ",
            "2 Tbsp garlic    ",
            "1 Tbsp dried red chillies    ",
            "Rock salt to taste    ",
            "70 ml olive oil    oil for poaching     ",
            "For the Garlic Mayonnaise:100 gm peeled garlic    ",
            "70 gm olive oil    ",
            "Salt    ",
            "1 egg yolk     ",
            "For the Tomato Salsa:",
            "200 gm tomatoes    ",
            "8-10 garlic cloves    ",
            "20 ml olive oil    ",
            "Dash of sherry  ",
            "Salt to taste."
        ],
        "instructions": [
            "Poach the chicken in the oil on a slow flame until cooked. Drain.   ",
            "Heat the olive oil and fry the chicken until the skin is crisp. ",
            "Sprinkle with salt and lower the heat. ",
            "Add garlic and allow to brown.   ",
            "Then toss in the chilli and serve.     ",
            "For the Mayonnaise: ",
            "Blend the egg with the garlic. ",
            "Continue blending while gradually pouring in the oil. Season well.     ",
            "For the Salsa:",
            "Blend the garlic and gradually add tomatoes. ",
            "Add remaining ingredients and serve."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "spanish"
    },
    {
        "name": "Chicken Paella",
        "ingredients": [
            "For the saffron stock:",
            "1 liter water",
            "10 strands saffron",
            "For the chicken:",
            "3 chicken thighs",
            "3 gm paprika",
            "1 tsp red chillies",
            "Salt",
            "1 Tbsp olive oil + 1 tsp oil",
            "For the sea food:",
            "15 gm squids, sliced",
            "3-4 prawns, deshelled and deveined",
            "4-5 cubes fish",
            "4-5 Tbsp white wine",
            "For the vegetables:",
            "1/2 onion, diced",
            "1/2 red bell pepper, diced",
            "1/2 green bell pepper, diced",
            "1/2 yellow bell pepper, diced",
            "1/2 cup zucchini, diced",
            "1 Tbsp garlic paste",
            "250 gm risotto rice",
            "1 cup white wine",
            "Paprika, a pinch",
            "Salt, a pinch",
            "4-5 olives",
            "1/2 cup green peas"
        ],
        "instructions": [
            "For the saffron stock:",
            "In a pan bowl the water and saffron together. Keep aside.",
            "For the chicken:",
            "Marinate chicken thighs in paprika, red chilli powder, olive oil and salt.",
            "Sear the chicken in some olive oil.",
            "Bake for 10-15 minutes or till half done at 200 degrees C.",
            "For the sea food:",
            "In a same pan add the sea food and white wine. Sear it off quickly. keep aside.",
            "For the vegetables and rice:",
            "In the same pan add onions, belle peppers, zucchini, garlic. Saute for 2-3 minutes.",
            "Add the rice and saute till rice are translucent.",
            "Add the white wine, salt, paprika, peas and olives.",
            "Add the saffron stock and cook for 2 minutes.",
            "Transfer this into the oven and bake for 10-15 minutes at 180 degree C.",
            "Garnish with tomato wedges and some coriander or thyme.",
            "Serve hot."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "spanish"
    },
    {
        "name": "Chocolate Cake in a Pressure Cooker",
        "ingredients": [
            "1 cup flour  ",
            "1/4 cup cocoa powder  ",
            "1 1/4 tsp baking powder",
            "1/4 cup butter",
            "3/4 cup caster sugar",
            "1/4 cup water  ",
            "2 eggs  ",
            "1/2 tsp vanilla essence",
            "1/8 tsp salt  ",
            "6 inch round greased baking tin"
        ],
        "instructions": [
            "In a mixing bowl, sift the flour, cocoa powder and baking powder. ",
            "Add in the butter, sugar, salt, water and vanilla, and beat the ingredients using a whisk.     ",
            "Add the eggs and beat the batter until smooth. ",
            "Transfer into the baking tin.    ",
            "Heat the pressure cooker, covered with the lid but without the pressure, for 3-4 minutes on high heat, then place the cake tin in the empty cooker (do not add water in the cooker).     ",
            "Close the lid (without the pressure), lower the flame and let it cook until done (about 30 minutes)."
        ],
        "cook_time": "1 Hour",
        "cuisine": "spanish"
    },
    {
        "name": "Honey Chilli Potatoes",
        "ingredients": [
            "For the potatoes:",
            "2 potatoes, peeled and sliced",
            "3-4 Tbsp cornflour or maida",
            "Salt to taste",
            "1 tsp red chilli powder",
            "Oil, for deep frying",
            "For the base:",
            "1 tsp oil",
            "2 spring onions (with stalk), sliced",
            "1 Tbsp garlic paste",
            "1 capsicum, sliced",
            "2 Tbsp honey",
            "Salt, to taste",
            "1/4 tsp soya sauce",
            "3 tsp white sesame seeds",
            "2 tsp chilli sauce"
        ],
        "instructions": [
            "For the potatoes:",
            "In a bowl, add cornflour or maida, salt and red chilli powder.",
            "Add the sliced potatoes and mix well until the potatoes are coated.",
            "Heat oil in a wok and deep fry the potatoes until golden. Keep aside.",
            "For the Base:",
            "In a wok, add oil, garlic paste and spring onions. Saute on high heat for 1 minute.",
            "Add capsicum, honey, salt, soya sauce, chilli sauce. Saute for 2-3 minutes.",
            "Add the deep-fried potatoes and sesame seeds. Mix well and serve hot."
        ],
        "cook_time": "25 Minutes",
        "cuisine": "spanish"
    },
    {
        "name": "Vegetable Momos",
        "ingredients": [
            "For Dough:",
            "2 cups maida",
            "1/2 tsp salt ",
            "1/2 tsp baking powder   ",
            "For Filling: ",
            "1 cup carrots - grated ",
            "1 cup cabbage - grated ",
            "1 Tbsp oil ",
            "1/2 cup onion - finely chopped ",
            "1 tsp garlic - chopped  ",
            "1 tsp Soya sauce ",
            "Salt ",
            "1/4 tsp vinegar ",
            "1/4 tsp black pepper"
        ],
        "instructions": [
            "Mix the maida, salt and baking powder and knead to a stiff dough with water. ",
            "Heat oil and add the onion and garlic. ",
            "Saute over high heat and add the carrot and cabbage. Turn around over high heat till glossy. ",
            "Take it off the heat and mix in the Soya sauce, salt, vinegar and black pepper. ",
            "Roll the dough thin (translucent) and cut into 4\"-5\" rounds. ",
            "Take a round, wet edges and place some filling in the center. ",
            "Bring edges together to cover the filling. Twist to seal and fill the rest in the same way. ",
            "Steam for about 10 minutes and serve with soya sauce and chilli sauce."
        ],
        "cook_time": "40 Minutes",
        "cuisine": "spanish"
    },
    {
        "name": "Chole Bhature",
        "ingredients": [
            "For chole:",
            "2 cup chickpeas (channas)",
            "2 tsp oil",
            "1 bay leaf (tej patta)",
            "1 stick cinnamon (dalchini)",
            "3-4 cloves (laung)",
            "1 tsp whole pepper corns (sabut kali mirch)",
            "3 green cardamom  (choti elaichi)",
            "2 black cardamom (badi elaichi)",
            "1 tsp turmeric powder (haldi)",
            "1 tsp chili powder (lal mirch powder)",
            "1 tsp coriander powder (dhaniya powder)",
            "1 tsp cumin powder (zeera powder)",
            "1 tsp cumin seeds (zeera)",
            "1/2 tsp asafoetida (heeng)",
            "Salt to taste",
            "1 cup onions (chopped)",
            "1 cup tomatoes (chopped)",
            "1 tsp ginger (chopped)",
            "1 tsp garlic (chopped)",
            "1 tsp ajwain",
            "1 tsp lime juice",
            "1 green chili (chopped)                      1 tea bag                                                1 Tbsp butter",
            "For the bhaturas:",
            "2 cups maida (refined flour)",
            "1/2 tsp yeast, dissolved for 10 minutes in luke warm water",
            "1/2 cup whole wheat flour",
            "A pinch of salt",
            "Water to knead",
            "Oil for frying"
        ],
        "instructions": [
            "For chole:",
            "In a pan add oil, bay leaf, cinnamon, cumin seeds, cloves, whole pepper corns, green and black cardamom.",
            "After it gets brown add chopped onions and saute it.",
            "After sauteing add chopped ginger and garlic.",
            "Then add turmeric, chili powder, coriander powder, cumin powder, asafoetida, salt and fry well.",
            "For de glazing the pan add little water.",
            "Now add the chole (soaked overnight and pressure cooked) to the masala.",
            "After stirring well add tomatoes, little sugar and salt to the chole (chickpeas)",
            "Now add ajwain, chopped green chilies and water for the base.",
            "To get the color in the chole, add a tea bag to the masala.",
            "Simmer the chole gently for an hour and cover it.",
            "Add lime juice and a dollop of butter to it.",
            "Garnish the chole with coriander and butter.",
            "Serve the chole hot with bhaturas.",
            "For the bhaturas:",
            "Knead the whole wheat flour, maida and salt together with adequate amount of water.",
            "Sprinkle the yeast on top. Leave it for 2-3 hours for the yeast to work.",
            "Divide it into equal portions. Roll out in an oval or round shape.",
            "Deep fry till golden brown, like a puri.",
            "Serve. "
        ],
        "cook_time": "1 Hour",
        "cuisine": "spanish"
    },
    {
        "name": "Quick Chicken Curry",
        "ingredients": [
            "1 kg chicken",
            "3 large onions, paste",
            "2 large tomatoes, pureed",
            "1 Tbsp garlic paste",
            "1 Tbsp ginger paste",
            "2 tsp coriander powder",
            "2 tsp cumin powder",
            "1/2 tsp turmeric powder",
            "1/2 tsp red chilli powder",
            "1 tsp garam masala powder",
            "2 Tbsp oil",
            "Salt to taste",
            "Chopped coriander for garnish"
        ],
        "instructions": [
            "Heat oil in a pan and sauté the onion paste, garlic & ginger paste till golden brown.",
            "Add tomato puree. When the tomato puree dries up, add coriander powder, cumin powder, garam masala, red chilli powder, turmeric powder and salt. Let the spices cook.",
            "Add chicken pieces into the masala. Stir well and cook till they are golden brown.",
            "Add 1/2 cup of water and stir. Cover with a lid and let it simmer till the chicken is cooked.",
            "Garnish with chopped coriander and serve."
        ],
        "cook_time": "30 Minutes",
        "cuisine": "spanish"
    },
    {
        "name": "Butter Chicken",
        "ingredients": [
            "700 gm raw chicken  ",
            "For theMarinade:",
            "1 tsp red chilli powder ",
            "1 tsp ginger and garlic paste ",
            "Salt to taste ",
            "1/2 kg curd  ",
            "For theGravy:",
            "175 gm white butter ",
            "1/2 tsp black cumin seeds ",
            "1/2 kg tomato, pureed ",
            "1/2 tsp sugar ",
            "1 tsp red chilli powder ",
            "Salt to taste ",
            "100 gm fresh cream ",
            "4 green chillies, sliced",
            "1/2 tsp fenugreek leaves, crushed"
        ],
        "instructions": [
            "For marinating the chicken",
            "In a mixing bowl, mix red chilli powder, ginger garlic paste, salt and curd.  ",
            "Add the raw chicken pieces to the marinade and mix well. Keep it in the refrigerator overnight or minimum 6 hours.  ",
            "Roast the marinated chicken in a tandoor or an oven for about 10-12 minutes until it is three-fourth done.  ",
            "For the chicken gravy",
            "Heat half the quantity of white butter in pan. ",
            "Pour in the tomato puree, and saute for 2-3 minutes. Add cumin seeds, sugar, red chilli powder and salt. Mix well.  ",
            "Add the prepared chicken, white butter, fresh cream, sliced green chillies and crushed fenugreek leaves.  Saute for 3-4 minutes and let the chicken cook.",
            "Cook till chicken is done. Serve hot with rice or naan."
        ],
        "cook_time": "30 Minutes + Marination time (overnight)",
        "cuisine": "spanish"
    }
]